{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn1": {
    "Trivial, insignificant details of mere ethics that an ordinary person speaks of [dn1:0.3]": [
      "The ascetic Gotama has given up killing living creatures.",
      "The ascetic Gotama has given up stealing.",
      "The ascetic Gotama has given up unchastity.",
      "The ascetic Gotama has given up lying.",
      "The ascetic Gotama has given up divisive speech.",
      "The ascetic Gotama has given up harsh speech.",
      "The ascetic Gotama has given up talking nonsense.",
      "The ascetic Gotama refrains from injuring plants and seeds.",
      "He eats in one part of the day, abstaining from eating at night and food at the wrong time.",
      "He refrains from dancing, singing, music, and seeing shows.",
      "He refrains from beautifying and adorning himself with garlands, perfumes, and makeup.",
      "He refrains from high and luxurious beds.",
      "He refrains from receiving gold and money, raw grains, raw meat, women and girls, male and female bondservants, goats and sheep, chickens and pigs, elephants, cows, horses, and mares, and fields and land.",
      "He refrains from running errands and messages; buying and selling; falsifying weights, metals, or measures; bribery, fraud, cheating, and duplicity; mutilation, murder, abduction, banditry, plunder, and violence."
    ],
    "Ascetics and brahmins who engage in certain activities while enjoying food given in faith [dn1:1.11.0]": [
      "Engage in injuring plants and seeds",
      "Engage in storing up goods for their own use",
      "Engage in seeing shows",
      "Engage in gambling that causes negligence",
      "Make use of high and luxurious bedding",
      "Engage in beautifying and adorning themselves with garlands, fragrance, and makeup",
      "Engage in unworthy talk",
      "Engage in arguments",
      "Engage in running errands and messages",
      "Engage in deceit, flattery, hinting, and belittling, and using material possessions to chase after other material possessions",
      "Injuring plants and seeds",
      "Storing up goods for their own use",
      "Seeing shows",
      "Gambling that causes negligence",
      "Making use of high and luxurious bedding",
      "Beautifying and adorning themselves with garlands, fragrance, and makeup",
      "Engaging in unworthy talk",
      "Engaging in arguments",
      "Running errands and messages",
      "Engaging in deceit, flattery, hinting, and belittling, and using material possessions to chase after other material possessions"
    ],
    "The ordinary person's praise of the Realized One [dn1:1.11.0] (a structured repetition)": [
      "The ascetic Gotama refrains from such injury to plants and seeds.",
      "The ascetic Gotama refrains from storing up such goods.",
      "The ascetic Gotama refrains from such shows.",
      "The ascetic Gotama refrains from such gambling.",
      "The ascetic Gotama refrains from such bedding.",
      "The ascetic Gotama refrains from such beautification and adornment.",
      "The ascetic Gotama refrains from such unworthy talk.",
      "The ascetic Gotama refrains from such argumentative talk.",
      "The ascetic Gotama refrains from such errands.",
      "The ascetic Gotama refrains from such deceit and flattery."
    ],
    "Unworthy branches of knowledge, wrong livelihood [dn1:1.21.0] (a structured repetition)": [
      "Limb-reading, omenology, divining celestial portents, interpreting dreams, divining bodily marks, divining holes in cloth gnawed by mice, fire offerings, ladle offerings, offerings of husks, rice powder, rice, ghee, or oil; offerings from the mouth, blood sacrifices, palmistry; geomancy for building sites, fields, and cemeteries; exorcisms, earth magic, snake charming, poisons; the crafts of the scorpion, the rat, the bird, and the crow; prophesying life span, chanting for protection, and deciphering animal cries.",
      "Reading the marks of gems, cloth, clubs, swords, spears, arrows, weapons, women, men, boys, girls, male and female bondservants, elephants, horses, buffaloes, bulls, cows, goats, rams, chickens, quails, monitor lizards, rabbits, tortoises, or deer.",
      "Making predictions that the king will march forth or march back; or that our king will attack and the enemy king will retreat, or vice versa; or that our king will triumph and the enemy king will be defeated, or vice versa; and so there will be victory for one and defeat for the other.",
      "Making predictions that there will be an eclipse of the moon, or sun, or stars; that the sun, moon, and stars will be in conjunction or in opposition; that there will be a meteor shower, a fiery sky, an earthquake, thunder; that there will be a rising, a setting, a darkening, a brightening of the moon, sun, and stars. And it also includes making predictions about the results of all such phenomena.",
      "Predicting whether there will be plenty of rain or drought; plenty to eat or famine; an abundant harvest or a bad harvest; security or peril; sickness or health. It also includes such occupations as computing, accounting, calculating, poetry, and cosmology.",
      "Making arrangements for giving and taking in marriage; for engagement and divorce; and for scattering rice inwards or outwards at the wedding ceremony. It also includes casting spells for good or bad luck, causing abortions, binding the tongue, or locking the jaws; charms for the hands and ears; questioning a mirror, a girl, or a god as an oracle; worshiping the sun, worshiping the Great One, breathing fire, and invoking Siri, the goddess of luck.",
      "Rites for propitiation, for granting wishes, for ghosts, for the earth, for rain, for property settlement, and for preparing and consecrating house sites, and rites involving rinsing and bathing, and oblations. It also includes administering emetics, purgatives, expectorants, and phlegmagogues; administering ear-oils, eye restoratives, nasal medicine, ointments, and counter-ointments; surgery with needle and scalpel, treating children, prescribing root medicines, and binding on herbs.",
      "Limb-reading, omenology, divining celestial portents, interpreting dreams, divining bodily marks, divining holes in cloth gnawed by mice, fire offerings, ladle offerings, offerings of husks, rice powder, rice, ghee, or oil; offerings from the mouth, blood sacrifices, palmistry; geomancy for building sites, fields, and cemeteries; exorcisms, earth magic, snake charming, poisons; the crafts of the scorpion, the rat, the bird, and the crow; prophesying life span, chanting for protection, and deciphering animal cries.",
      "Reading the marks of gems, cloth, clubs, swords, spears, arrows, weapons, women, men, boys, girls, male and female bondservants, elephants, horses, buffaloes, bulls, cows, goats, rams, chickens, quails, monitor lizards, rabbits, tortoises, or deer.",
      "Making predictions that the king will march forth or march back; or that our king will attack and the enemy king will retreat, or vice versa; or that our king will triumph and the enemy king will be defeated, or vice versa; and so there will be victory for one and defeat for the other.",
      "Making predictions that there will be an eclipse of the moon, or sun, or stars; that the sun, moon, and stars will be in conjunction or in opposition; that there will be a meteor shower, a fiery sky, an earthquake, thunder; that there will be a rising, a setting, a darkening, a brightening of the moon, sun, and stars. And it also includes making predictions about the results of all such phenomena.",
      "Predicting whether there will be plenty of rain or drought; plenty to eat or famine; an abundant harvest or a bad harvest; security or peril; sickness or health. It also includes such occupations as computing, accounting, calculating, poetry, and cosmology.",
      "Making arrangements for giving and taking in marriage; for engagement and divorce; and for scattering rice inwards or outwards at the wedding ceremony. It also includes casting spells for good or bad luck, causing abortions, binding the tongue, or locking the jaws; charms for the hands and ears; questioning a mirror, a girl, or a god as an oracle; worshiping the sun, worshiping the Great One, breathing fire, and invoking Siri, the goddess of luck.",
      "Rites for propitiation, for granting wishes, for ghosts, for the earth, for rain, for property settlement, and for preparing and consecrating house sites, and rites involving rinsing and bathing, and oblations. It also includes administering emetics, purgatives, expectorants, and phlegmagogues; administering ear-oils, eye restoratives, nasal medicine, ointments, and counter-ointments; surgery with needle and scalpel, treating children, prescribing root medicines, and binding on herbs."
    ],
    "Theories about the past [dn1:1.21.0]": [
      "Theorizing about the past and asserting various hypotheses concerning the past on eighteen grounds. ",
      "The eighteen grounds on which they rely."
    ],
    "The four grounds on which some ascetics and brahmins rely to assert that the self and the cosmos are eternal [dn1:1.30.0] (a sequence)": [
      "When some ascetic or brahmin—by dint of keen, resolute, committed, and diligent effort, and right focus—experiences an immersion of the heart of such a kind that they recollect their many kinds of past lives.",
      "When some ascetic or brahmin—by dint of keen, resolute, committed, and diligent effort, and right focus—experiences an immersion of the heart of such a kind that they recollect their many kinds of past lives, that is, one eon of the cosmos contracting and expanding; two, three, four, five, or ten eons of the cosmos contracting and expanding.",
      "When some ascetic or brahmin—by dint of keen, resolute, committed, and diligent effort, and right focus—experiences an immersion of the heart of such a kind that they recollect their many kinds of past lives, that is, ten eons of the cosmos contracting and expanding; twenty, thirty, or forty eons of the cosmos contracting and expanding.",
      "When some ascetic or brahmin relies on logic and inquiry."
    ],
    "The principles which the Realized One makes known after realizing them with his own insight [dn1:1.30.0] (a sequence)": [
      "Deep",
      "Hard to see",
      "Hard to understand",
      "Peaceful",
      "Sublime",
      "Beyond the scope of logic",
      "Subtle",
      "Comprehensible to the astute."
    ],
    "The four grounds on which partial eternalists rely [dn1:2.1.0]": [
      "There comes a time when, after a very long period has passed, this cosmos contracts.",
      "There comes a time when, after a very long period has passed, this cosmos expands.",
      "There are gods named ‘depraved by play.’",
      "There are gods named ‘malevolent’.",
      "When some ascetic or brahmin relies on logic and inquiry.",
      "There comes a time when, after a very long period has passed, this cosmos contracts.",
      "There comes a time when, after a very long period has passed, this cosmos expands.",
      "There are gods named ‘depraved by play.’",
      "There are gods named ‘malevolent’.",
      "Some ascetic or brahmin relies on logic and inquiry."
    ],
    "The characteristics of the gods who are not malevolent [dn1:2.1.0]": [
      "They don’t spend too much time gazing at each other.",
      "They don’t grow angry with each other.",
      "Their bodies and minds don’t get tired.",
      "They don’t pass away from that host of gods."
    ],
    "The characteristics of the gods who are not depraved by play [dn1:2.1.0]": [
      "They don’t spend too much time laughing, playing, and making merry.",
      "They don’t lose their mindfulness.",
      "They don’t pass away from that host of gods."
    ],
    "The characteristics of the being who was reborn there first [dn1:2.1.0]": [
      "They are Brahmā, the Great Brahmā, the Undefeated, the Champion, the Universal Seer, the Wielder of Power, the Lord God, the Maker, the Author, the First, the Begetter, the Controller, the Father of those who have been born and those yet to be born.",
      "They are more long-lived, beautiful, and illustrious than those who arrived later."
    ],
    "The characteristics of the beings who were reborn there later [dn1:2.1.0]": [
      "They think that the being who was reborn there first is Brahmā, the Great Brahmā, the Undefeated, the Champion, the Universal Seer, the Wielder of Power, the Lord God, the Maker, the Author, the First, the Begetter, the Controller, the Father of those who have been born and those yet to be born.",
      "They were created by that Brahmā.",
      "They are impermanent, not lasting, short-lived, perishable, and have come to this state of existence."
    ],
    "Ordinary person's praise of the Realized One (a structured repetition) [dn1:1.11.0]": [
      "The ascetic Gotama refrains from such injury to plants and seeds.",
      "The ascetic Gotama refrains from storing up such goods.",
      "The ascetic Gotama refrains from such shows.",
      "The ascetic Gotama refrains from such gambling.",
      "The ascetic Gotama refrains from such bedding.",
      "The ascetic Gotama refrains from such beautification and adornment.",
      "The ascetic Gotama refrains from such unworthy talk.",
      "The ascetic Gotama refrains from such argumentative talk.",
      "The ascetic Gotama refrains from such errands.",
      "The ascetic Gotama refrains from such deceit and flattery."
    ],
    "The eighteen grounds on which ascetics and brahmins rely to theorize about the past [dn1:1.21.0]": [
      "That the world is eternal",
      "That the world is not eternal",
      "That the world is finite",
      "That the world is infinite",
      "That the soul and the body are the same",
      "That the soul is one thing and the body another",
      "That the Realized One exists after death",
      "That the Realized One does not exist after death",
      "That the Realized One both exists and does not exist after death",
      "That the Realized One neither exists nor does not exist after death",
      "That the world is the same everywhere",
      "That the world is different everywhere",
      "That the soul is the same as the body in every way",
      "That the soul is one thing and the body another in every way",
      "That the Realized One is a Tathāgata",
      "That the Realized One is not a Tathāgata",
      "That the Realized One both is and is not a Tathāgata",
      "That the Realized One neither is nor is not a Tathāgata"
    ],
    "The four grounds on which some ascetics and brahmins rely to assert that the self and the cosmos are eternal [dn1:1.30.0]": [
      "The first ground - recollection of many kinds of past lives",
      "The second ground - recollection of one or more eons of the cosmos contracting and expanding",
      "The third ground - recollection of ten or more eons of the cosmos contracting and expanding",
      "The fourth ground - reliance on logic and inquiry"
    ],
    "The principles [dn1:1.30.0]": [
      "Deep",
      "Hard to see",
      "Hard to understand",
      "Peaceful",
      "Sublime",
      "Beyond the scope of logic",
      "Subtle",
      "Comprehensible to the astute"
    ],
    "The destiny in the next life (a causal sequence) [dn1:2.1.0]": [
      "If you hold on to and attach to these grounds for views",
      "It leads to such and such a destiny in the next life."
    ],
    "The four grounds on which some ascetics and brahmins rely to assert that the cosmos is finite or infinite [dn1:2.16.0]": [
      "When some ascetic or brahmin experiences an immersion of the heart of such a kind that they meditate perceiving the cosmos as finite",
      "When some ascetic or brahmin experiences an immersion of the heart of such a kind that they meditate perceiving the cosmos as infinite",
      "When some ascetic or brahmin experiences an immersion of the heart of such a kind that they meditate perceiving the cosmos as finite vertically but infinite horizontally",
      "When some ascetic or brahmin relies on logic and inquiry"
    ],
    "The principles which the Realized One makes known after realizing them with his own insight [dn1:2.16.0]": [
      "Deep",
      "Hard to see",
      "Hard to understand",
      "Peaceful",
      "Sublime",
      "Beyond the scope of logic",
      "Subtle",
      "Comprehensible to the astute"
    ],
    "The four grounds on which equivocators rely [dn1:2.23.0]": [
      "The first ground - fear and disgust with false speech",
      "The second ground - fear and disgust with grasping",
      "The third ground - fear and disgust with examination",
      "The fourth ground - dullness and stupidity"
    ],
    "The questions asked by the dull and stupid ascetic or brahmin [dn1:2.23.0]": [
      "Whether there is another world",
      "Whether there are beings who are reborn spontaneously",
      "Whether there is fruit and result of good and bad deeds",
      "Whether a Realized One exists after death",
      "Whether a Realized One doesn’t exist after death",
      "Whether a Realized One both exists and doesn’t exist after death",
      "Whether a Realized One neither exists nor doesn’t exist after death."
    ],
    "The two grounds on which some ascetics and brahmins rely to assert that the self and the cosmos arose by chance [dn1:2.30.0]": [
      "Non-percipient beings passing away from that host and being reborn in this state of existence",
      "Ascetics or brahmins relying on logic and inquiry"
    ],
    "The eighteen grounds on which those ascetics and brahmins who theorize about the past assert various hypotheses concerning the past [dn1:2.30.0]": [
      "The world is eternal",
      "The world is not eternal",
      "The world is finite",
      "The world is infinite",
      "The soul and the body are the same",
      "The soul is one thing and the body another",
      "The Tathāgata exists after death",
      "The Tathāgata does not exist after death",
      "The Tathāgata both exists and does not exist after death",
      "The Tathāgata neither exists nor does not exist after death",
      "The Tathāgata is finite",
      "The Tathāgata is infinite",
      "The soul is the same as the body",
      "The soul is one thing and the body another",
      "The Tathāgata is sense-perceptible",
      "The Tathāgata is not sense-perceptible",
      "The Tathāgata is both sense-perceptible and not sense-perceptible",
      "The Tathāgata is neither sense-perceptible nor not sense-perceptible."
    ],
    "The forty-four grounds on which some ascetics and brahmins rely to assert various hypotheses concerning the future [dn1:2.37.0]": [
      "The world is eternal",
      "The world is not eternal",
      "The world is finite",
      "The world is infinite",
      "The soul and the body are the same",
      "The soul is one thing and the body another",
      "The Tathāgata exists after death",
      "The Tathāgata does not exist after death",
      "The Tathāgata both exists and does not exist after death",
      "The Tathāgata neither exists nor does not exist after death",
      "The Tathāgata is finite",
      "The Tathāgata is infinite",
      "The soul is the same as the body",
      "The soul is one thing and the body another",
      "The Tathāgata is sense-perceptible",
      "The Tathāgata is not sense-perceptible",
      "The Tathāgata is both sense-perceptible and not sense-perceptible",
      "The Tathāgata is neither sense-perceptible nor not sense-perceptible",
      "The Tathāgata is and will be after death",
      "The Tathāgata is not and will not be after death",
      "The Tathāgata both is and will be after death",
      "The Tathāgata neither is nor will be after death",
      "The Tathāgata is and will be not after death",
      "The Tathāgata is not and will be after death",
      "The Tathāgata both is not and will be after death",
      "The Tathāgata neither is not nor will be after death",
      "The world is eternal and finite",
      "The world is eternal and infinite",
      "The world is not eternal and finite",
      "The world is not eternal and infinite",
      "The world is both eternal and finite, and not eternal and finite",
      "The world is both eternal and finite, and not eternal and infinite",
      "The world is both eternal and infinite, and not eternal and finite",
      "The world is both eternal and infinite, and not not eternal and infinite",
      "The world is both not eternal and finite, and not eternal and infinite",
      "The world is both not eternal and finite, and not not eternal and infinite",
      "The world is both not eternal and infinite, and not eternal and finite",
      "The world is both not eternal and infinite, and not not eternal and finite",
      "The world is neither eternal nor finite, nor not eternal nor finite",
      "The world is neither eternal nor infinite, nor not eternal nor infinite",
      "The world is neither not eternal nor finite, nor not not eternal nor finite",
      "The world is neither not eternal nor infinite, nor not not eternal nor infinite",
      "The world is both eternal and finite, and eternal and infinite, and not eternal and finite, and not eternal and infinite",
      "The world is neither eternal nor finite, nor eternal nor infinite, nor not eternal nor finite, nor not eternal nor infinite."
    ],
    "The sixteen grounds on which some ascetics and brahmins rely to assert that the self lives on after death in a percipient form [dn1:2.38.0]": [
      "The self is well and percipient after death, and it is physical",
      "The self is well and percipient after death, and it is non-physical",
      "The self is well and percipient after death, and it is both physical and non-physical",
      "The self is well and percipient after death, and it is neither physical nor non-physical",
      "The self is well and percipient after death, and it is finite",
      "The self is well and percipient after death, and it is infinite",
      "The self is well and percipient after death, and it is both finite and infinite",
      "The self is well and percipient after death, and it is neither finite nor infinite",
      "The self is well and percipient after death, and it is of unified perception",
      "The self is well and percipient after death, and it is of diverse perception",
      "The self is well and percipient after death, and it is of limited perception",
      "The self is well and percipient after death, and it is of limitless perception",
      "The self is well and percipient after death, and it experiences nothing but happiness",
      "The self is well and percipient after death, and it experiences nothing but suffering",
      "The self is well and percipient after death, and it experiences both happiness and suffering",
      "The self is well and percipient after death, and it experiences neither happiness nor suffering."
    ],
    "The eight grounds on which some ascetics and brahmins rely to assert that the self lives on after death in a non-percipient form [dn1:3.1.0]": [
      "The self is well and non-percipient after death, and it is physical",
      "The self is well and non-percipient after death, and it is non-physical",
      "The self is well and non-percipient after death, and it is both physical and non-physical",
      "The self is well and non-percipient after death, and it is neither physical nor non-physical",
      "The self is well and non-percipient after death, and it is finite",
      "The self is well and non-percipient after death, and it is infinite",
      "The self is well and non-percipient after death, and it is both finite and infinite",
      "The self is well and non-percipient after death, and it is neither finite nor infinite."
    ],
    "The eight grounds on which some ascetics and brahmins rely to assert that the self lives on after death in a neither percipient nor non-percipient form [dn1:3.5.0]": [
      "The self is well and neither percipient nor non-percipient after death, and it is physical",
      "The self is well and neither percipient nor non-percipient after death, and it is non-physical",
      "The self is well and neither percipient nor non-percipient after death, and it is both physical and non-physical",
      "The self is well and neither percipient nor non-percipient after death, and it is neither physical nor non-physical",
      "The self is well and neither percipient nor non-percipient after death, and it is finite",
      "The self is well and neither percipient nor non-percipient after death, and it is infinite",
      "The self is well and neither percipient nor non-percipient after death, and it is both finite and infinite",
      "The self is well and neither percipient nor non-percipient after death, and it is neither finite nor infinite."
    ],
    "The seven grounds on which some ascetics and brahmins rely to assert the annihilation, eradication, and obliteration of an existing being [dn1:3.9.0]": [
      "The self is physical, made up of the four primary elements, and produced by mother and father.",
      "There is another self that is divine, physical, sensual, consuming solid food.",
      "There is another self that is divine, physical, mind-made, complete in all its various parts, not deficient in any faculty.",
      "There is another self which has gone totally beyond perceptions of form. With the ending of perceptions of impingement, not focusing on perceptions of diversity, aware that “space is infinite”, it’s reborn in the dimension of infinite space.",
      "There is another self which has gone totally beyond the dimension of infinite space. Aware that “consciousness is infinite”, it’s reborn in the dimension of infinite consciousness.",
      "There is another self that has gone totally beyond the dimension of infinite consciousness. Aware that “there is nothing at all”, it’s been reborn in the dimension of nothingness.",
      "There is another self that has gone totally beyond the dimension of nothingness. Aware that “this is peaceful, this is sublime”, it’s been reborn in the dimension of neither perception nor non-perception."
    ],
    "The five grounds on which some ascetics and brahmins assert the ultimate extinguishment of an existing being in the present life [dn1:3.19.0]": [
      "The first absorption",
      "The second absorption",
      "The third absorption",
      "The fourth absorption",
      "Giving up pleasure and pain"
    ],
    "The forty-four grounds on which those ascetics and brahmins who theorize about the future assert various hypotheses concerning the future [dn1:3.19.0]": [
      "The four great elements",
      "The five sense fields",
      "The six sense fields",
      "The seven stations of consciousness",
      "The eight deliverances",
      "The nine attainments",
      "The ten recollections",
      "The eleven dimensions of nothingness",
      "The twelve links of dependent origination",
      "The thirteen ascetic practices",
      "The fourteen knowledges",
      "The fifteen factors of dependent origination",
      "The sixteen knowledges",
      "The seventeen knowledges",
      "The eighteen elements",
      "The nineteen kinds of craving",
      "The twenty-two faculties",
      "The twenty-three kinds of craving",
      "The twenty-four conditions",
      "The twenty-five kinds of consciousness",
      "The twenty-six kinds of consciousness",
      "The twenty-seven kinds of craving",
      "The twenty-eight kinds of craving",
      "The twenty-nine kinds of craving",
      "The thirty-two marks of a great man",
      "The thirty-three gods",
      "The thirty-four gods",
      "The thirty-seven aids to awakening",
      "The forty meditation subjects",
      "The forty-one kinds of mindfulness",
      "The forty-two kinds of knowledge",
      "The forty-three kinds of knowledge",
      "The forty-four kinds of knowledge"
    ],
    "The sixty-two grounds on which those ascetics and brahmins who theorize about the past and the future assert various hypotheses concerning the past and the future [dn1:3.19.0]": [
      "The four great elements",
      "The five sense fields",
      "The six sense fields",
      "The seven stations of consciousness",
      "The eight deliverances",
      "The nine attainments",
      "The ten recollections",
      "The eleven dimensions of nothingness",
      "The twelve links of dependent origination",
      "The thirteen ascetic practices",
      "The fourteen knowledges",
      "The fifteen factors of dependent origination",
      "The sixteen knowledges",
      "The seventeen knowledges",
      "The eighteen elements",
      "The nineteen kinds of craving",
      "The twenty-two faculties",
      "The twenty-three kinds of craving",
      "The twenty-four conditions",
      "The twenty-five kinds of consciousness",
      "The twenty-six kinds of consciousness",
      "The twenty-seven kinds of craving",
      "The twenty-eight kinds of craving",
      "The twenty-nine kinds of craving",
      "The thirty-two marks of a great man",
      "The thirty-three gods",
      "The thirty-four gods",
      "The thirty-seven aids to awakening",
      "The forty meditation subjects",
      "The forty-one kinds of mindfulness",
      "The forty-two kinds of knowledge",
      "The forty-three kinds of knowledge",
      "The forty-four kinds of knowledge",
      "The four great elements in the past",
      "The five sense fields in the past",
      "The six sense fields in the past",
      "The seven stations of consciousness in the past",
      "The eight deliverances in the past",
      "The nine attainments in the past",
      "The ten recollections in the past",
      "The eleven dimensions of nothingness in the past",
      "The twelve links of dependent origination in the past",
      "The thirteen ascetic practices in the past",
      "The fourteen knowledges in the past",
      "The fifteen factors of dependent origination in the past",
      "The sixteen knowledges in the past",
      "The seventeen knowledges in the past",
      "The eighteen elements in the past",
      "The nineteen kinds of craving in the past",
      "The twenty-two faculties in the past",
      "The twenty-three kinds of craving in the past",
      "The twenty-four conditions in the past",
      "The twenty-five kinds of consciousness in the past",
      "The twenty-six kinds of consciousness in the past",
      "The twenty-seven kinds of craving in the past",
      "The twenty-eight kinds of craving in the past",
      "The twenty-nine kinds of craving in the past",
      "The thirty-two marks of a great man in the past",
      "The thirty-three gods in the past",
      "The thirty-four gods in the past",
      "The thirty-seven aids to awakening in the past",
      "The forty meditation subjects in the past"
    ],
    "The grounds on which ascetics and brahmins assert that the self and the cosmos are eternal, partially eternal, finite or infinite, or resort to equivocation [dn1:3.45.0]": [
      "Eternal on four grounds",
      "Partially eternal on four grounds",
      "Finite or infinite on four grounds",
      "Resort to equivocation on four grounds"
    ],
    "The grounds on which ascetics and brahmins assert that the self and the cosmos arose by chance [dn1:3.45.0]": [
      "Assert the self and the cosmos arose by chance on two grounds"
    ],
    "The grounds on which ascetics and brahmins theorize about the past [dn1:3.45.0]": [
      "Theorize about the past on these eighteen grounds"
    ],
    "The grounds on which ascetics and brahmins assert that the self lives on after death in a percipient form [dn1:3.45.0]": [
      "Assert the self lives on after death in a percipient form on sixteen grounds"
    ],
    "The grounds on which ascetics and brahmins assert that the self lives on after death in a non-percipient form [dn1:3.45.0]": [
      "Assert the self lives on after death in a non-percipient form on eight grounds"
    ],
    "The grounds on which ascetics and brahmins assert that the self lives on after death in a neither percipient nor non-percipient form [dn1:3.45.0]": [
      "Assert the self lives on after death in a neither percipient nor non-percipient form on eight grounds"
    ],
    "The grounds on which ascetics and brahmins assert the annihilation of an existing being [dn1:3.45.0]": [
      "Assert the annihilation of an existing being on seven grounds"
    ],
    "The grounds on which ascetics and brahmins assert the ultimate extinguishment of an existing being in the present life [dn1:3.45.0]": [
      "Assert the ultimate extinguishment of an existing being in the present life on five grounds"
    ],
    "The grounds on which ascetics and brahmins theorize about the future [dn1:3.45.0]": [
      "Theorize about the future on these forty-four grounds"
    ],
    "Dependent Origination [dn1:3.71.0] (a causal sequence)": [
      "Feeling",
      "Craving",
      "Grasping",
      "Continued existence",
      "Rebirth",
      "Old age and death, sorrow, lamentation, pain, sadness, and distress to come to be."
    ],
    "Names for the exposition of the teaching [dn1:3.72.0]": [
      "The Net of Meaning",
      "The Net of the Teaching",
      "The Prime Net",
      "The Net of Views",
      "The Supreme Victory in Battle"
    ]
  }
}