{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn10": {
    "The three sets of things that the Buddha praised [dn10:0.2]": [
      "The entire spectrum of noble ethics",
      "Immersion",
      "Wisdom"
    ],
    "How a mendicant is accomplished in ethics [dn10:1.6.5.0]": [
      "Giving up killing living creatures",
      "Renouncing the rod and the sword",
      "Living full of compassion for all living beings",
      "Refraining from unworthy branches of knowledge and wrong livelihood"
    ],
    "Unworthy branches of knowledge and wrong livelihood [dn10:1.6.5.0]": [
      "Rites for propitiation, for granting wishes, for ghosts, for the earth, for rain, for property settlement, and for preparing and consecrating house sites, and rites involving rinsing and bathing, and oblations",
      "Administering emetics, purgatives, expectorants, and phlegmagogues; administering ear-oils, eye restoratives, nasal medicine, ointments, and counter-ointments; surgery with needle and scalpel, treating children, prescribing root medicines, and binding on herbs"
    ],
    "The qualities of a mendicant accomplished in ethics [dn10:1.6.5.0]": [
      "Living restrained in the monastic code",
      "Conducting themselves well and seeking alms in suitable places",
      "Keeping the rules they’ve undertaken",
      "Acting skillfully by body and speech",
      "Being purified in livelihood and accomplished in ethical conduct",
      "Guarding the sense doors, having mindfulness and situational awareness, and being content."
    ],
    "How a mendicant guards the sense doors [dn10:2.1.0]": [
      "When a mendicant sees a sight with their eyes",
      "When they hear a sound with their ears",
      "When they smell an odor with their nose",
      "When they taste a flavor with their tongue",
      "When they feel a touch with their body",
      "When they know a thought with their mind"
    ],
    "How a mendicant has mindfulness and situational awareness [dn10:2.1.0]": [
      "When going out and coming back",
      "When looking ahead and aside",
      "When bending and extending the limbs",
      "When bearing the outer robe, bowl, and robes",
      "When eating, drinking, chewing, and tasting",
      "When urinating and defecating",
      "When walking, standing, sitting, sleeping, waking, speaking, and keeping silent"
    ],
    "How a mendicant is content [dn10:2.1.0]": [
      "A mendicant is content with robes to look after the body",
      "A mendicant is content with almsfood to look after the belly"
    ],
    "The five hindrances [dn10:2.1.0]": [
      "Desire",
      "Ill will and malevolence",
      "Dullness and drowsiness",
      "Restlessness and remorse",
      "Doubt"
    ],
    "The stages of immersion [dn10:2.1.0]": [
      "First absorption",
      "Second absorption",
      "Third absorption",
      "Fourth absorption"
    ]
  }
}