{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn13": {
    "Different paths described by brahmins [dn13:8.0]": [
      "The Addhariya brahmins",
      "The Tittiriya brahmins",
      "The Chandoka brahmins",
      "The Bavhadija brahmins"
    ],
    "The five kinds of sensual stimulation that are called ‘chains’ and ‘fetters’ in the training of the Noble One [dn13:24.0]": [
      "Sights known by the eye that are likable, desirable, agreeable, pleasant, sensual, and arousing",
      "Sounds known by the ear that are likable, desirable, agreeable, pleasant, sensual, and arousing",
      "Smells known by the nose that are likable, desirable, agreeable, pleasant, sensual, and arousing",
      "Tastes known by the tongue that are likable, desirable, agreeable, pleasant, sensual, and arousing",
      "Touches known by the body that are likable, desirable, agreeable, pleasant, sensual, and arousing"
    ],
    "The five hindrances that are called ‘obstacles’ and ‘hindrances’ and ‘coverings’ and ‘shrouds’ in the training of the Noble One [dn13:24.0]": [
      "The hindrance of sensual desire",
      "The hindrance of ill will",
      "The hindrance of dullness and drowsiness",
      "The hindrance of restlessness and remorse",
      "The hindrance of doubt"
    ],
    "The path to companionship with Brahmā [dn13:40-75.0]": [
      "Seeing that the hindrances have been given up in them, joy springs up.",
      "Being joyful, rapture springs up.",
      "When the mind is full of rapture, the body becomes tranquil.",
      "When the body is tranquil, they feel bliss.",
      "And when blissful, the mind becomes immersed.",
      "They meditate spreading a heart full of love to one direction, and to the second, and to the third, and to the fourth.",
      "They meditate spreading a heart full of compassion.",
      "They meditate spreading a heart full of rejoicing.",
      "They meditate spreading a heart full of equanimity to one direction, and to the second, and to the third, and to the fourth."
    ],
    "The qualities of a mendicant who meditates like this (a causal sequence) [dn13:40-75.0]": [
      "They are not possessive.",
      "Their heart is not full of enmity.",
      "Their heart is not full of ill will.",
      "Their heart is not corrupted.",
      "They wield power."
    ],
    "The possibility of rebirth in the company of Brahmā [dn13:40-75.0]": [
      "A mendicant who is not possessive will, when the body breaks up, after death, be reborn in the company of Brahmā, who isn’t possessive.",
      "A mendicant who is the same as Brahmā in all things will, when the body breaks up, after death, be reborn in the company of Brahmā."
    ]
  }
}