{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn14": {
    "The Buddhas of the past who have become completely extinguished [dn14:0.3]": [
      "Buddha Vipassī",
      "Buddha Sikhī",
      "Buddha Vessabhū",
      "Buddha Kakusandha",
      "Buddha Koṇāgamana",
      "Buddha Kassapa"
    ],
    "Information about each Buddha of the past [dn14:0.3]": [
      "Name of the Buddha",
      "Caste of the Buddha",
      "Life-span of the Buddha",
      "Place of awakening of the Buddha",
      "Chief disciples of the Buddha",
      "Gatherings of disciples of the Buddha",
      "Chief attendant of the Buddha",
      "Parents and capital city of the Buddha"
    ],
    "Unfinished conversation among the mendicants (a multiple items expanded upon using repetitive or similar sentence structures) [dn14:0.3]": [
      "The power and might of a Realized One",
      "The ability of the Realized One to recollect the caste, names, clans, life-span, chief disciples, and gatherings of disciples of the Buddhas of the past",
      "The knowledge of the caste, names, clans, conduct, qualities, wisdom, meditation, and freedom of the Buddhas of the past",
      "The reason for the Realized One's ability to recollect all these things",
      "The possibility of deities telling the Realized One about these things"
    ],
    "Information about Buddha Vipassī (a multiple items expanded upon using repetitive or similar sentence structures) [dn14:0.3]": [
      "Name of the Buddha",
      "Caste of the Buddha",
      "Life-span of the Buddha",
      "Place of awakening of the Buddha",
      "Chief disciples of the Buddha",
      "Gatherings of disciples of the Buddha",
      "Chief attendant of the Buddha",
      "Parents and capital city of the Buddha"
    ],
    "What’s Normal For One Intent on Awakening [dn14:1.17.0]": [
      "When the being intent on awakening passes away from the host of Joyful Gods, he is conceived in his mother’s womb, mindful and aware.",
      "An immeasurable, magnificent light appears in the world, surpassing the glory of the gods.",
      "Four gods approach to guard the four directions when the being intent on awakening is conceived in his mother’s belly.",
      "The mother becomes naturally ethical when the being intent on awakening is conceived in her belly.",
      "The mother no longer feels sexual desire for men, and she cannot be violated by a man of lustful intent when the being intent on awakening is conceived in her belly.",
      "The mother obtains the five kinds of sensual stimulation and amuses herself, supplied and provided with them when the being intent on awakening is conceived in her belly.",
      "No afflictions beset the mother when the being intent on awakening is conceived in her belly.",
      "Seven days after the being intent on awakening is born, his mother passes away and is reborn in the host of Joyful Gods.",
      "The mother of the being intent on awakening gives birth after exactly ten months.",
      "The mother of the being intent on awakening only gives birth standing up.",
      "Gods receive the being intent on awakening first, then humans when he emerges from his mother’s womb.",
      "Four gods receive the being intent on awakening and place him before his mother, saying: ‘Rejoice, O Queen! An illustrious child is born to you.’",
      "The being intent on awakening emerges already clean, unsoiled by waters, mucus, blood, or any other kind of impurity, pure and clean.",
      "Two streams of water appear in the sky, one cool, one warm, for bathing the being intent on awakening and his mother when he emerges from his mother’s womb.",
      "As soon as he’s born, the being intent on awakening stands firm with his own feet on the ground. Facing north, he takes seven strides with a white parasol held above him, surveys all quarters, and makes a proclamation.",
      "An immeasurable, magnificent light appears in the world, surpassing the glory of the gods when the being intent on awakening emerges from his mother’s womb."
    ],
    "The thirty-two marks of a great man [dn14:1.31.0]": [
      "Well-planted feet",
      "Thousand-spoked wheels on the soles of his feet",
      "Projecting heels",
      "Long fingers",
      "Tender hands and feet",
      "Graceful clinging of hands and feet",
      "Arched feet",
      "Calves like those of an antelope",
      "Palms of both hands touch the knees when standing upright",
      "Private parts covered in a foreskin",
      "Gold-colored skin with a golden sheen",
      "Delicate skin that doesn't attract dust and dirt",
      "Hairs grow one per pore",
      "Blue-black hairs that curl clockwise and stand up",
      "Body as straight as Brahmā's",
      "Bulging muscles in seven places",
      "Chest like that of a lion",
      "Gap between the shoulder-blades filled in",
      "Proportional circumference of a banyan tree",
      "Cylindrical torso",
      "Excellent sense of taste",
      "Jaw like that of a lion",
      "Forty even teeth with no gaps and perfectly white",
      "Large tongue",
      "Voice of Brahmā, like a cuckoo's call",
      "Deep blue eyes",
      "Eyelashes like a cow's",
      "Tuft between the eyebrows, soft and white like cotton-wool",
      "Head shaped like a turban",
      "After conquering this land girt by sea, he reigns by principle, without rod or sword. "
    ],
    "The two possible destinies of a great man who possesses the thirty-two marks [dn14:1.31.0]": [
      "If he stays at home, he becomes a king, a wheel-turning monarch, possessing the seven treasures, and his dominion extends to all four sides.",
      "If he goes forth from the lay life to homelessness, he becomes a perfected one, a fully awakened Buddha, who draws back the veil from the world."
    ],
    "The nurses appointed for Prince Vipassī [dn14:1.33.8.0]": [
      "Some suckled him",
      "Some bathed him",
      "Some held him",
      "Some carried him on their hip"
    ],
    "The things that did not bother Prince Vipassī [dn14:1.33.8.0]": [
      "Cold",
      "Heat",
      "Grass",
      "Dust",
      "Damp"
    ],
    "The people who loved Prince Vipassī [dn14:1.33.8.0]": [
      "Many people"
    ],
    "The characteristics of Prince Vipassī's voice [dn14:1.33.8.0]": [
      "Charming",
      "Graceful",
      "Sweet",
      "Lovely"
    ],
    "The powers of Prince Vipassī [dn14:1.33.8.0]": [
      "Clairvoyance",
      "Ability to see for a league all around both by day and by night"
    ],
    "The things that Prince Vipassī was compared to [dn14:1.33.8.0]": [
      "Blue water lily",
      "Pink lotus",
      "White lotus"
    ],
    "The longhouses built for Prince Vipassī [dn14:1.33.8.0]": [
      "One for the winter",
      "One for the summer",
      "One for the rainy season"
    ],
    "The entertainers of Prince Vipassī [dn14:1.33.8.0]": [
      "Musicians",
      "None of them men"
    ],
    "The characteristics of the old man [dn14:2.1.0]": [
      "Elderly",
      "Bent double",
      "Crooked",
      "Leaning on a staff",
      "Trembling as he walked",
      "Ailing",
      "Past his prime"
    ],
    "The questions asked by Prince Vipassī [dn14:2.1.0]": [
      "What has that man done?",
      "Why is he called an old man?",
      "Am I liable to grow old?",
      "Am I not exempt from old age?"
    ],
    "The response of the charioteer to Prince Vipassī's questions [dn14:2.1.0]": [
      "Everyone is liable to grow old, including you.",
      "No one is exempt from old age."
    ],
    "The reaction of Prince Vipassī to the old man [dn14:2.1.0]": [
      "Brooded",
      "Miserable",
      "Sad"
    ],
    "The questions asked by King Bandhuma [dn14:2.1.0]": [
      "I hope the prince enjoyed himself at the park?",
      "I hope he was happy there?"
    ],
    "The things told by the charioteer to King Bandhuma [dn14:2.1.0]": [
      "What Prince Vipassī saw on the way to the park",
      "Prince Vipassī's reaction to seeing the old man"
    ],
    "The characteristics of the sick man [dn14:2.4.0]": [
      "Ill",
      "Suffering",
      "Gravely ill",
      "Collapsed in his own urine and feces",
      "Being picked up by some and put down by others"
    ],
    "The questions asked by Prince Vipassī [dn14:2.4.0]": [
      "What has that man done?",
      "Why is he called a sick man?",
      "Am I liable to fall sick?",
      "Am I not exempt from sickness?"
    ],
    "The response of the charioteer to Prince Vipassī's questions [dn14:2.4.0]": [
      "Everyone is liable to fall sick, including you.",
      "No one is exempt from sickness."
    ],
    "The reaction of Prince Vipassī to the sick man [dn14:2.4.0]": [
      "Brooded",
      "Miserable",
      "Sad"
    ],
    "The questions asked by King Bandhuma [dn14:2.4.0]": [
      "I hope the prince enjoyed himself at the park?",
      "I hope he was happy there?"
    ],
    "The things told by the charioteer to King Bandhuma [dn14:2.4.0]": [
      "What Prince Vipassī saw on the way to the park",
      "Prince Vipassī's reaction to seeing the sick man"
    ],
    "The characteristics of the dead man [dn14:2.8.0]": [
      "A large crowd gathered",
      "Making a bier out of garments of different colors",
      "Departed"
    ],
    "The questions asked by Prince Vipassī [dn14:2.8.0]": [
      "Why is that crowd making a bier?",
      "But why is he called departed?",
      "Am I liable to die?",
      "Am I not exempt from death?",
      "Will the king and queen and my other relatives and kin see me no more?",
      "And shall I never again see them?"
    ],
    "The response of the charioteer to Prince Vipassī's questions [dn14:2.8.0]": [
      "Everyone is liable to die, including you.",
      "No one is exempt from death.",
      "The king and queen and your other relatives and kin shall see you no more, and you shall never again see them."
    ],
    "The reaction of Prince Vipassī to the dead man [dn14:2.8.0]": [
      "Brooded",
      "Miserable",
      "Sad"
    ],
    "The questions asked by King Bandhuma [dn14:2.8.0]": [
      "I hope the prince enjoyed himself at the park?",
      "I hope he was happy there?"
    ],
    "The things told by the charioteer to King Bandhuma [dn14:2.8.0]": [
      "What Prince Vipassī saw on the way to the park",
      "Prince Vipassī's reaction to seeing the dead man"
    ],
    "The characteristics of the renunciate [dn14:2.12.0]": [
      "Shaven head",
      "Wearing an ocher robe",
      "Celebrates principled and fair conduct",
      "Skillful actions",
      "Good deeds",
      "Harmlessness",
      "Compassion for living creatures"
    ],
    "The questions asked by Prince Vipassī [dn14:2.12.0]": [
      "What has that man done?",
      "But why is he called a renunciate?",
      "What have you done?",
      "But why are you called a renunciate?"
    ],
    "The response of the charioteer to Prince Vipassī's questions [dn14:2.12.0]": [
      "That is called a renunciate.",
      "He is called a renunciate because he celebrates principled and fair conduct, skillful actions, good deeds, harmlessness, and compassion for living creatures."
    ],
    "The response of the renunciate to Prince Vipassī's questions [dn14:2.12.0]": [
      "I am what is called a renunciate.",
      "I am called a renunciate because I celebrate principled and fair conduct, skillful actions, good deeds, harmlessness, and compassion for living creatures."
    ],
    "The statement made by Prince Vipassī [dn14:2.12.0]": [
      "Then I celebrate the one called a renunciate, who celebrates principled and fair conduct, skillful actions, good deeds, harmlessness, and compassion for living creatures!"
    ],
    "The conditions for old age and death [dn14:2.18.0]": [
      "Rebirth",
      "Continued existence",
      "Grasping",
      "Craving",
      "Feeling",
      "Contact",
      "The six sense fields",
      "Name and form",
      "Consciousness"
    ],
    "The conditions for cessation of old age and death (a causal chain) [dn14:2.18.0]": [
      "Cessation of rebirth",
      "Cessation of continued existence",
      "Cessation of grasping",
      "Cessation of craving",
      "Cessation of feeling",
      "Cessation of contact",
      "Cessation of the six sense fields",
      "Cessation of name and form",
      "Cessation of consciousness"
    ],
    "The observations made by Vipassī during meditation (a causal chain) [dn14:2.18.0]": [
      "Form",
      "The origin of form",
      "The ending of form",
      "Feeling",
      "The origin of feeling",
      "The ending of feeling",
      "Perception",
      "The origin of perception",
      "The ending of perception",
      "Choices",
      "The origin of choices",
      "The ending of choices",
      "Consciousness",
      "The origin of consciousness",
      "The ending of consciousness"
    ],
    "Sentient beings with different qualities [dn14:3.1.0]": [
      "Sentient beings with little dust in their eyes",
      "Sentient beings with much dust in their eyes",
      "Sentient beings with keen faculties",
      "Sentient beings with weak faculties",
      "Sentient beings with good qualities",
      "Sentient beings with bad qualities",
      "Sentient beings easy to teach",
      "Sentient beings hard to teach"
    ],
    "Different types of water lilies and lotuses (a comparison) [dn14:3.1.0]": [
      "Blue water lilies",
      "Pink water lilies",
      "White water lilies",
      "Water lilies that sprout and grow in the water without rising above it",
      "Water lilies that sprout and grow in the water reaching the water’s surface",
      "Water lilies that sprout and grow in the water but rise up above the water and stand with no water clinging to them."
    ],
    "The Buddha Vipassī's teachings [dn14:3.8.0]": [
      "Step by step teaching on giving, ethical conduct, and heaven",
      "Explanation of the drawbacks of sensual pleasures and the benefit of renunciation",
      "Explanation of the special teaching of the Buddhas: suffering, its origin, its cessation, and the path"
    ],
    "The response of the king's son Khaṇḍa and the high priest's son Tissa (a causal sequence) [dn14:3.8.0]": [
      "Excellent, sir! Excellent!",
      "We go for refuge to the Blessed One and to the teaching.",
      "Sir, may we receive the going forth and ordination in the Buddha’s presence?"
    ],
    "The Buddha Vipassī's further teachings [dn14:3.8.0]": [
      "Explanation of the drawbacks of conditioned phenomena and the benefit of extinguishment",
      "Education, encouragement, firing up, and inspiration with a Dhamma talk"
    ],
    "The Buddha Vipassī's teachings [dn14:3.14.0]": [
      "Step by step teaching on giving, ethical conduct, and heaven",
      "Explanation of the drawbacks of sensual pleasures and the benefit of renunciation",
      "Explanation of the special teaching of the Buddhas: suffering, its origin, its cessation, and the path"
    ],
    "The response of the 84,000 people (a causal sequence) [dn14:3.14.0]": [
      "This must be no ordinary teaching and training, no ordinary going forth in which the king’s son Khaṇḍa and the high priest’s son Tissa have gone forth.",
      "Excellent, sir! Excellent!"
    ],
    "The ordination of the 84,000 people [dn14:3.14.0]": [
      "They asked for and received ordination."
    ],
    "The actions of the 84,000 people who had gone forth previously [dn14:3.18.0]": [
      "They went to see the Buddha Vipassī",
      "They realized the Dhamma",
      "They went forth",
      "They became freed from defilements."
    ],
    "The Buddha Vipassī's instructions to the mendicants [dn14:3.22.0]": [
      "Wander forth, mendicants, for the welfare and happiness of the people, out of compassion for the world, for the benefit, welfare, and happiness of gods and humans.",
      "Let not two go by one road.",
      "Teach the Dhamma that’s good in the beginning, good in the middle, and good in the end, meaningful and well-phrased.",
      "Reveal a spiritual practice that’s entirely full and pure.",
      "There are beings with little dust in their eyes. They’re in decline because they haven’t heard the teaching. There will be those who understand the teaching!",
      "When six years have passed, you must all come to Bandhumatī to recite the monastic code."
    ],
    "The years and the deities' cries [dn14:3.22.0]": [
      "The first year",
      "The second year",
      "The third year",
      "The fourth year",
      "The fifth year",
      "The sixth year"
    ],
    "The instruction of the Buddhas [dn14:3.22.0]": [
      "Not to do any evil",
      "To embrace the good",
      "To purify one’s mind",
      "Not speaking ill nor doing harm",
      "Restraint in the monastic code",
      "Moderation in eating",
      "Staying in remote lodgings",
      "Commitment to the higher mind"
    ],
    "Details of the Buddha Vipassī [dn14:3.29.0]": [
      "He was born as an aristocrat into an aristocrat family.",
      "Koṇḍañña was his clan.",
      "He lived for 80,000 years.",
      "He was awakened at the root of a trumpet flower tree.",
      "He had a fine pair of chief disciples named Khaṇḍa and Tissa.",
      "He had three gatherings of disciples—one of 6,800,000, one of 100,000, and one of 80,000—all of them mendicants who had ended their defilements.",
      "He had as chief attendant a mendicant named Asoka.",
      "His father was King Bandhuma, his birth mother was Queen Bandhumatī, and their capital city was named Bandhumatī.",
      "Such was his renunciation, such his going forth, such his striving, such his awakening, and such his rolling forth of the wheel of Dhamma."
    ],
    "Details of the Buddha Gotama [dn14:3.29.0]": [
      "He was born as an aristocrat into an aristocrat family.",
      "Gotama is your clan.",
      "For you the life-span is short, brief, and fleeting.",
      "A long-lived person lives for a century or a little more.",
      "You were awakened at the root of a peepul tree.",
      "You have a fine pair of chief disciples named Sāriputta and Moggallāna.",
      "You have had one gathering of disciples—1,250 mendicants who had ended their defilements.",
      "You have as chief attendant a mendicant named Ānanda.",
      "Your father was King Suddhodana, your birth mother was Queen Māyā, and your capital city was Kapilavatthu.",
      "Such was your renunciation, such your going forth, such your striving, such your awakening, and such your rolling forth of the wheel of Dhamma."
    ],
    "The gods visited by the Buddha [dn14:3.29.0]": [
      "Aviha gods",
      "Atappa gods",
      "Gods Fair to See",
      "Fair Seeing Gods",
      "Gods of Akaniṭṭha"
    ]
  }
}