{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn15": {
    "The cause, source, origin, and condition of name and form [dn15:0.3]": [
      "Consciousness"
    ],
    "The cause, source, origin, and condition of consciousness (a causal chain) [dn15:0.3]": [
      "Name and form"
    ],
    "How those who describe the self describe it [dn15:23.0]": [
      "Physical and limited",
      "Physical and infinite",
      "Formless and limited",
      "Formless and infinite"
    ],
    "The views of self that underlie those who describe the self (a list separated by commas) [dn15:23.0]": [
      "Physical and limited",
      "Physical and infinite",
      "Formless and limited",
      "Formless and infinite"
    ],
    "How those who don’t describe the self not describe it [dn15:25.0]": [
      "Physical and limited",
      "Physical and infinite",
      "Formless and limited",
      "Formless and infinite"
    ],
    "The views of self that don’t underlie those who don’t describe the self (a list separated by commas) [dn15:25.0]": [
      "Physical and limited",
      "Physical and infinite",
      "Formless and limited",
      "Formless and infinite"
    ],
    "How those who regard the self regard it [dn15:27.0]": [
      "Feeling is self",
      "Feeling is definitely not self, and self does not experience feeling",
      "Feeling is definitely not self, but self feels, for self is liable to feel"
    ],
    "The impermanence of pleasant, painful, and neutral feelings (a list separated by commas) [dn15:27.0]": [
      "Pleasant feelings",
      "Painful feelings",
      "Neutral feelings"
    ],
    "The unacceptable nature of regarding feeling as self (a list separated by commas) [dn15:27.0]": [
      "Feeling is evidently impermanent",
      "Feeling is a mixture of pleasure and pain",
      "Feeling is liable to rise and fall"
    ],
    "The unacceptable nature of regarding self as that which does not experience feeling [dn15:27.0]": [
      "Where there is nothing felt at all, would the thought “I am” occur there?"
    ],
    "The unacceptable nature of regarding self as that which is liable to feel [dn15:27.0]": [
      "Suppose feelings were to totally and utterly cease without anything left over. When there’s no feeling at all, with the cessation of feeling, would the thought “I am this” occur there?"
    ],
    "The views that a freed mendicant does not hold [dn15:27.0]": [
      "A Realized One exists after death",
      "A Realized One doesn’t exist after death",
      "A Realized One both exists and doesn’t exist after death",
      "A Realized One neither exists nor doesn’t exist after death",
      "There is no such thing as knowing and seeing"
    ],
    "The seven planes of consciousness [dn15:33.0]": [
      "Diverse in body and diverse in perception",
      "Diverse in body and unified in perception",
      "Unified in body and diverse in perception",
      "Unified in body and unified in perception",
      "Gone totally beyond perceptions of form",
      "Gone totally beyond the dimension of infinite space",
      "Gone totally beyond the dimension of infinite consciousness"
    ],
    "The two dimensions [dn15:33.0]": [
      "The dimension of non-percipient beings",
      "The dimension of neither perception nor non-perception"
    ],
    "The understanding of the seven planes of consciousness and two dimensions [dn15:33.0]": [
      "Their origin",
      "Their ending",
      "Their gratification",
      "Their drawback",
      "Their escape"
    ],
    "The qualities of a freed mendicant (a list separated by commas) [dn15:33.0]": [
      "Freed by not grasping",
      "Freed by wisdom"
    ],
    "The eight liberations [dn15:35.0]": [
      "Having physical form, they see visions",
      "Not perceiving form internally, they see visions externally",
      "They’re focused only on beauty",
      "Going totally beyond perceptions of form, with the ending of perceptions of impingement, not focusing on perceptions of diversity, aware that ‘space is infinite’, they enter and remain in the dimension of infinite space",
      "Going totally beyond the dimension of infinite space, aware that ‘consciousness is infinite’, they enter and remain in the dimension of infinite consciousness",
      "Going totally beyond the dimension of infinite consciousness, aware that ‘there is nothing at all’, they enter and remain in the dimension of nothingness",
      "Going totally beyond the dimension of nothingness, they enter and remain in the dimension of neither perception nor non-perception",
      "Going totally beyond the dimension of neither perception nor non-perception, they enter and remain in the cessation of perception and feeling"
    ],
    "The qualities of a freed mendicant [dn15:35.0]": [
      "Enters into and withdraws from these eight liberations",
      "In forward order, in reverse order, and in forward and reverse order",
      "Wherever they wish, whenever they wish, and for as long as they wish",
      "Realizes the undefiled freedom of heart and freedom by wisdom in this very life",
      "Lives having realized it with their own insight due to the ending of defilements"
    ]
  }
}