{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn16": {
    "The principles that prevent decline [dn16:1.4.0]": [
      "The Vajjis meet frequently and have many meetings",
      "The Vajjis meet in harmony, leave in harmony, and carry on their business in harmony",
      "The Vajjis don’t make new decrees or abolish existing decrees, but proceed having undertaken the traditional Vajjian principles as they have been decreed",
      "The Vajjis honor, respect, esteem, and venerate Vajjian elders, and think them worth listening to",
      "The Vajjis don’t rape or abduct women or girls from their families and force them to live with them",
      "The Vajjis honor, respect, esteem, and venerate the Vajjian shrines, whether inner or outer, not neglecting the proper spirit-offerings that were given and made in the past",
      "The Vajjis organize proper protection, shelter, and security for perfected ones, so that more perfected ones might come to the realm and those already here may live in comfort."
    ],
    "The seven principles that prevent decline among the mendicants [dn16:1.6.0]": [
      "As long as the mendicants meet frequently and have many meetings, they can expect growth, not decline.",
      "As long as the mendicants meet in harmony, leave in harmony, and carry on their business in harmony, they can expect growth, not decline.",
      "As long as the mendicants don’t make new decrees or abolish existing decrees, but undertake and follow the training rules as they have been decreed, they can expect growth, not decline.",
      "As long as the mendicants honor, respect, esteem, and venerate the senior mendicants—of long standing, long gone forth, fathers and leaders of the Saṅgha—and think them worth listening to, they can expect growth, not decline.",
      "As long as the mendicants don’t fall under the sway of arisen craving for future lives, they can expect growth, not decline.",
      "As long as the mendicants take care to live in wilderness lodgings, they can expect growth, not decline.",
      "As long as the mendicants individually establish mindfulness, so that more good-hearted spiritual companions might come, and those that have already come may live comfortably, they can expect growth, not decline."
    ],
    "The seven more principles that prevent decline among the mendicants [dn16:1.6.0]": [
      "As long as the mendicants don’t relish work, loving it and liking to relish it, they can expect growth, not decline.",
      "As long as they don’t enjoy talk … ",
      "sleep … ",
      "company … ",
      "they don’t have wicked desires, falling under the sway of wicked desires … ",
      "they don’t have bad friends, companions, and associates … ",
      "they don’t stop half-way after achieving some insignificant distinction, they can expect growth, not decline.",
      "As long as the mendicants are faithful … ",
      "conscientious … ",
      "prudent … ",
      "learned … ",
      "energetic … ",
      "mindful … ",
      "wise, they can expect growth, not decline.",
      "As long as the mendicants develop the awakening factors of mindfulness … ",
      "investigation of principles … ",
      "energy … ",
      "rapture … ",
      "tranquility … ",
      "immersion … ",
      "equanimity, they can expect growth, not decline.",
      "As long as the mendicants develop the perceptions of impermanence … ",
      "not-self … ",
      "ugliness … ",
      "drawbacks … ",
      "giving up … ",
      "fading away … ",
      "cessation, they can expect growth, not decline."
    ],
    "The six principles that prevent decline among the mendicants [dn16:1.6.0]": [
      "As long as the mendicants consistently treat their spiritual companions with bodily kindness … ",
      "verbal kindness … ",
      "and mental kindness both in public and in private, they can expect growth, not decline.",
      "As long as the mendicants share without reservation any material possessions they have gained by legitimate means, even the food placed in the alms-bowl, using them in common with their ethical spiritual companions, they can expect growth, not decline.",
      "As long as the mendicants live according to the precepts shared with their spiritual companions, both in public and in private—such precepts as are unbroken, impeccable, spotless, and unmarred, liberating, praised by sensible people, not mistaken, and leading to immersion—they can expect growth, not decline.",
      "As long as the mendicants live according to the view shared with their spiritual companions, both in public and in private—the view that is noble and emancipating, and leads one who practices it to the complete end of suffering—they can expect growth, not decline."
    ],
    "The qualities of perfected ones, fully awakened Buddhas [dn16:1.16.0]": [
      "such ethics",
      "such qualities",
      "such wisdom",
      "such meditation",
      "such freedom"
    ],
    "The qualities of the mind of perfected ones, fully awakened Buddhas [dn16:1.16.0]": [
      "give up the five hindrances",
      "corruptions of the heart that weaken wisdom",
      "mind is firmly established in the four kinds of mindfulness meditation",
      "correctly develop the seven awakening factors",
      "wake up to the supreme perfect awakening"
    ],
    "The qualities of ethics, immersion, and wisdom [dn16:1.16.0]": [
      "ethics",
      "immersion",
      "wisdom"
    ],
    "The causal relationship between immersion, ethics, and wisdom [dn16:1.16.0]": [
      "When immersion is imbued with ethics",
      "it’s very fruitful and beneficial",
      "When wisdom is imbued with immersion",
      "it’s very fruitful and beneficial",
      "When the mind is imbued with wisdom",
      "it is rightly freed from the defilements, namely, the defilements of sensuality, desire to be reborn, and ignorance."
    ],
    "The five drawbacks for an unethical person because of their failure in ethics [dn16:1.19.0]": [
      "an unethical person loses substantial wealth on account of negligence",
      "an unethical person gets a bad reputation",
      "an unethical person enters any kind of assembly timid and embarrassed",
      "an unethical person feels lost when they die",
      "an unethical person, when their body breaks up, after death, is reborn in a place of loss, a bad place, the underworld, hell."
    ],
    "The five benefits for an ethical person because of their accomplishment in ethics [dn16:1.24.0]": [
      "an ethical person gains substantial wealth on account of diligence",
      "an ethical person gets a good reputation",
      "an ethical person enters any kind of assembly bold and self-assured",
      "an ethical person dies not feeling lost",
      "when an ethical person’s body breaks up, after death, they’re reborn in a good place, a heavenly realm."
    ],
    "The rulers or royal ministers inclined to build houses at sites possessed by deities [dn16:1.26.0]": [
      "Illustrious rulers or royal ministers inclined to build houses at sites possessed by illustrious deities",
      "Middling rulers or royal ministers inclined to build houses at sites possessed by middling deities",
      "Lesser rulers or royal ministers inclined to build houses at sites possessed by lesser deities"
    ],
    "The three threats that Pāṭaliputta will face (a repetitive sentence structure) [dn16:1.26.0]": [
      "Fire",
      "Flood",
      "Dissension"
    ],
    "The people seeking to cross the Ganges River [dn16:1.26.0]": [
      "Some people were seeking a boat",
      "Some a dinghy",
      "Some were tying up a raft"
    ],
    "The four noble truths [dn16:2.1.0]": [
      "The noble truth of suffering",
      "The origin of suffering",
      "The cessation of suffering",
      "The practice that leads to the cessation of suffering"
    ],
    "The three aspects of the path [dn16:2.1.0]": [
      "Ethics",
      "Immersion",
      "Wisdom"
    ],
    "The rebirth status of individuals who have passed away in Nādika [dn16:2.5.0]": [
      "The monk Sāḷha had realized the undefiled freedom of heart and freedom by wisdom in this very life",
      "The nun Nandā had ended the five lower fetters. She’s been reborn spontaneously, and will be extinguished there, not liable to return from that world.",
      "The layman Sudatta had ended three fetters, and weakened greed, hate, and delusion. He’s a once-returner; he will come back to this world once only, then make an end of suffering.",
      "The laywoman Sujātā had ended three fetters. She’s a stream-enterer, not liable to be reborn in the underworld, bound for awakening.",
      "The laymen Kakkaṭa, Kaḷibha, Nikata, Kaṭissaha, Tuṭṭha, Santuṭṭha, Bhadda, and Subhadda had ended the five lower fetters. They’ve been reborn spontaneously, and will be extinguished there, not liable to return from that world.",
      "Over fifty laymen in Nādika have passed away having ended the five lower fetters. They’ve been reborn spontaneously, and will be extinguished there, not liable to return from that world.",
      "More than ninety laymen in Nādika have passed away having ended three fetters, and weakened greed, hate, and delusion. They’re once-returners, who will come back to this world once only, then make an end of suffering.",
      "In excess of five hundred laymen in Nādika have passed away having ended three fetters. They’re stream-enterers, not liable to be reborn in the underworld, bound for awakening."
    ],
    "The mirror of the teaching [dn16:2.8.0]": [
      "Experiential confidence in the Buddha",
      "Experiential confidence in the teaching",
      "Experiential confidence in the Saṅgha",
      "Ethical conduct loved by the noble ones"
    ],
    "The three qualities [dn16:2.8.0]": [
      "Ethics",
      "Immersion",
      "Wisdom"
    ],
    "How a mendicant is mindful and aware (a repetitive sentence structure) [dn16:2.8.0]": [
      "Meditates by observing an aspect of the body",
      "Meditates observing an aspect of feelings",
      "Meditates observing an aspect of mind",
      "Meditates observing an aspect of principles",
      "Acts with situational awareness when going out and coming back, looking ahead and aside, bending and extending the limbs, bearing the outer robe, bowl and robes, eating, drinking, chewing, and tasting, urinating and defecating, walking, standing, sitting, sleeping, waking, speaking, and keeping silent."
    ],
    "The Licchavis' attire [dn16:2.14.0]": [
      "Some of the Licchavis were in blue, of blue color, clad in blue, adorned with blue.",
      "Some were similarly colored in yellow, red, or white."
    ],
    "The Buddha's teachings [dn16:2.14.0]": [
      "Such is ethics",
      "Such is immersion",
      "Such is wisdom"
    ],
    "The defilements that the mind is rightly freed from [dn16:2.14.0]": [
      "The defilements of sensuality",
      "Desire to be reborn",
      "Ignorance"
    ],
    "The Buddha's instructions to the mendicants [dn16:2.21.0]": [
      "Please enter the rainy season residence with whatever friends or acquaintances you have around Vesālī.",
      "I’ll commence the rainy season residence right here in the little village of Beluva.",
      "Be your own island, your own refuge, with no other refuge.",
      "Let the teaching be your island and your refuge, with no other refuge.",
      "That’s how a mendicant is their own island, their own refuge, with no other refuge.",
      "That’s how the teaching is their island and their refuge, with no other refuge."
    ],
    "The Buddha's description of his illness [dn16:2.21.0]": [
      "The Buddha fell severely ill, struck by dreadful pains, close to death.",
      "He endured unperturbed, with mindfulness and situational awareness.",
      "It occurred to the Buddha that it would not be appropriate for him to become fully extinguished before informing his attendants and taking leave of the mendicant Saṅgha.",
      "He forcefully suppressed this illness, stabilized the life force, and lived on.",
      "The Buddha's illness died down."
    ],
    "The Buddha's description of his age and physical condition (a causal sequence) [dn16:2.21.0]": [
      "The Buddha is now old, elderly and senior.",
      "He is advanced in years and has reached the final stage of life.",
      "The Realized One’s body keeps going by relying on straps, or so you’d think.",
      "Sometimes the Realized One, not focusing on any signs, and with the cessation of certain feelings, enters and remains in the signless immersion of the heart.",
      "Only then does the Realized One’s body become more comfortable."
    ],
    "The lovely shrines [dn16:3.1.0]": [
      "Vesālī",
      "Udena",
      "Gotamaka",
      "Sattamba",
      "Bahuputta",
      "Sārandada",
      "Cāpāla"
    ],
    "The four bases of psychic power [dn16:3.1.0]": [
      "Developing and cultivating the four bases of psychic power",
      "Making them a vehicle and a basis",
      "Keeping them up",
      "Consolidating them",
      "Properly implementing them"
    ],
    "The statements made by the Buddha [dn16:3.7.0]": [
      "\"Wicked One, I will not become fully extinguished until I have monk disciples who are competent, educated, assured, learned, have memorized the teachings, and practice in line with the teachings. Not until they practice properly, living in line with the teaching. Not until they’ve learned their tradition, and explain, teach, assert, establish, disclose, analyze, and make it clear. Not until they can legitimately and completely refute the doctrines of others that come up, and teach with a demonstrable basis.\"",
      "\"Wicked One, I will not become fully extinguished until I have nun disciples who are competent, educated, assured, learned …\"",
      "\"Wicked One, I will not become fully extinguished until I have layman disciples who are competent, educated, assured, learned …\"",
      "\"Wicked One, I will not become fully extinguished until I have laywoman disciples who are competent, educated, assured, learned …\"",
      "\"Wicked One, I will not become fully extinguished until my spiritual path is successful and prosperous, extensive, popular, widespread, and well proclaimed wherever there are gods and humans.\""
    ],
    "The disciples of the Buddha [dn16:3.7.0]": [
      "Monk disciples who are competent, educated, assured, learned, have memorized the teachings, and practice in line with the teachings",
      "Nun disciples who are competent, educated, assured, learned",
      "Layman disciples who are competent, educated, assured, learned",
      "Laywoman disciples who are competent, educated, assured, learned"
    ],
    "The eight causes and reasons for a great earthquake [dn16:3.11.0]": [
      "The great earth is grounded on water, the water is grounded on air, and the air stands in space.",
      "An ascetic or brahmin with psychic power who has achieved mastery of the mind, or a god who is mighty and powerful.",
      "When the being intent on awakening passes away from the host of Joyful Gods, he’s conceived in his mother’s belly, mindful and aware.",
      "When the being intent on awakening comes out of his mother’s belly mindful and aware.",
      "When the Realized One realizes the supreme perfect awakening.",
      "When the Realized One rolls forth the supreme Wheel of Dhamma.",
      "When the Realized One, mindful and aware, surrenders the life force.",
      "When the Realized One becomes fully extinguished through the natural principle of extinguishment, without anything left over."
    ],
    "The eight assemblies [dn16:3.21.0]": [
      "The assembly of aristocrats",
      "The assembly of brahmins",
      "The assembly of householders",
      "The assembly of ascetics",
      "The assembly of the gods of the Four Great Kings",
      "The assembly of the gods of the Thirty-Three",
      "The assembly of Māras",
      "The assembly of Brahmās"
    ],
    "The eight dimensions of mastery [dn16:3.24.0]": [
      "Perceiving form internally, someone sees visions externally, limited, both pretty and ugly",
      "Perceiving form internally, someone sees visions externally, limitless, both pretty and ugly",
      "Not perceiving form internally, someone sees visions externally, limited, both pretty and ugly",
      "Not perceiving form internally, someone sees visions externally, limitless, both pretty and ugly",
      "Not perceiving form internally, someone sees visions externally that are blue, with blue color, blue hue, and blue tint",
      "Not perceiving form internally, someone sees visions externally that are yellow, with yellow color, yellow hue, and yellow tint",
      "Not perceiving form internally, someone sees visions externally that are red, with red color, red hue, and red tint",
      "Not perceiving form internally, someone sees visions externally that are white, with white color, white hue, and white tint"
    ],
    "The eight liberations [dn16:3.33.0]": [
      "Having physical form, they see visions",
      "Not perceiving form internally, they see visions externally",
      "They’re focused only on beauty",
      "Going totally beyond perceptions of form, with the ending of perceptions of impingement, not focusing on perceptions of diversity, aware that ‘space is infinite’, they enter and remain in the dimension of infinite space",
      "Going totally beyond the dimension of infinite space, aware that ‘consciousness is infinite’, they enter and remain in the dimension of infinite consciousness",
      "Going totally beyond the dimension of infinite consciousness, aware that ‘there is nothing at all’, they enter and remain in the dimension of nothingness",
      "Going totally beyond the dimension of nothingness, they enter and remain in the dimension of neither perception nor non-perception",
      "Going totally beyond the dimension of neither perception nor non-perception, they enter and remain in the cessation of perception and feeling"
    ],
    "The conditions for the final extinguishment of the Realized One [dn16:3.33.0]": [
      "Monk disciples",
      "Nun disciples",
      "Layman disciples",
      "Laywoman disciples who are competent, educated, assured, learned",
      "Successful and prosperous spiritual path",
      "Extensive, popular, widespread, and well-proclaimed spiritual path wherever there are gods and humans"
    ],
    "Places where the Buddha stayed and dropped a hint to Ānanda [dn16:3.38.0]": [
      "Rājagaha, on the Vulture’s Peak Mountain",
      "Gotama banyan tree",
      "Bandit’s Cliff",
      "Sattapaṇṇi cave on the slopes of Vebhara",
      "Black rock on the slopes of Isigili",
      "Cool Grove, under the Snake’s Hood Grotto",
      "Hot Springs Monastery",
      "Bamboo Grove, the squirrels’ feeding ground",
      "Jīvaka’s mango grove",
      "Maddakucchi deer park",
      "Udena shrine",
      "Gotamaka shrine",
      "Sattamba shrine",
      "Many Sons shrine",
      "Sārandada shrine",
      "Cāpāla shrine"
    ],
    "Teachings from the Buddha's direct knowledge [dn16:3.38.0]": [
      "The four kinds of mindfulness meditation",
      "The four right efforts",
      "The four bases of psychic power",
      "The five faculties",
      "The five powers",
      "The seven awakening factors",
      "The noble eightfold path"
    ],
    "The Buddha's final message to the mendicants [dn16:3.38.0]": [
      "Conditions fall apart",
      "Persist with diligence",
      "The final extinguishment of the Realized One will be soon",
      "Three months from now the Realized One will finally be extinguished",
      "Diligent and mindful, be of good virtues, mendicants!",
      "With well-settled thoughts, take good care of your minds",
      "Whoever meditates diligently in this teaching and training, giving up transmigration through rebirths, will make an end to suffering."
    ],
    "Four things not understood and penetrated [dn16:4.1.0]": [
      "Noble ethics",
      "Immersion",
      "Wisdom",
      "Freedom"
    ],
    "Things that have been understood and comprehended [dn16:4.1.0]": [
      "Noble ethics",
      "Immersion",
      "Wisdom",
      "Freedom"
    ],
    "The defilements [dn16:4.1.0]": [
      "The defilements of sensuality",
      "Desire to be reborn",
      "Ignorance"
    ],
    "The Four Great References [dn16:4.5.0]": [
      "The first great reference - a mendicant who says: ‘Reverend, I have heard and learned this in the presence of the Buddha: this is the teaching, this is the monastic law, this is the Teacher’s instruction.’",
      "The second great reference - another mendicant who says: ‘In such-and-such monastery lives a Saṅgha with seniors and leaders. I’ve heard and learned this in the presence of that Saṅgha: this is the teaching, this is the monastic law, this is the Teacher’s instruction.’",
      "The third great reference - another mendicant who says: ‘In such-and-such monastery there are several senior mendicants who are very learned, knowledgeable in the scriptures, who have memorized the teachings, the monastic law, and the outlines. I’ve heard and learned this in the presence of those senior mendicants: this is the teaching, this is the monastic law, this is the Teacher’s instruction.’",
      "The fourth great reference - another mendicant who says: ‘In such-and-such monastery there is a single senior mendicant who is very learned and knowledgeable in the scriptures, who has memorized the teachings, the monastic law, and the outlines. I’ve heard and learned this in the presence of that senior mendicant: this is the teaching, this is the monastic law, this is the Teacher’s instruction.’"
    ],
    "The qualities of ethics, immersion, and wisdom [dn16:4.5.0]": [
      "Ethics",
      "Immersion",
      "Wisdom"
    ],
    "The benefits of imbuing immersion with ethics, wisdom with immersion, and mind with wisdom [dn16:4.5.0]": [
      "When immersion is imbued with ethics it’s very fruitful and beneficial.",
      "When wisdom is imbued with immersion it’s very fruitful and beneficial.",
      "When the mind is imbued with wisdom it is rightly freed from the defilements, namely, the defilements of sensuality, desire to be reborn, and ignorance."
    ],
    "The two times when the color of the Realized One’s skin becomes extra pure and bright [dn16:4.26.0]": [
      "The night when a Realized One understands the supreme perfect awakening",
      "The night he becomes fully extinguished through the natural principle of extinguishment, without anything left over"
    ],
    "The two almsmeal offerings that have identical fruit and result, and are more fruitful and beneficial than other almsmeal offerings [dn16:4.26.0]": [
      "The almsmeal after eating which a Realized One understands the supreme perfect awakening",
      "The almsmeal after eating which he becomes fully extinguished through the natural principle of extinguishment, without anything left over"
    ],
    "Items that sprinkled and bestrewed the Realized One’s body in honor of the Realized One [dn16:5.1.0]": [
      "Flowers out of season from the twin sal trees",
      "Flowers of the heavenly Flame Tree fell from the sky",
      "Heavenly sandalwood powder fell from the sky"
    ],
    "Heavenly activities that happened in honor of the Realized One [dn16:5.1.0]": [
      "Heavenly music played in the sky",
      "Heavenly choirs sang in the sky"
    ],
    "The four inspiring places [dn16:5.7.0]": [
      "Here the Realized One was born",
      "Here the Realized One became awakened as a supreme fully awakened Buddha",
      "Here the supreme Wheel of Dhamma was rolled forth by the Realized One",
      "Here the Realized One became fully extinguished through the natural principle of extinguishment, without anything left over"
    ],
    "Persons Worthy of Monument [dn16:5.12.0]": [
      "A Realized One, a perfected one, a fully awakened Buddha",
      "A Buddha awakened for themselves",
      "A disciple of a Realized One",
      "A wheel-turning monarch"
    ],
    "Reasons for each person being worthy of a monument [dn16:5.12.0]": [
      "So that many people will inspire confidence in their hearts, thinking: ‘This is the monument for that Blessed One, perfected and fully awakened!’ And having done so, when their body breaks up, after death, they are reborn in a good place, a heavenly realm. It is for this reason that a Realized One is worthy of a monument.",
      "So that many people will inspire confidence in their hearts, thinking: ‘This is the monument for that Buddha awakened for himself!’ And having done so, when their body breaks up, after death, they are reborn in a good place, a heavenly realm. It is for this reason that a Buddha awakened for himself is worthy of a monument.",
      "So that many people will inspire confidence in their hearts, thinking: ‘This is the monument for that Blessed One’s disciple!’ And having done so, when their body breaks up, after death, they are reborn in a good place, a heavenly realm. It is for this reason that a Realized One’s disciple is worthy of a monument.",
      "So that many people will inspire confidence in their hearts, thinking: ‘This is the monument for that just and principled king!’ And having done so, when their body breaks up, after death, they are reborn in a good place, a heavenly realm. It is for this reason that a wheel-turning monarch is worthy of a monument."
    ],
    "Incredible and amazing things about Ānanda [dn16:5.13.0]": [
      "If an assembly of monks goes to see Ānanda, they’re uplifted by seeing him and uplifted by hearing him speak. And when he falls silent, they’ve never had enough.",
      "If an assembly of nuns goes to see Ānanda, they’re uplifted by seeing him and uplifted by hearing him speak. And when he falls silent, they’ve never had enough.",
      "If an assembly of laymen goes to see Ānanda, they’re uplifted by seeing him and uplifted by hearing him speak. And when he falls silent, they’ve never had enough.",
      "If an assembly of laywomen goes to see Ānanda, they’re uplifted by seeing him and uplifted by hearing him speak. And when he falls silent, they’ve never had enough."
    ],
    "Incredible and amazing things about a wheel-turning monarch [dn16:5.13.0]": [
      "If an assembly of aristocrats goes to see a wheel-turning monarch, they’re uplifted by seeing him and uplifted by hearing him speak. And when he falls silent, they’ve never had enough.",
      "If an assembly of brahmins goes to see a wheel-turning monarch, they’re uplifted by seeing him and uplifted by hearing him speak. And when he falls silent, they’ve never had enough.",
      "If an assembly of householders goes to see a wheel-turning monarch, they’re uplifted by seeing him and uplifted by hearing him speak. And when he falls silent, they’ve never had enough.",
      "If an assembly of ascetics goes to see a wheel-turning monarch, they’re uplifted by seeing him and uplifted by hearing him speak. And when he falls silent, they’ve never had enough."
    ],
    "The ten sounds of Kusāvatī [dn16:5.17.0]": [
      "The sound of elephants",
      "The sound of horses",
      "The sound of chariots",
      "The sound of drums",
      "The sound of clay drums",
      "The sound of arched harps",
      "The sound of singing",
      "The sound of horns",
      "The sound of gongs",
      "The sound of handbells"
    ],
    "The message to be delivered to the Mallas [dn16:5.17.0]": [
      "Go into Kusinārā",
      "Inform the Mallas",
      "The Realized One will become fully extinguished in the last watch of the night",
      "Come forth, Vāseṭṭhas!",
      "Don’t regret it later, thinking: ‘The Realized One became fully extinguished in our own village district, but we didn’t get a chance to see him in his final hour.’”"
    ],
    "The Mallas, their sons, daughters-in-law, and wives [dn16:5.20.0]": [
      "Became distraught",
      "Became saddened",
      "Became grief-stricken"
    ],
    "The lamentations of the Mallas [dn16:5.20.0]": [
      "“Too soon the Blessed One will become fully extinguished!",
      "“Too soon the Holy One will become fully extinguished!",
      "“Too soon the seer will vanish from the world!”"
    ],
    "The Mallas paying homage to the Buddha [dn16:5.20.0]": [
      "The Mallas went to the Mallian sal grove at Upavattana and approached Ānanda",
      "Ānanda separated them family by family",
      "The Mallas paid homage to the Buddha one by one",
      "Ānanda got the Mallas to finish paying homage to the Buddha in the first watch of the night."
    ],
    "Ascetics and brahmins who lead an order and a community, and teach a community [dn16:5.23.0]": [
      "Pūraṇa Kassapa",
      "Makkhali Gosāla",
      "Nigaṇṭha Nāṭaputta",
      "Sañjaya Belaṭṭhiputta",
      "Pakudha Kaccāyana",
      "Ajita Kesakambala"
    ],
    "The noble eightfold path [dn16:5.23.0]": [
      "In whatever teaching and training the noble eightfold path is not found, there is no true ascetic found, no second ascetic, no third ascetic, and no fourth ascetic.",
      "In whatever teaching and training the noble eightfold path is found, there is a true ascetic found, a second ascetic, a third ascetic, and a fourth ascetic.",
      "In this teaching and training the noble eightfold path is found. Only here is there a true ascetic, here a second ascetic, here a third ascetic, and here a fourth ascetic."
    ],
    "The going forth, the ordination into monkhood (a causal chain) [dn16:5.23.0]": [
      "If someone formerly ordained in another sect wishes to take the going forth, the ordination in this teaching and training, they must spend four months on probation.",
      "When four months have passed, if the mendicants are satisfied, they’ll give the going forth, the ordination into monkhood.",
      "However, I have recognized individual differences in this matter.",
      "Sir, if four months probation are required in such a case, I’ll spend four years on probation. When four years have passed, if the mendicants are satisfied, let them give me the going forth, the ordination into monkhood."
    ],
    "The teaching and training that I have taught and pointed out for you shall be your Teacher after my passing [dn16:6.1.0]": [
      "The teaching and training that I have taught and pointed out for you shall be your Teacher after my passing"
    ],
    "How mendicants ought to address each other after the Buddha's passing (a causal sequence) [dn16:6.1.0]": [
      "A more senior mendicant ought to address a more junior mendicant by name or clan, or by saying ‘reverend’",
      "A more junior mendicant ought to address a more senior mendicant using ‘sir’ or ‘venerable’"
    ],
    "The prime punishment for the mendicant Channa [dn16:6.1.0]": [
      "Channa may say what he likes, but the mendicants should not advise or instruct him"
    ],
    "The Buddha's call to mendicants to ask questions [dn16:6.1.0]": [
      "Perhaps even a single mendicant has doubt or uncertainty regarding the Buddha, the teaching, the Saṅgha, the path, or the practice",
      "So ask, mendicants! Don’t regret it later, thinking: ‘We were in the Teacher’s presence and we weren’t able to ask the Buddha a question.’"
    ],
    "The Buddha's statement about the mendicants' doubt or uncertainty (a causal sequence) [dn16:6.1.0]": [
      "Ānanda, you speak from faith",
      "But the Realized One knows that there’s not even a single mendicant in this Saṅgha who has doubt or uncertainty regarding the Buddha, the teaching, the Saṅgha, the path, or the practice",
      "Even the last of these five hundred mendicants is a stream-enterer, not liable to be reborn in the underworld, bound for awakening"
    ],
    "The Buddha's last words (a causal sequence) [dn16:6.1.0]": [
      "Conditions fall apart",
      "Persist with diligence"
    ],
    "The Buddha's successive entries into different states of absorption [dn16:6.8.0]": [
      "The first absorption",
      "The second absorption",
      "The third absorption",
      "The fourth absorption",
      "The dimension of infinite space",
      "The dimension of infinite consciousness",
      "The dimension of nothingness",
      "The dimension of neither perception nor non-perception",
      "The cessation of perception and feeling",
      "The dimension of neither perception nor non-perception",
      "The dimension of nothingness",
      "The dimension of infinite consciousness",
      "The dimension of infinite space",
      "The fourth absorption",
      "The third absorption",
      "The second absorption",
      "The first absorption"
    ],
    "Verses recited by different individuals after the Buddha's full extinguishment [dn16:6.8.0]": [
      "Brahmā Sahampati's verse",
      "Sakka's verse",
      "Venerable Anuruddha's verse",
      "Venerable Ānanda's verse"
    ],
    "The reactions of different individuals after the Buddha's full extinguishment [dn16:6.8.0]": [
      "Some of the mendicants there lamented",
      "The mendicants who were free of desire endured, mindful and aware",
      "The deities were complaining",
      "The Mallas, their sons, daughters-in-law, and wives became distraught, saddened, and grief-stricken."
    ],
    "The items collected by the Mallas [dn16:6.13.0]": [
      "Fragrances",
      "Garlands",
      "All the musical instruments in Kusinārā",
      "Five hundred pairs of garments"
    ],
    "The actions performed by the Mallas [dn16:6.13.0]": [
      "Honoring",
      "Respecting",
      "Revering",
      "Venerating",
      "Dancing",
      "Singing",
      "Playing music",
      "Offering garlands",
      "Offering fragrances",
      "Making awnings",
      "Setting up pavilions"
    ],
    "The plan of the Mallas and the deities [dn16:6.13.0]": [
      "Carry the Buddha’s corpse to the north of the town",
      "Venerate it with heavenly and human dance and song and music and garlands and fragrances",
      "Enter the town by the northern gate",
      "Carry it through the center of the town",
      "Leave by the eastern gate",
      "Deposit the corpse at the Mallian shrine named Makuṭabandhana"
    ],
    "The process of wrapping and cremating the Buddha’s corpse (a causal sequence) [dn16:6.13.0]": [
      "Wrap the Buddha’s corpse with unworn cloth",
      "Wrap it with uncarded cotton",
      "Wrap it again with unworn cloth",
      "Wrap the corpse with five hundred double-layers",
      "Place it in an iron case filled with oil",
      "Build a funeral pyre out of all kinds of fragrant substances",
      "Lift the corpse on to the pyre",
      "Cremate the corpse",
      "Build a monument for the Realized One at the crossroads"
    ],
    "The actions of the leading Mallas [dn16:6.19.0]": [
      "Bathed their heads",
      "Dressed in unworn clothes",
      "Tried to light the Buddha's funeral pyre"
    ],
    "The reason why the Mallas were unable to light the pyre [dn16:6.19.0]": [
      "The deities have a different plan",
      "The deities' plan is that Venerable Mahākassapa must bow with his head at the Buddha's feet before the pyre burns"
    ],
    "The actions of Venerable Mahākassapa and the five hundred mendicants (a causal chain) [dn16:6.19.0]": [
      "Respectfully circled the Buddha three times, keeping him on his right",
      "Bowed with their heads to the Buddha's feet"
    ],
    "The aftermath of the Buddha's cremation [dn16:6.19.0]": [
      "No ash or soot was found from the Buddha's corpse",
      "Only the relics remained",
      "Of the five hundred pairs of garments, only two were not burnt",
      "The funeral pyre was extinguished by a stream of water that appeared in the sky, by water dripping from the sal trees, and by the Mallas' fragrant water"
    ],
    "The actions of the Mallas after the Buddha's relics were placed in a cage of spears [dn16:6.19.0]": [
      "Honored, respected, revered, and venerated the relics for seven days",
      "Used dance, song, music, garlands, and fragrances to pay homage to the relics."
    ],
    "The groups who heard about the Buddha's passing and sent envoys to request a share of his relics [dn16:6.24.0]": [
      "King Ajātasattu of Magadha",
      "The Licchavis of Vesālī",
      "The Sakyans of Kapilavatthu",
      "The Bulas of Allakappa",
      "The Koḷiyans of Rāmagāma",
      "The brahmin of Veṭhadīpa",
      "The Mallas of Pāvā",
      "The Moras of Pippalivana"
    ],
    "The response of the Mallas of Kusinārā to the groups who requested a share of the Buddha's relics [dn16:6.24.0]": [
      "The Buddha became fully extinguished in our village district. We will not give away a share of his relics."
    ],
    "The proposal of Doṇa the brahmin to divide the Buddha's relics in eight portions [dn16:6.24.0]": [
      "Doṇa the brahmin proposed to divide the Buddha's relics in eight portions",
      "The various groups agreed to the proposal",
      "Doṇa divided the relics as asked",
      "The groups gave Doṇa the urn to build a monument for it and conduct a memorial service."
    ],
    "The groups who built monuments for the Buddha's relics and conducted memorial services [dn16:6.27.0]": [
      "King Ajātasattu of Magadha",
      "The Licchavis of Vesālī",
      "The Sakyans of Kapilavatthu",
      "The Bulas of Allakappa",
      "The Koḷiyans of Rāmagāma",
      "The brahmin of Veṭhadīpa",
      "The Mallas of Pāvā",
      "The Mallas of Kusinārā",
      "The brahmin Doṇa",
      "The Moriyas of Pippalivana"
    ],
    "The number and location of the monuments for the Buddha's relics [dn16:6.27.0]": [
      "Eight monuments for the relics",
      "A ninth monument for the urn",
      "A tenth monument for the embers"
    ],
    "The places where the Buddha's teeth are venerated [dn16:6.27.0]": [
      "One tooth is venerated by the gods of the Three and Thirty",
      "One tooth is worshipped in the city of Gandhāra",
      "Another tooth is worshipped in the realm of the Kaliṅga King",
      "One tooth is worshipped by a dragon king"
    ],
    "The beings who venerate the Buddha's corpse [dn16:6.27.0]": [
      "Lords of gods",
      "Dragons",
      "Spirits",
      "The finest lords of men"
    ],
    "The items carried off individually by gods across the universe [dn16:6.27.0]": [
      "Forty even teeth",
      "Body hair",
      "Head hair"
    ]
  }
}