{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn18": {
    "The rebirths of devotees from different nations [dn18:0.3]": [
      "Kāsis and Kosalans",
      "Vajjis and Mallas",
      "Cetīs and Vaṁsas",
      "Kurus and Pañcālas",
      "Macchas and Sūrasenas"
    ],
    "The devotees who have passed away in Nādika [dn18:0.3]": [
      "Over fifty devotees who have ended the five lower fetters",
      "More than ninety devotees who have ended three fetters and weakened greed, hate, and delusion",
      "In excess of five hundred devotees who have ended three fetters and are stream-enterers, not liable to be reborn in the underworld, bound for awakening."
    ],
    "The fate of the Magadhan devotees [dn18:4.0]": [
      "King Seniya Bimbisāra of Magadha",
      "Many Magadhan devotees who have passed away",
      "The Buddha's failure to declare their passing"
    ],
    "The Buddha's actions [dn18:4.0]": [
      "The Buddha pondered the fate of the Magadhan devotees alone in private",
      "Ānanda suggested that the Buddha declare the rebirth of the Magadhan devotees",
      "The Buddha robed up in the morning and went to Nādika for alms",
      "The Buddha paid attention and concentrated wholeheartedly on the fate of Magadhan devotees",
      "The Buddha saw where the Magadhan devotees had been reborn",
      "The Buddha recounted what had happened since speaking to Ānanda and revealed that he had seen the destiny of the Magadhan devotees."
    ],
    "Janavasabha's past lives [dn18:9.4.0]": [
      "Seven lives in the company of the Great King Vessavaṇa",
      "Seven lives elsewhere",
      "Fourteen transmigrations in all"
    ],
    "Janavasabha's knowledge and hope [dn18:9.4.0]": [
      "He won't be reborn in the underworld",
      "He hopes to become a once-returner"
    ],
    "Janavasabha's reasons for coming to see the Buddha [dn18:9.4.0]": [
      "To inform the Buddha of the fate of the Magadhan devotees",
      "To see the Buddha"
    ],
    "The seating arrangement of the gods of the Thirty-Three [dn18:12.0]": [
      "The Four Great Kings seated at the four directions",
      "The Great King Dhataraṭṭha seated to the east",
      "The Great King Virūḷhaka seated to the south",
      "The Great King Virūpakkha seated to the west",
      "The Great King Vessavaṇa seated to the north"
    ],
    "The characteristics of the new gods who had led the spiritual life under the Buddha [dn18:12.0]": [
      "Beauty",
      "Glory",
      "Lifespan"
    ],
    "The signs of Brahmā's appearance [dn18:12.0]": [
      "A light arising",
      "Radiance appearing",
      "A vast and great light"
    ],
    "The gods who have been reborn in different realms after fulfilling their ethics [dn18:16.0]": [
      "Gods Who Control the Creations of Others",
      "Gods Who Love to Create",
      "Joyful Gods",
      "Gods of Yama",
      "Gods of the Thirty-Three",
      "Gods of the Four Great Kings"
    ],
    "The eight qualities of Brahmā Sanaṅkumāra's voice [dn18:16.0]": [
      "Clear",
      "Comprehensible",
      "Charming",
      "Audible",
      "Rounded",
      "Undistorted",
      "Deep",
      "Resonant"
    ],
    "The four bases of psychic power [dn18:22.2.0]": [
      "The basis of psychic power that has immersion due to enthusiasm and active effort",
      "The basis of psychic power that has immersion due to energy and active effort",
      "The basis of psychic power that has immersion due to mental development and active effort",
      "The basis of psychic power that has immersion due to inquiry and active effort"
    ],
    "The three opportunities for achieving happiness [dn18:23.3.0]": [
      "The opportunity for achieving happiness by living aloof from sensual pleasures and unskillful qualities",
      "The opportunity for achieving happiness by calming down coarse physical, verbal, and mental processes",
      "The opportunity for achieving happiness by truly understanding what is skillful and what is unskillful, and so on."
    ],
    "The four kinds of mindfulness meditation for achieving what is skillful [dn18:26.3.0]": [
      "Meditating by observing an aspect of the body internally",
      "Meditating by observing an aspect of feelings internally",
      "Meditating by observing an aspect of the mind internally",
      "Meditating by observing an aspect of principles internally"
    ],
    "The seven prerequisites of immersion for the development and fulfillment of right immersion [dn18:27.3.0]": [
      "Right view",
      "Right thought",
      "Right speech",
      "Right action",
      "Right livelihood",
      "Right effort",
      "Right mindfulness"
    ],
    "The causal sequence of right immersion (a causal chain) [dn18:27.3.0]": [
      "Right view gives rise to right thought",
      "Right thought gives rise to right speech",
      "Right speech gives rise to right action",
      "Right action gives rise to right livelihood",
      "Right livelihood gives rise to right effort",
      "Right effort gives rise to right mindfulness",
      "Right mindfulness gives rise to right immersion",
      "Right immersion gives rise to right knowledge",
      "Right knowledge gives rise to right freedom"
    ],
    "The achievements of high distinction (a causal sequence) [dn18:27.3.0]": [
      "Stream-enterers",
      "Once-returners"
    ]
  }
}