{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn19": {
    "The seating arrangement of the gods of the Thirty-Three [dn19:2.0]": [
      "The Great King Dhataraṭṭha was seated to the east, facing west, in front of his gods.",
      "The Great King Virūḷhaka was seated to the south, facing north, in front of his gods.",
      "The Great King Virūpakkha was seated to the west, facing east, in front of his gods.",
      "The Great King Vessavaṇa was seated to the north, facing south, in front of his gods."
    ],
    "The joy of the gods of the Thirty-Three [dn19:2.0]": [
      "The gods of the Thirty-Three became uplifted and overjoyed at that, full of rapture and happiness, saying, ‘The heavenly hosts swell, while the demon hosts dwindle!’",
      "The gods of the Thirty-Three became even more uplifted and overjoyed at that, full of rapture and happiness, saying, ‘The heavenly hosts swell, while the demon hosts dwindle!’"
    ],
    "Eight Genuine Praises of the Buddha [dn19:4.0]": [
      "The Buddha has acted for the welfare and happiness of the people, out of compassion for the world, for the benefit, welfare, and happiness of gods and humans.",
      "The Buddha has explained the teaching well—visible in this very life, immediately effective, inviting inspection, relevant, so that sensible people can know it for themselves.",
      "The Buddha has clearly described what is skillful and what is unskillful, what is blameworthy and what is blameless, what should be cultivated and what should not be cultivated, what is inferior and what is superior, and what is on the side of dark and the side of bright.",
      "The Buddha has clearly described the practice that leads to extinguishment for his disciples.",
      "The Buddha takes his food free of vanity.",
      "The Buddha is committed to the joy of solitude, but doesn’t send them away.",
      "The Buddha does as he says, and says as he does.",
      "The Buddha has gone beyond doubt and got rid of indecision. He has achieved all he wished for regarding the fundamental purpose of the spiritual life."
    ],
    "The gods' wishes for the appearance of fully awakened Buddhas [dn19:4.0]": [
      "Four fully awakened Buddhas might arise in the world and teach the Dhamma, just like the Blessed One.",
      "Three fully awakened Buddhas, or two fully awakened Buddhas might arise in the world and teach the Dhamma, just like the Blessed One."
    ],
    "The signs of the appearance of Brahmā (a repetitive sentence structure) [dn19:4.0]": [
      "A magnificent light arose and radiance appeared in the northern quarter.",
      "As indicated by the signs, Brahmā will appear.",
      "For this is the sign of Brahmā: a light vast and great."
    ],
    "The qualities of Brahmā Sanaṅkumāra's voice [dn19:16.0]": [
      "Clear",
      "Comprehensible",
      "Charming",
      "Audible",
      "Rounded",
      "Undistorted",
      "Deep",
      "Resonant"
    ],
    "The eight genuine praises of the Buddha spoken by Sakka [dn19:16.0]": [
      "The Buddha is the Blessed One",
      "The Buddha is the Worthy One",
      "The Buddha is rightly self-awakened",
      "The Buddha has perfect knowledge and conduct",
      "The Buddha is a knower of the cosmos",
      "The Buddha is a trainer of people",
      "The Buddha is a teacher of gods and humans",
      "The Buddha is the Enlightened One, the Blessed One, the Worthy One, the Rightly Self-awakened One, perfect in knowledge and conduct, a knower of the cosmos, a trainer of people, a teacher of gods and humans, the Enlightened One, the Blessed One, the Worthy One, the Rightly Self-awakened One."
    ],
    "The proposal to Prince Reṇu [dn19:32.0]": [
      "King Disampati is old, elderly and senior, advanced in years, and has reached the final stage of life.",
      "It’s likely that when he passes away the king-makers will anoint you as king.",
      "If you should gain kingship, share it with us."
    ],
    "The seven parts of the great land [dn19:32.0]": [
      "Dantapura for the Kaliṅgas",
      "Potana for the Assakas",
      "Mahissati for the Avantis",
      "Roruka for the Sovīras",
      "Mithila for the Videhas",
      "Campā was made for the Aṅgas",
      "Varanasi for the Kāsīs"
    ],
    "The proposal to the Great Steward [dn19:37.0]": [
      "Would you manage our affairs?",
      "Please don’t turn us down!"
    ],
    "The people who were taught by the Great Steward [dn19:37.0]": [
      "Seven well-to-do brahmins",
      "Seven hundred bathed initiates"
    ],
    "The proposal to the Great Steward's wives [dn19:37.0]": [
      "I wish to go on retreat for the four months of the rainy season and practice the absorption on compassion.",
      "No one should approach me, except for the one who brings my meal."
    ],
    "The people who agreed to the Great Steward's proposal [dn19:37.0]": [
      "King Reṇu",
      "The six aristocrats",
      "The seven well-to-do brahmins",
      "Seven hundred bathed initiates",
      "The Great Steward's forty equal wives"
    ],
    "The questions asked by the Great Steward [dn19:44.0]": [
      "Who might you be, sir, so beautiful, glorious, majestic?",
      "How am I to know who you are?",
      "Standing on what, training in what may a mortal reach the deathless Brahmā realm?",
      "What among men, O Brahmā, is carrion-stench?"
    ],
    "The qualities required to reach the deathless Brahmā realm [dn19:44.0]": [
      "Giving up possessiveness",
      "Becoming one",
      "Being compassionate",
      "Refraining from sex"
    ],
    "The places where one can practice oneness [dn19:44.0]": [
      "A secluded lodging",
      "A wilderness",
      "The root of a tree",
      "A hill",
      "A ravine",
      "A mountain cave",
      "A charnel ground",
      "A forest",
      "The open air",
      "A heap of straw"
    ],
    "The qualities that lead to carrion-stench [dn19:44.0]": [
      "Anger",
      "Lies",
      "Fraud",
      "Deceit",
      "Miserliness",
      "Vanity",
      "Jealousy",
      "Desire",
      "Stinginess",
      "Harassing others",
      "Greed",
      "Hate",
      "Delusion"
    ],
    "The Great Steward's announcement to King Reṇu [dn19:47.0]": [
      "Please now find another high priest to manage the affairs of state for you.",
      "I wish to go forth from the lay life to homelessness.",
      "As I understand what Brahmā says about carrion-stench, it’s not easy to quell while living at home.",
      "I shall go forth from the lay life to homelessness.",
      "I announce to King Reṇu, the lord of the land: you must learn how to rule, for I no longer care for my ministry."
    ],
    "King Reṇu's response to the Great Steward [dn19:47.0]": [
      "If you’re lacking any pleasures, I’ll supply them for you.",
      "I’ll protect you from any harm, for I command the nation’s army.",
      "You are my father, I am your son! O Steward, please don’t leave!",
      "We will follow your example, Steward, be my Teacher!",
      "If the Steward is going forth from the lay life to homelessness, we shall do so too. Your destiny shall be ours."
    ],
    "The Great Steward's reason for leaving [dn19:47.0]": [
      "I’ve heard a non-human voice.",
      "I no longer care for lay life."
    ],
    "The Great Steward's encounter with Brahmā [dn19:47.0]": [
      "Brahmā appeared to me.",
      "The Eternal Youth from the Brahmā realm.",
      "He answered my question, hearing which I no longer care for lay life."
    ],
    "The qualities of living in the Steward's dispensation [dn19:47.0]": [
      "Like a gem of beryl— flawless, immaculate, beautiful— that’s how pure we shall live.",
      "In the Steward’s dispensation."
    ],
    "The Great Steward's announcement to the six aristocrats [dn19:48.0]": [
      "Please now find another high priest to manage the affairs of state for you.",
      "I wish to go forth from the lay life to homelessness.",
      "As I understand what Brahmā says about carrion-stench, it’s not easy to quell while living at home.",
      "I shall go forth from the lay life to homelessness."
    ],
    "The six aristocrats' plan to persuade the Great Steward with wealth [dn19:48.0]": [
      "In these seven kingdoms there is abundant wealth.",
      "We’ll get you as much as you want."
    ],
    "The Great Steward's response to the six aristocrats' plan to persuade him with wealth [dn19:48.0]": [
      "Enough, sirs.",
      "I already have abundant wealth, owing to my lords.",
      "Giving up all that, I shall go forth."
    ],
    "The six aristocrats' plan to persuade the Great Steward with women [dn19:48.0]": [
      "In these seven kingdoms there are many women.",
      "We’ll get you as many as you want."
    ],
    "The Great Steward's response to the six aristocrats' plan to persuade him with women [dn19:48.0]": [
      "Enough, sirs.",
      "I already have forty equal wives.",
      "Giving up all them, I shall go forth."
    ],
    "The six aristocrats' request to wait for a certain period of time [dn19:48.0]": [
      "Well then, sir, please wait for seven years.",
      "Six years.",
      "Five years.",
      "Four years.",
      "Three years.",
      "Two years.",
      "One year.",
      "Seven months.",
      "Six months.",
      "Five months.",
      "Four months.",
      "Three months.",
      "Two months.",
      "One month.",
      "Even a fortnight."
    ],
    "The Great Steward's response to the six aristocrats' request to wait for a certain period of time [dn19:48.0]": [
      "A fortnight is too long, sirs.",
      "As I understand what Brahmā says about carrion-stench, it’s not easy to quell while living at home.",
      "I shall go forth from the lay life to homelessness."
    ],
    "The six aristocrats' request to wait for a week [dn19:48.0]": [
      "Well then, sir, please wait for a week.",
      "So that we can instruct our sons and brothers in kingship.",
      "When a week has passed, we shall go forth. ",
      "Your destiny shall be ours."
    ],
    "The Great Steward's announcement to the seven well-to-do brahmins and seven hundred bathed initiates [dn19:56.0]": [
      "Please now find another teacher to teach you to recite the hymns.",
      "I wish to go forth from the lay life to homelessness.",
      "As I understand what Brahmā says about carrion-stench, it’s not easy to quell while living at home.",
      "I shall go forth from the lay life to homelessness."
    ],
    "The brahmins' plea to the Great Steward not to go forth from the lay life to homelessness [dn19:56.0]": [
      "Please don’t go forth from the lay life to homelessness!",
      "The life of one gone forth is of little influence or profit, whereas the life of a brahmin is of great influence and profit."
    ],
    "The Great Steward's response to the brahmins' plea [dn19:56.0]": [
      "Please, sirs, don’t say that.",
      "Who has greater influence and profit than myself?",
      "For now I am like a king to kings, like Brahmā to brahmins, like a deity to householders.",
      "Giving up all that, I shall go forth.",
      "As I understand what Brahmā says about carrion-stench, it’s not easy to quell while living at home.",
      "I shall go forth from the lay life to homelessness."
    ],
    "The brahmins' decision to go forth from the lay life to homelessness with the Great Steward [dn19:56.0]": [
      "If the Steward is going forth from the lay life to homelessness, we shall do so too.",
      "Your destiny shall be ours."
    ],
    "The Great Steward's announcement to his forty equal wives [dn19:57.0]": [
      "Ladies, please do whatever you wish, whether returning to your own families, or finding another husband.",
      "I wish to go forth from the lay life to homelessness.",
      "As I understand what Brahmā says about carrion-stench, it’s not easy to quell while living at home.",
      "I shall go forth from the lay life to homelessness."
    ],
    "The wives' response to the Great Steward's announcement [dn19:57.0]": [
      "You are the only family we want!",
      "You are the only husband we want!",
      "If you are going forth from the lay life to homelessness, we shall do so too.",
      "Your destiny shall be ours."
    ],
    "The Great Steward and his followers going forth from the lay life to homelessness [dn19:58.0]": [
      "The Great Steward shaved off his hair and beard, dressed in ocher robes, and went forth from the lay life to homelessness.",
      "The seven anointed aristocrat kings, the seven brahmins with seven hundred initiates, the forty equal wives, and many thousands of aristocrats, brahmins, householders, and many harem women shaved off their hair and beards, dressed in ocher robes, and went forth from the lay life to homelessness."
    ],
    "The Great Steward's meditation practices [dn19:58.0]": [
      "He meditated spreading a heart full of love to one direction, and to the second, and to the third, and to the fourth.",
      "He meditated spreading a heart full of compassion to one direction, and to the second, and to the third, and to the fourth.",
      "He meditated spreading a heart full of rejoicing to one direction, and to the second, and to the third, and to the fourth.",
      "He meditated spreading a heart full of equanimity to one direction, and to the second, and to the third, and to the fourth."
    ],
    "The rebirths of the Great Steward's disciples [dn19:58.0]": [
      "Those of his disciples who completely understood the Great Steward’s instructions were reborn in the Brahmā realm.",
      "Of those disciples who only partly understood the Great Steward’s instructions, some were reborn in the company of the Gods Who Control the Creations of Others, while some were reborn in the company of the Gods Who Love to Create, or the Joyful Gods, or the Gods of Yama, or the Gods of the Thirty-Three, or the Gods of the Four Great Kings.",
      "Those of the Great Steward's disciples who completely understand his instructions realize the undefiled freedom of heart and freedom by wisdom in this very life.",
      "Of those disciples who only partly understand his instructions, some, with the ending of the five lower fetters, become reborn spontaneously. They are extinguished there, and are not liable to return from that world.",
      "Some, with the ending of three fetters, and the weakening of greed, hate, and delusion, become once-returners. They come back to this world once only, then make an end of suffering.",
      "And some, with the ending of three fetters, become stream-enterers, not liable to be reborn in the underworld, bound for awakening."
    ]
  }
}