{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn2": {
    "The religious founders suggested to King Ajātasattu [dn2:0.3]": [
      "Pūraṇa Kassapa",
      "Makkhali Gosāla",
      "Ajita Kesakambala",
      "Pakudha Kaccāyana",
      "Sañjaya Belaṭṭhiputta",
      "Nigaṇṭha Nātaputta"
    ],
    "Different professional fields [dn2:11.0]": [
      "Elephant riders",
      "Cavalry",
      "Charioteers",
      "Archers",
      "Bannermen",
      "Adjutants",
      "Food servers",
      "Warrior-chiefs",
      "Princes",
      "Chargers",
      "Great warriors",
      "Heroes",
      "Leather-clad soldiers",
      "Sons of bondservants",
      "Bakers",
      "Barbers",
      "Bathroom attendants",
      "Cooks",
      "Garland-makers",
      "Dyers",
      "Weavers",
      "Basket-makers",
      "Potters",
      "Accountants",
      "Finger-talliers",
      "Those following any similar professions."
    ],
    "Various beliefs and concepts of Makkhali Gosāla [dn2:19.0]": [
      "There is no cause or condition for the corruption of sentient beings.",
      "Sentient beings are corrupted without cause or condition.",
      "There’s no cause or condition for the purification of sentient beings.",
      "Sentient beings are purified without cause or condition.",
      "One does not act of one’s own volition, one does not act of another’s volition, one does not act from a person’s volition.",
      "There is no power, no energy, no human strength or vigor.",
      "All sentient beings, all living creatures, all beings, all souls lack control, power, and energy.",
      "Molded by destiny, circumstance, and nature, they experience pleasure and pain in the six classes of rebirth.",
      "Various numbers of different things, such as main wombs, deeds, ascetics, faculties, hells, winds, cliffs, dreams, and eons.",
      "Pleasure and pain are allotted. Transmigration lasts only for a limited period, so there’s no increase or decrease, no getting better or worse.",
      "After transmigrating the foolish and the astute will make an end of suffering."
    ],
    "Various beliefs and concepts of Ajita Kesakambala [dn2:22.0]": [
      "There is no meaning in giving, sacrifice, or offerings.",
      "There’s no fruit or result of good and bad deeds.",
      "There’s no afterlife.",
      "There’s no obligation to mother and father.",
      "No beings are reborn spontaneously.",
      "There’s no ascetic or brahmin who is well attained and practiced, and who describes the afterlife after realizing it with their own insight.",
      "This person is made up of the four primary elements.",
      "When they die, the earth, water, fire, and air in their body merge and coalesce with the main mass of those elements.",
      "The faculties are transferred to space.",
      "Four men with a bier carry away the corpse. Their footprints show the way to the cemetery. The bones become bleached.",
      "Offerings dedicated to the gods end in ashes.",
      "Giving is a doctrine of morons.",
      "When anyone affirms a positive teaching it’s just hollow, false nonsense.",
      "Both the foolish and the astute are annihilated and destroyed when their body breaks up, and don’t exist after death."
    ],
    "The seven substances according to Pakudha Kaccāyana [dn2:25.0]": [
      "Earth",
      "Water",
      "Fire",
      "Air",
      "Pleasure",
      "Pain",
      "Soul",
      "These seven substances are not made, not derived, not created, without a creator, barren, steady as a mountain peak, standing firm like a pillar. They don’t move or deteriorate or obstruct each other. They’re unable to cause pleasure, pain, or neutral feeling to each other.",
      "If you chop off someone’s head with a sharp sword, you don’t take anyone’s life. The sword simply passes through the gap between the seven substances."
    ],
    "Different questions asked to Sañjaya Belaṭṭhiputta [dn2:31.0]": [
      "Whether there is another world",
      "Whether there is no other world",
      "Whether there both is and is not another world",
      "Whether there neither is nor is not another world",
      "Whether there are beings who are reborn spontaneously",
      "Whether there are no beings who are reborn spontaneously",
      "Whether there both are and are not beings who are reborn spontaneously",
      "Whether there neither are nor are not beings who are reborn spontaneously",
      "Whether there is fruit and result of good and bad deeds",
      "Whether there is no fruit and result of good and bad deeds",
      "Whether there both is and is not fruit and result of good and bad deeds",
      "Whether there neither is nor is not fruit and result of good and bad deeds",
      "Whether a Realized One exists after death",
      "Whether a Realized One doesn’t exist after death",
      "Whether a Realized One both exists and doesn’t exist after death",
      "Whether a Realized One neither exists nor doesn’t exist after death"
    ],
    "Different professional fields [dn2:31.0]": [
      "Elephant riders",
      "Cavalry",
      "Charioteers",
      "Archers",
      "Bannermen",
      "Adjutants",
      "Food servers",
      "Warrior-chiefs",
      "Princes",
      "Chargers",
      "Great warriors",
      "Heroes",
      "Leather-clad soldiers",
      "Sons of bondservants",
      "Bakers",
      "Barbers",
      "Bathroom attendants",
      "Cooks",
      "Garland-makers",
      "Dyers",
      "Weavers",
      "Basket-makers",
      "Potters",
      "Accountants",
      "Finger-talliers",
      "Those following any similar professions"
    ],
    "The first fruit of the ascetic life [dn2:31.0]": [
      "A person who was a bondservant, a worker",
      "They get up before you and go to bed after you",
      "They are obliging, behaving nicely and speaking politely, and gazing up at your face",
      "They think about the outcome and result of good deeds",
      "They shave off their hair and beard, dress in ocher robes, and go forth from the lay life to homelessness",
      "They live restrained in body, speech, and mind, living content with nothing more than food and clothes, delighting in seclusion",
      "The fruit of the ascetic life apparent in the present life"
    ],
    "The fruit of the ascetic life that’s apparent in the present life which is better and finer than the previous ones (a causal sequence) [dn2:39.0]": [
      "A Realized One arises in the world, perfected, a fully awakened Buddha",
      "A householder hears that teaching, or a householder’s child, or someone reborn in some clan",
      "They gain faith in the Realized One",
      "They shave off hair and beard, dress in ocher robes, and go forth from the lay life to homelessness",
      "They live restrained in the monastic code, conducting themselves well and seeking alms in suitable places",
      "They keep the rules they’ve undertaken, act skillfully by body and speech, are purified in livelihood and accomplished in ethical conduct, guard the sense doors, have mindfulness and situational awareness, and are content"
    ],
    "The section on ethics (a causal sequence) [dn2:39.0]": [
      "Giving up killing living creatures, renouncing the rod and the sword",
      "Giving up stealing",
      "Giving up unchastity",
      "Giving up lying",
      "Giving up divisive speech",
      "Giving up harsh speech",
      "Giving up talking nonsense",
      "Refraining from injuring plants and seeds",
      "Eating in one part of the day, abstaining from eating at night and food at the wrong time",
      "Avoiding dancing, singing, music, and seeing shows",
      "Refraining from beautifying and adorning themselves with garlands, fragrance, and makeup",
      "Avoiding high and luxurious beds",
      "Avoiding receiving gold and money, raw grains, raw meat, women and girls, male and female bondservants, goats and sheep, chickens and pigs, elephants, cows, horses, and mares, and fields and land",
      "Refraining from running errands and messages; buying and selling; falsifying weights, metals, or measures; bribery, fraud, cheating, and duplicity; mutilation, murder, abduction, banditry, plunder, and violence."
    ],
    "Ascetics and brahmins who engage in unethical behavior while enjoying food given in faith [dn2:46.0]": [
      "Injuring plants and seeds",
      "Storing up goods for their own use",
      "Seeing shows",
      "Gambling that causes negligence",
      "Making use of high and luxurious bedding",
      "Beautifying and adorning themselves with garlands, fragrance, and makeup",
      "Engaging in unworthy talk",
      "Engaging in arguments",
      "Engaging in running errands and messages",
      "Engaging in deceit, flattery, hinting, and belittling, and using material possessions to chase after other material possessions"
    ],
    "Examples of unethical behavior refrained from by ascetics and brahmins [dn2:46.0]": [
      "Injuring plants and seeds",
      "Storing up goods for their own use",
      "Seeing shows",
      "Gambling that causes negligence",
      "Making use of high and luxurious bedding",
      "Beautifying and adorning themselves with garlands, fragrance, and makeup",
      "Engaging in unworthy talk",
      "Engaging in arguments",
      "Engaging in running errands and messages",
      "Engaging in deceit, flattery, hinting, and belittling, and using material possessions to chase after other material possessions"
    ],
    "Unworthy branches of knowledge, wrong livelihood (a structured repetition) [dn2:56.0]": [
      "Limb-reading, omenology, divining celestial portents, interpreting dreams, divining bodily marks, divining holes in cloth gnawed by mice, fire offerings, ladle offerings, offerings of husks, rice powder, rice, ghee, or oil; offerings from the mouth, blood sacrifices, palmistry; geomancy for building sites, fields, and cemeteries; exorcisms, earth magic, snake charming, poisons; the crafts of the scorpion, the rat, the bird, and the crow; prophesying life span, chanting for protection, and deciphering animal cries.",
      "Reading the marks of gems, cloth, clubs, swords, spears, arrows, weapons, women, men, boys, girls, male and female bondservants, elephants, horses, buffaloes, bulls, cows, goats, rams, chickens, quails, monitor lizards, rabbits, tortoises, or deer.",
      "Making predictions that the king will march forth or march back; or that our king will attack and the enemy king will retreat, or vice versa; or that our king will triumph and the enemy king will be defeated, or vice versa; and so there will be victory for one and defeat for the other.",
      "Making predictions that there will be an eclipse of the moon, or sun, or stars; that the sun, moon, and stars will be in conjunction or in opposition; that there will be a meteor shower, a fiery sky, an earthquake, thunder; that there will be a rising, a setting, a darkening, a brightening of the moon, sun, and stars. And it also includes making predictions about the results of all such phenomena.",
      "Predicting whether there will be plenty of rain or drought; plenty to eat or famine; an abundant harvest or a bad harvest; security or peril; sickness or health. It also includes such occupations as computing, accounting, calculating, poetry, and cosmology.",
      "Making arrangements for giving and taking in marriage; for engagement and divorce; and for scattering rice inwards or outwards at the wedding ceremony. It also includes casting spells for good or bad luck, causing abortions, binding the tongue, or locking the jaws; charms for the hands and ears; questioning a mirror, a girl, or a god as an oracle; worshiping the sun, worshiping the Great One, breathing fire, and invoking Siri, the goddess of luck.",
      "Rites for propitiation, for granting wishes, for ghosts, for the earth, for rain, for property settlement, and for preparing and consecrating house sites, and rites involving rinsing and bathing, and oblations. It also includes administering emetics, purgatives, expectorants, and phlegmagogues; administering ear-oils, eye restoratives, nasal medicine, ointments, and counter-ointments; surgery with needle and scalpel, treating children, prescribing root medicines, and binding on herbs."
    ],
    "The sense doors [dn2:56.0]": [
      "Sight",
      "Hearing",
      "Smell",
      "Taste",
      "Touch",
      "Mind"
    ],
    "Situations in which a mendicant acts with situational awareness [dn2:65.0]": [
      "Going out and coming back",
      "Looking ahead and aside",
      "Bending and extending the limbs",
      "Bearing the outer robe, bowl, and robes",
      "Eating, drinking, chewing, and tasting",
      "Urinating and defecating",
      "Walking, standing, sitting, sleeping, waking, speaking, and keeping silent."
    ],
    "Giving up the hindrances [dn2:67.0]": [
      "Giving up desire for the world",
      "Giving up ill will and malevolence",
      "Giving up dullness and drowsiness",
      "Giving up restlessness and remorse",
      "Giving up doubt"
    ],
    "Examples of joy and happiness [dn2:67.0]": [
      "A man who has gotten into debt were to apply himself to work",
      "A person who was sick, suffering, gravely ill",
      "A person was imprisoned in a jail",
      "A person was a bondservant",
      "A person with wealth and property who was traveling along a desert road"
    ],
    "The process of meditation (a causal sequence) [dn2:67.0]": [
      "Seeing that the hindrances have been given up in them",
      "Joy springs up",
      "Being joyful, rapture springs up",
      "When the mind is full of rapture, the body becomes tranquil",
      "When the body is tranquil, they feel bliss",
      "And when blissful, the mind becomes immersed."
    ],
    "Characteristics of the first absorption [dn2:75.0]": [
      "Secluded from sensual pleasures",
      "Secluded from unskillful qualities",
      "Has the rapture and bliss born of seclusion",
      "Placing the mind and keeping it connected",
      "Drenches, steeps, fills, and spreads the body with rapture and bliss born of seclusion"
    ],
    "Characteristics of the second absorption [dn2:77.0]": [
      "Placing of the mind and keeping it connected are stilled",
      "Has the rapture and bliss born of immersion",
      "Internal clarity and confidence",
      "Unified mind",
      "Without applying the mind and keeping it connected",
      "Drenches, steeps, fills, and spreads the body with rapture and bliss born of immersion"
    ],
    "The fruit of the ascetic life [dn2:77.0]": [
      "Apparent in the present life",
      "Better and finer than the former ones."
    ],
    "Characteristics of the third absorption [dn2:79.0]": [
      "Fading away of rapture",
      "Meditate with equanimity, mindful and aware",
      "Personally experiencing the bliss of which the noble ones declare",
      "Drenches, steeps, fills, and spreads their body with bliss free of rapture",
      "No part of the body that’s not spread with bliss free of rapture"
    ],
    "The fruit of the ascetic life [dn2:79.0]": [
      "Apparent in the present life",
      "Better and finer than the former ones."
    ],
    "Characteristics of the fourth absorption [dn2:81.0]": [
      "Giving up pleasure and pain",
      "Ending former happiness and sadness",
      "Without pleasure or pain",
      "With pure equanimity and mindfulness",
      "They sit spreading their body through with pure bright mind",
      "No part of the body that’s not spread with pure bright mind"
    ],
    "Characteristics of knowledge and vision [dn2:81.0]": [
      "Mind has become immersed in samādhi",
      "Purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable",
      "They extend it and project it toward knowledge and vision",
      "They understand that the body is physical and made up of the four primary elements, produced by mother and father, built up from rice and porridge, liable to impermanence, to wearing away and erosion, to breaking up and destruction."
    ],
    "Characteristics of the mind-made body [dn2:85.0]": [
      "Mind has become immersed in samādhi",
      "Purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable",
      "They extend it and project it toward the creation of a mind-made body",
      "From this body, they create another body, physical, mind-made, complete in all its various parts, not deficient in any faculty."
    ],
    "Analogy of drawing out a reed, sword, or snake [dn2:85.0]": [
      "Suppose a person was to draw a reed out from its sheath. They’d think: ‘This is the reed, this is the sheath. The reed and the sheath are different things. The reed has been drawn out from the sheath.’",
      "Suppose a person was to draw a sword out from its scabbard. They’d think: ‘This is the sword, this is the scabbard. The sword and the scabbard are different things. The sword has been drawn out from the scabbard.’",
      "Suppose a person was to draw a snake out from its slough. They’d think: ‘This is the snake, this is the slough. The snake and the slough are different things. The snake has been drawn out from the slough.’"
    ],
    "The fruit of the ascetic life [dn2:85.0]": [
      "Apparent in the present life",
      "Better and finer than the former ones."
    ],
    "Psychic powers [dn2:87.0]": [
      "Mind has become immersed in samādhi",
      "Purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable",
      "They extend it and project it toward psychic power",
      "They wield the many kinds of psychic power",
      "Multiplying themselves and becoming one again",
      "Going unimpeded through a wall, a rampart, or a mountain as if through space",
      "Diving in and out of the earth as if it were water",
      "Walking on water as if it were earth",
      "Flying cross-legged through the sky like a bird",
      "Touching and stroking with the hand the sun and moon, so mighty and powerful",
      "Controlling the body as far as the Brahmā realm"
    ],
    "Analogy of producing items [dn2:87.0]": [
      "Suppose an expert potter or their apprentice had some well-prepared clay. They could produce any kind of pot that they like.",
      "Or suppose a deft ivory-carver or their apprentice had some well-prepared ivory. They could produce any kind of ivory item that they like.",
      "Or suppose a deft goldsmith or their apprentice had some well-prepared gold. They could produce any kind of gold item that they like."
    ],
    "The fruit of the ascetic life [dn2:87.0]": [
      "Apparent in the present life",
      "Better and finer than the former ones."
    ],
    "Clairaudience [dn2:89.0]": [
      "Mind has become immersed in samādhi",
      "Purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable",
      "They extend it and project it toward clairaudience",
      "With clairaudience that is purified and superhuman, they hear both kinds of sounds, human and divine, whether near or far"
    ],
    "Analogy of hearing sounds [dn2:89.0]": [
      "Suppose there was a person traveling along the road. They’d hear the sound of drums, clay drums, horns, kettledrums, and tom-toms. They’d think: ‘That’s the sound of drums,’ and ‘that’s the sound of clay-drums,’ and ‘that’s the sound of horns, kettledrums, and tom-toms.’"
    ],
    "Comprehending the Minds of Others [dn2:91.0]": [
      "Mind has become immersed in samādhi",
      "Purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable",
      "They extend it and project it toward comprehending the minds of others",
      "They understand the minds of other beings and individuals, having comprehended them with their own mind",
      "They understand mind with greed as ‘mind with greed’, and mind without greed as ‘mind without greed’",
      "They understand mind with hate … mind without hate … mind with delusion … mind without delusion … constricted mind … scattered mind … expansive mind … unexpansive mind … mind that is not supreme … mind that is supreme … immersed mind … unimmersed mind … freed mind … They understand unfreed mind as ‘unfreed mind’"
    ],
    "Analogy of checking one's reflection [dn2:91.0]": [
      "Suppose there was a woman or man who was young, youthful, and fond of adornments, and they check their own reflection in a clean bright mirror or a clear bowl of water. If they had a spot they’d know ‘I have a spot,’ and if they had no spots they’d know ‘I have no spots.’"
    ],
    "The fruit of the ascetic life [dn2:91.0]": [
      "Apparent in the present life",
      "Better and finer than the former ones."
    ],
    "Recollection of Past Lives [dn2:93.0]": [
      "Mind has become immersed in samādhi",
      "Purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable",
      "They extend it and project it toward recollection of past lives",
      "They recollect many kinds of past lives, that is, one, two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand rebirths; many eons of the world contracting, many eons of the world expanding, many eons of the world contracting and expanding",
      "They remember: ‘There, I was named this, my clan was that, I looked like this, and that was my food. This was how I felt pleasure and pain, and that was how my life ended. When I passed away from that place I was reborn somewhere else. There, too, I was named this, my clan was that, I looked like this, and that was my food. This was how I felt pleasure and pain, and that was how my life ended. When I passed away from that place I was reborn here.’ And so they recollect their many kinds of past lives, with features and details."
    ],
    "Analogy of a person traveling to different villages [dn2:93.0]": [
      "Suppose a person was to leave their home village and go to another village. From that village they’d go to yet another village. And from that village they’d return to their home village. They’d think: ‘I went from my home village to another village. There I stood like this, sat like that, spoke like this, or kept silent like that. From that village I went to yet another village. There too I stood like this, sat like that, spoke like this, or kept silent like that. And from that village I returned to my home village.’"
    ],
    "Knowledge of the death and rebirth of sentient beings [dn2:95.0]": [
      "Mind has become immersed in samādhi",
      "Purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable",
      "They extend it and project it toward knowledge of the death and rebirth of sentient beings",
      "With clairvoyance that is purified and superhuman, they see sentient beings passing away and being reborn—inferior and superior, beautiful and ugly, in a good place or a bad place",
      "They understand how sentient beings are reborn according to their deeds"
    ],
    "Analogy of a person with good eyesight standing at a stilt longhouse [dn2:95.0]": [
      "Suppose there was a stilt longhouse at the central square. A person with good eyesight standing there might see people entering and leaving a house, walking along the streets and paths, and sitting at the central square. They’d think: ‘These are people entering and leaving a house, walking along the streets and paths, and sitting at the central square.’"
    ],
    "The fruit of the ascetic life [dn2:95.0]": [
      "Apparent in the present life",
      "Better and finer than the former ones."
    ],
    "Knowledge of the ending of defilements [dn2:97.0]": [
      "Mind has become immersed in samādhi",
      "Purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable",
      "They extend it and project it toward knowledge of the ending of defilements",
      "They truly understand: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering’",
      "They truly understand: ‘These are defilements’ … ‘This is the origin of defilements’ … ‘This is the cessation of defilements’ … ‘This is the practice that leads to the cessation of defilements’",
      "Knowing and seeing like this, their mind is freed from the defilements of sensuality, desire to be reborn, and ignorance",
      "When they’re freed, they know they’re freed",
      "They understand: ‘Rebirth is ended, the spiritual journey has been completed, what had to be done has been done, there is no return to any state of existence.’"
    ],
    "Analogy of a person with good eyesight standing on the bank of a transparent lake [dn2:97.0]": [
      "Suppose that in a mountain glen there was a lake that was transparent, clear, and unclouded. A person with good eyesight standing on the bank would see the clams and mussels, and pebbles and gravel, and schools of fish swimming about or staying still. They’d think: ‘This lake is transparent, clear, and unclouded. And here are the clams and mussels, and pebbles and gravel, and schools of fish swimming about or staying still.’"
    ],
    "The fruit of the ascetic life [dn2:97.0]": [
      "Apparent in the present life",
      "Better and finer than the former ones",
      "Knowledge of the ending of defilements is the best fruit of the ascetic life apparent in the present life."
    ]
  }
}