{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn21": {
    "Pañcasikha’s Song [dn21:1.4.7.0]": [
      "Homage to lady Suriyavaccasā and her father Timbaru",
      "Comparison of lady Suriyavaccasā's beauty to the teaching",
      "Request for lady Suriyavaccasā's love",
      "Comparison of lady Suriyavaccasā's breasts to a lotus pond",
      "Comparison of the speaker's desire to elephants in rutting season",
      "Request for lady Suriyavaccasā's embrace",
      "Merit forged by giving to perfected beings",
      "Aiming for the deathless state",
      "Rejoicing in awakening to the truth",
      "Wish for lady Suriyavaccasā's love",
      "Homage to Timbaru"
    ],
    "Beings who want to be happy [dn21:1.8.0]": [
      "gods",
      "humans",
      "demons",
      "dragons",
      "fairies",
      "any other diverse creatures there may be"
    ],
    "Sakka's attempt to see the Buddha [dn21:1.8.0]": [
      "Sakka wanted to come and see the Buddha",
      "He was prevented by his many duties and responsibilities for the gods of the Thirty-Three",
      "He went to Sāvatthī to see the Buddha, but the Buddha was sitting immersed in some kind of meditation",
      "Sakka asked a divine maiden of Great King Vessavaṇa named Bhūjati to convey his message to the Buddha",
      "Bhūjati said it was the wrong time to see the Buddha as he was in retreat",
      "Sakka asked Bhūjati to convey his message when the Buddha emerges from that immersion",
      "The sound of Sakka's chariot wheels pulled the Buddha out of that immersion"
    ],
    "The effect of a Realized One arising in the world (a causal sequence) [dn21:1.8.0]": [
      "When a Realized One arises in the world, perfected and fully awakened",
      "The heavenly hosts swell",
      "The demon hosts dwindle"
    ],
    "The fetters that bind the gods, humans, demons, dragons, fairies, and other diverse creatures [dn21:1.11.4.0]": [
      "Jealousy",
      "Stinginess"
    ],
    "The source of jealousy and stinginess [dn21:1.11.4.0]": [
      "The liked and the disliked",
      "Desire",
      "Thought",
      "Concepts of identity that emerge from the proliferation of perceptions"
    ],
    "The practice for the cessation of concepts of identity that emerge from the proliferation of perceptions (a causal chain) [dn21:1.11.4.0]": [
      "Not explicitly stated in the given text."
    ],
    "Two kinds of happiness [dn21:2.3.2.0]": [
      "Happiness that cultivates unskillful qualities and declines skillful qualities",
      "Happiness that cultivates skillful qualities and declines unskillful qualities"
    ],
    "Two kinds of sadness [dn21:2.3.2.0]": [
      "Sadness that cultivates unskillful qualities and declines skillful qualities",
      "Sadness that cultivates skillful qualities and declines unskillful qualities"
    ],
    "Two kinds of equanimity [dn21:2.3.2.0]": [
      "Equanimity that cultivates unskillful qualities and declines skillful qualities",
      "Equanimity that cultivates skillful qualities and declines unskillful qualities"
    ],
    "The Buddha's answer to Sakka [dn21:2.3.2.0]": [
      "Explanation of two kinds of happiness",
      "Explanation of two kinds of sadness",
      "Explanation of two kinds of equanimity",
      "How a mendicant practices for the cessation of concepts of identity that emerge from the proliferation of perceptions."
    ],
    "Two kinds of bodily behavior [dn21:2.4.0]": [
      "Bodily conduct that cultivates unskillful qualities and declines skillful qualities",
      "Bodily conduct that cultivates skillful qualities and declines unskillful qualities"
    ],
    "Two kinds of verbal behavior [dn21:2.4.0]": [
      "Verbal behavior that causes unskillful qualities to grow while skillful qualities decline",
      "Verbal behavior that causes unskillful qualities to decline while skillful qualities grow"
    ],
    "Two kinds of search [dn21:2.4.0]": [
      "Search that causes unskillful qualities to grow while skillful qualities decline",
      "Search that causes unskillful qualities to decline while skillful qualities grow"
    ],
    "The Buddha's answer to Sakka [dn21:2.4.0]": [
      "Explanation of two kinds of bodily behavior",
      "Explanation of two kinds of verbal behavior",
      "Explanation of two kinds of search",
      "How a mendicant practices for restraint in the monastic code."
    ],
    "Two kinds of sense objects [dn21:2.5.0]": [
      "Sight known by the eye",
      "Sound known by the ear",
      "Smells known by the nose",
      "Tastes known by the tongue",
      "Touches known by the body",
      "Thoughts known by the mind"
    ],
    "Sakka's understanding of the Buddha's brief statement [dn21:2.5.0]": [
      "The kind of sight, sound, smell, taste, touch, or thought known by the mind which causes unskillful qualities to grow while skillful qualities decline should not be cultivated",
      "The kind of sight, sound, smell, taste, touch, or thought known by the mind which causes unskillful qualities to decline while skillful qualities grow should be cultivated"
    ],
    "The reason why not all ascetics and brahmins have the same doctrine, ethics, desires, and attachments [dn21:2.5.0]": [
      "The world has many and diverse elements",
      "Sentient beings insist on different elements",
      "They obstinately stick to their chosen element",
      "They insist that their chosen element is the only truth"
    ],
    "The reason why not all ascetics and brahmins have reached the ultimate end, the ultimate sanctuary, the ultimate spiritual life, the ultimate goal (a causal sequence) [dn21:2.5.0]": [
      "Those mendicants who are freed through the ending of craving have reached the ultimate end, the ultimate sanctuary, the ultimate spiritual life, the ultimate goal",
      "Not all ascetics and brahmins are freed through the ending of craving"
    ],
    "Sakka's encounter with other ascetics and brahmins (a causal sequence) [dn21:2.5.0]": [
      "Sakka approached other ascetics and brahmins living in the wilderness",
      "They were stumped by his question",
      "They questioned him in return",
      "Sakka taught them the Dhamma",
      "They became his disciples",
      "Sakka is the Buddha's disciple, a stream-enterer, not liable to be reborn in the underworld, bound for awakening."
    ],
    "The six reasons to speak of such joy and happiness [dn21:2.7.21.0]": [
      "Gained an extended life",
      "Consciously go to a new womb",
      "Practice according to method, aware and mindful",
      "Live as one who understands",
      "Become a god again in the supreme heaven realm",
      "Home will be with the glorious Akaniṭṭhas"
    ],
    "The questions Sakka was invited to ask [dn21:2.7.21.0]": [
      "Do you recall ever feeling such joy and happiness before?",
      "But how?",
      "What reason do you see for speaking of such joy and happiness?"
    ]
  }
}