{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn24": {
    "Praises of the Buddha by Sunakkhatta [dn24:0.3]": [
      "Perfected, a fully awakened Buddha",
      "Accomplished in knowledge and conduct",
      "Holy",
      "Knower of the world",
      "Supreme guide for those who wish to train",
      "Teacher of gods and humans",
      "Awakened",
      "Blessed"
    ],
    "Praises of the teaching by Sunakkhatta [dn24:0.3]": [
      "Well explained by the Buddha",
      "Visible in this very life",
      "Immediately effective",
      "Inviting inspection",
      "Relevant",
      "So that sensible people can know it for themselves"
    ],
    "Praises of the Saṅgha by Sunakkhatta [dn24:0.3]": [
      "Practicing the way that’s good",
      "Direct",
      "Methodical",
      "Proper",
      "Consists of the four pairs, the eight individuals",
      "Worthy of offerings dedicated to the gods",
      "Worthy of hospitality",
      "Worthy of a religious donation",
      "Worthy of greeting with joined palms",
      "The supreme field of merit for the world."
    ],
    "Actions performed by the Buddha [dn24:1.19.0]": [
      "Educated",
      "Encouraged",
      "Fired up",
      "Inspired",
      "Released the assembly from the great bondage",
      "Lifted 84,000 beings from the great swamp",
      "Entered upon the fire element",
      "Rose into the sky to the height of seven palm trees",
      "Created a flame another seven palm trees high, blazing and smoking",
      "Landed at the Great Wood, in the hall with the peaked roof"
    ],
    "Sunakkhatta's statements (a causal sequence) [dn24:1.19.0]": [
      "The declaration made about Pāṭikaputta turned out to be correct",
      "A superhuman demonstration of psychic power has been performed"
    ],
    "Ascetics and brahmins who describe the origin of the world in their tradition [dn24:2.14.0]": [
      "Created by the Lord God, by Brahmā",
      "Due to those depraved by play",
      "Due to those who are malevolent",
      "Originated by chance"
    ],
    "How the origin of the world came about according to each tradition [dn24:2.14.0]": [
      "Contracting of the cosmos",
      "Sentient beings headed for the realm of streaming radiance",
      "Expansion of the cosmos",
      "Appearance of an empty mansion of Brahmā",
      "Rebirth of a certain sentient being in the empty mansion of Brahmā",
      "Wish of the being who was reborn there first for another being to come to that state of existence",
      "Rebirth of other sentient beings in the empty mansion of Brahmā",
      "Being who was reborn first thinks of themselves as Brahmā",
      "Beings who were reborn there later also think of the first being as Brahmā",
      "Being who was reborn first is more long-lived, beautiful, and illustrious than those who arrived later",
      "Passing away of one of those beings from that host and rebirth in this state of existence",
      "Immersion of the heart and recollection of past life",
      "Description of the origin of the world according to each tradition"
    ],
    "Misrepresentation of the Buddha's teaching (a causal chain) [dn24:2.14.0]": [
      "False, hollow, lying, untruthful claim that the Buddha has a distorted perspective",
      "Misrepresentation of the Buddha's teaching on the liberation of the beautiful"
    ]
  }
}