{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn25": {
    "Unworthy talk engaged by Nigrodha and his assembly [dn25:0.3]": [
      "Talk about kings, bandits, and ministers",
      "Talk about armies, threats, and wars",
      "Talk about food, drink, clothes, and beds",
      "Talk about garlands and fragrances",
      "Talk about family, vehicles, villages, towns, cities, and countries",
      "Talk about women and heroes",
      "Street talk and well talk",
      "Talk about the departed",
      "Motley talk",
      "Tales of land and sea",
      "Talk about being reborn in this or that state of existence"
    ],
    "The way the Buddha frequents remote lodgings [dn25:0.3]": [
      "Quiet and still",
      "Far from the madding crowd",
      "Remote from human settlements",
      "Fit for retreat"
    ],
    "Nigrodha's challenge to the Buddha (a description) [dn25:0.3]": [
      "Nigrodha challenges the Buddha to come to his assembly",
      "Nigrodha plans to ask the Buddha a question",
      "The question is \"Sir, what teaching do you use to guide your disciples, through which they claim solace in the fundamental purpose of the spiritual life?\""
    ],
    "The conditions for the mortification in disgust of sin [dn25:7.0]": [
      "Going naked, ignoring conventions",
      "Licking hands, not coming or waiting when called",
      "Not consenting to food brought to them, or food prepared on purpose for them, or an invitation for a meal",
      "Not receiving anything from a pot or bowl; or from someone who keeps sheep, or who has a weapon or a shovel in their home; or where a couple is eating; or where there is a woman who is pregnant, breast-feeding, or who has a man in her home; or where there’s a dog waiting or flies buzzing",
      "Accepting no fish or meat or liquor or wine, and drinking no beer",
      "Going to just one house for alms, taking just one mouthful, or two houses and two mouthfuls, up to seven houses and seven mouthfuls",
      "Feeding on one saucer a day, two saucers a day, up to seven saucers a day",
      "Eating once a day, once every second day, up to once a week, and so on, even up to once a fortnight",
      "Living committed to the practice of eating food at set intervals",
      "Eating herbs, millet, wild rice, poor rice, water lettuce, rice bran, scum from boiling rice, sesame flour, grass, or cow dung",
      "Surviving on forest roots and fruits, or eating fallen fruit",
      "Wearing robes of sunn hemp, mixed hemp, corpse-wrapping cloth, rags, lodh tree bark, antelope hide (whole or in strips), kusa grass, bark, wood-chips, human hair, horse-tail hair, or owls’ wings",
      "Tearing out their hair and beard, committed to this practice",
      "Constantly standing, refusing seats",
      "Squatting, committed to persisting in the squatting position",
      "Lying on a mat of thorns, making a mat of thorns their bed",
      "Making their bed on a plank, or the bare ground",
      "Lying only on one side",
      "Wearing dust and dirt",
      "Staying in the open air",
      "Sleeping wherever they lay their mat",
      "Eating unnatural things, committed to the practice of eating unnatural foods",
      "Not drinking, committed to the practice of not drinking liquids",
      "Being committed to the practice of immersion in water three times a day, including the evening."
    ],
    "Defects of a mortifier's practice of mortification [dn25:9.0]": [
      "Undertaking a practice of mortification and being happy with that",
      "Glorifying themselves and putting others down on account of that",
      "Becoming indulgent and infatuated and falling into negligence on account of that",
      "Generating possessions, honor, and popularity through that mortification and being happy with that",
      "Generating possessions, honor, and popularity through that mortification and glorifying themselves and putting others down on account of that",
      "Generating possessions, honor, and popularity through that mortification and becoming indulgent and infatuated and falling into negligence on account of that",
      "Becoming fussy about food and eating tied, infatuated, attached, blind to the drawbacks, and not understanding the escape",
      "Undertaking a practice of mortification out of longing for possessions, honor, and popularity, thinking that they will be honored by others",
      "Rebuking a certain ascetic or brahmin",
      "Giving rise to jealousy and stinginess regarding families",
      "Sitting meditation only when people can see them",
      "Sneaking about among families",
      "Behaving in an underhand manner",
      "Disagreeing with the way that the Realized One or their disciple teaches Dhamma, even when they make a valid point",
      "Being irritable and hostile, offensive and contemptuous, jealous and stingy, devious and deceitful, obstinate and vain, having wicked desires, falling under the sway of wicked desires, having wrong view, being attached to an extremist view, and being attached to their own views, holding them tight, and refusing to let go."
    ],
    "Points of purity in the practice of mortification [dn25:13.0]": [
      "Undertaking a practice of mortification without becoming indulgent",
      "Not generating possessions, honor, and popularity through mortification",
      "Not becoming fussy about food",
      "Not undertaking a practice of mortification out of longing for possessions, honor, and popularity",
      "Not rebuking a certain ascetic or brahmin",
      "Not giving rise to jealousy and stinginess regarding families",
      "Not sitting meditation only when people can see them",
      "Not sneaking about among families",
      "Not behaving in an underhand manner",
      "Agreeing with the way that the Realized One or their disciple teaches Dhamma when they make a valid point",
      "Not being irritable and hostile, offensive and contemptuous, jealous and stingy, devious and deceitful, obstinate and vain, having wicked desires, and wrong view, and not being attached to their own views, holding them tight, and refusing to let go."
    ],
    "The stages of mortification in disgust of sin [dn25:13.0]": [
      "Undertaking a practice of mortification",
      "Not becoming indulgent",
      "Not generating possessions, honor, and popularity through mortification",
      "Not becoming fussy about food",
      "Not undertaking a practice of mortification out of longing for possessions, honor, and popularity",
      "Not rebuking a certain ascetic or brahmin",
      "Not giving rise to jealousy and stinginess regarding families",
      "Not sitting meditation only when people can see them",
      "Not sneaking about among families",
      "Not behaving in an underhand manner",
      "Agreeing with the way that the Realized One or their disciple teaches Dhamma when they make a valid point",
      "Not being irritable and hostile, offensive and contemptuous, jealous and stingy, devious and deceitful, obstinate and vain, having wicked desires, and wrong view, and not being attached to their own views, holding them tight, and refusing to let go.",
      "Mortification in disgust of sin has not yet reached the peak and the pith, but only reached the shoots."
    ],
    "The fourfold restraint [dn25:16.0]": [
      "They don’t kill living creatures, get others to kill, or approve of killing.",
      "They don’t steal, get others to steal, or approve of stealing.",
      "They don’t lie, get others to lie, or approve of lying.",
      "They don’t expect rewards from their practice, they don’t lead others to expect rewards, and they don’t approve of expecting rewards."
    ],
    "The meditation practice [dn25:16.0]": [
      "Giving up desire for the world",
      "Giving up ill will and malevolence",
      "Giving up dullness and drowsiness",
      "Giving up restlessness and remorse",
      "Giving up doubt",
      "Spreading a heart full of love",
      "Spreading a heart full of compassion",
      "Spreading a heart full of rejoicing",
      "Spreading a heart full of equanimity"
    ],
    "The meditation practice [dn25:18.0]": [
      "Giving up the five hindrances",
      "Spreading a heart full of love",
      "Spreading a heart full of compassion",
      "Spreading a heart full of rejoicing",
      "Spreading a heart full of equanimity",
      "Recollecting many kinds of past lives"
    ],
    "The recollection of past lives (a causal sequence) [dn25:18.0]": [
      "Recollecting one, two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand rebirths",
      "Recollecting many eons of the world contracting",
      "Recollecting many eons of the world expanding",
      "Recollecting many eons of the world contracting and expanding",
      "Recollecting the details of past lives, including name, clan, appearance, food, pleasure, pain, and how life ended."
    ],
    "The meditation practice [dn25:19.0]": [
      "Giving up the five hindrances",
      "Spreading a heart full of love",
      "Spreading a heart full of equanimity",
      "Recollecting many kinds of past lives",
      "Seeing sentient beings passing away and being reborn",
      "Understanding how sentient beings are reborn according to their deeds"
    ],
    "The rebirth of sentient beings (a causal sequence) [dn25:19.0]": [
      "Sentient beings passing away and being reborn",
      "Being reborn in inferior and superior states",
      "Being reborn in beautiful and ugly forms",
      "Being reborn in good or bad places",
      "Being reborn according to their deeds, whether good or bad"
    ],
    "The questions asked by Sandhāna to Nigrodha [dn25:20.0]": [
      "Why don’t you send him out of the assembly to the periphery like a nilgai antelope?",
      "Why don’t you sink him with just one question?",
      "Why don’t you roll him over and wrap him up like a hollow pot?"
    ],
    "The behavior of the Buddhas of the past [dn25:20.0]": [
      "They didn’t make an uproar",
      "They frequented remote lodgings in the wilderness",
      "The lodgings were quiet and still",
      "The lodgings were far from the madding crowd",
      "The lodgings were remote from human settlements",
      "The lodgings were fit for retreat"
    ],
    "The qualities of the Buddha (a causal sequence) [dn25:20.0]": [
      "Awakened",
      "Tamed",
      "Serene",
      "Crossed over",
      "Extinguished",
      "Teaches Dhamma for awakening, taming, serenity, crossing over, and extinguishment"
    ],
    "The time it takes to realize the supreme end of the spiritual path [dn25:22.0]": [
      "Seven years",
      "Six years",
      "Five years",
      "Four years",
      "Three years",
      "Two years",
      "One year",
      "Seven months",
      "Six months",
      "Five months",
      "Four months",
      "Three months",
      "Two months",
      "One month",
      "A fortnight",
      "Seven days"
    ],
    "The qualities of a sensible person (a causal sequence) [dn25:22.0]": [
      "Neither devious nor deceitful",
      "A person of integrity"
    ],
    "The teaching and instruction of the Buddha [dn25:22.0]": [
      "I teach and instruct them",
      "By practicing as instructed they will realize the supreme end of the spiritual path in this very life"
    ],
    "Reasons why the ascetic Gotama speaks in a certain way [dn25:23.0]": [
      "Because he wants pupils",
      "Because he wants them to give up their recitation",
      "Because he wants them to give up their livelihood",
      "Because he wants them to start doing things that are unskillful and considered unskillful in their tradition",
      "Because he wants them to stop doing things that are skillful and considered skillful in their tradition"
    ],
    "Things that may be given up through the practice of Dhamma [dn25:23.0]": [
      "Things that are unskillful",
      "Things that are corrupted",
      "Things that lead to future lives",
      "Things that are hurtful",
      "Things that result in suffering and future rebirth, old age, and death"
    ],
    "The qualities that will grow through the practice of Dhamma [dn25:23.0]": [
      "Cleansing qualities",
      "Fullness and abundance of wisdom"
    ],
    "The state of mind of the wanderers [dn25:23.0]": [
      "Silent",
      "Dismayed",
      "Shoulders drooping",
      "Downcast",
      "Depressed"
    ],
    "The thoughts of the Buddha [dn25:23.0]": [
      "All these foolish people have been touched by the Wicked One!",
      "For not even a single one thinks, ‘Come, let us lead the spiritual life under the ascetic Gotama for the sake of enlightenment—for what do seven days matter?’”"
    ]
  }
}