{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn26": {
    "How to live as your own island, your own refuge, with no other refuge [dn26:0.3]": [
      "Let the teaching be your island and your refuge, with no other refuge.",
      "Meditate observing an aspect of the body—keen, aware, and mindful, rid of desire and aversion for the world.",
      "Meditate observing an aspect of feelings—keen, aware, and mindful, rid of desire and aversion for the world.",
      "Meditate observing an aspect of mind—keen, aware, and mindful, rid of desire and aversion for the world.",
      "Meditate observing an aspect of principles—keen, aware, and mindful, rid of desire and aversion for the world."
    ],
    "Undertaking skillful qualities [dn26:0.3]": [
      "Undertaking skillful qualities",
      "This merit grows."
    ],
    "The noble duties of a wheel-turning monarch [dn26:5.0]": [
      "Relying only on principle",
      "Honoring, respecting, and venerating principle",
      "Having principle as your flag, banner, and authority",
      "Provide just protection and security for your court, troops, aristocrats, vassals, brahmins and householders, people of town and country, ascetics and brahmins, beasts and birds",
      "Do not let injustice prevail in the realm",
      "Pay money to the penniless in the realm",
      "From time to time, go up to ascetics and brahmins in the realm who avoid intoxication and negligence, are settled in patience and gentleness, and who tame, calm, and extinguish themselves",
      "Ask them what is skillful, what is unskillful, what is blameworthy, what is blameless, what should be cultivated, what should not be cultivated, doing what leads to lasting harm and suffering, and doing what leads to lasting welfare and happiness",
      "Having heard them, reject what is unskillful and undertake and follow what is skillful."
    ],
    "The journey of the wheel-treasure [dn26:5.9.0]": [
      "The wheel-treasure appeared to the king on a fifteenth day sabbath",
      "The king besprinkled the wheel-treasure with a ceremonial vase and it rolled towards the east",
      "The king followed the wheel-treasure with his army of four divisions and stayed wherever it stopped",
      "The opposing rulers of the eastern quarter became his vassals",
      "The wheel-treasure plunged into the southern ocean and emerged again, then rolled towards the west",
      "The opposing rulers of the western quarter became his vassals",
      "The wheel-treasure plunged into the northern ocean and emerged again, then rolled towards the north",
      "The opposing rulers of the northern quarter became his vassals",
      "The wheel-treasure returned to the royal capital and stood still by the gate to the royal compound at the High Court, illuminating the royal compound."
    ],
    "The instructions of the wheel-turning monarch (a causal sequence) [dn26:5.9.0]": [
      "Do not kill living creatures",
      "Do not steal",
      "Do not commit sexual misconduct",
      "Do not lie",
      "Do not drink alcohol",
      "Maintain the current level of taxation."
    ],
    "The establishment of subsequent wheel-turning monarchs [dn26:8.0]": [
      "A wheel-turning monarch was established in exactly the same way",
      "This happened for a second time, and a third, a fourth, a fifth, a sixth, and a seventh time",
      "After many years, the seventh wheel-turning monarch went forth, handing the realm over to the crown prince",
      "Seven days later the heavenly wheel-treasure vanished"
    ],
    "The consequences of not implementing the noble duties of a wheel-turning monarch (a repetitive sentence structure) [dn26:8.0]": [
      "The newly anointed aristocrat king was informed that the heavenly wheel-treasure had vanished",
      "The king governed the country according to his own ideas",
      "The nations did not prosper like before",
      "The ministers and counselors gathered and advised the king to ask about the noble duties of a wheel-turning monarch."
    ],
    "The noble duties of a wheel-turning monarch [dn26:10.0]": [
      "Provide protection and security",
      "Pay money to the penniless in the realm"
    ],
    "The consequences of not paying money to the penniless [dn26:10.0]": [
      "Poverty became widespread",
      "Theft became widespread",
      "Swords became widespread",
      "Killing living creatures became widespread",
      "Lying became widespread",
      "Backbiting became widespread",
      "Sexual misconduct became widespread",
      "Harsh speech and talking nonsense became widespread",
      "Desire and ill will became widespread",
      "Wrong view became widespread",
      "Illicit desire, immoral greed, and wrong thoughts became widespread",
      "Lack of due respect for mother and father, ascetics and brahmins, and failure to honor the elders in the family became widespread"
    ],
    "The decline of lifespan and beauty (a causal chain) [dn26:10.0]": [
      "People who lived for 80,000 years had children who lived for 40,000 years",
      "People who lived for 40,000 years had children who lived for 20,000 years",
      "People who lived for 20,000 years had children who lived for 10,000 years",
      "People who lived for 10,000 years had children who lived for 5,000 years",
      "People who lived for 5,000 years had some children who lived for 2,500 years, while others lived for 2,000 years",
      "People who lived for 2,500 years had children who lived for 1,000 years",
      "People who lived for 1,000 years had children who lived for 500 years",
      "People who lived for 500 years had some children who lived for 250 years, while others lived for 200 years",
      "People who lived for 250 years had children who lived for 100 years."
    ],
    "The following flavors that will disappear [dn26:19.0]": [
      "ghee",
      "butter",
      "oil",
      "honey",
      "molasses",
      "salt"
    ],
    "The ten ways of doing skillful deeds and unskillful deeds [dn26:19.0]": [
      "The ten ways of doing skillful deeds will totally disappear",
      "The ten ways of doing unskillful deeds will explode in popularity"
    ],
    "The people who will not be respected [dn26:19.0]": [
      "anyone who disrespects mother and father",
      "anyone who disrespects ascetics and brahmins",
      "anyone who fails to honor the elders in the family"
    ],
    "The animals that the world will become promiscuous like [dn26:19.0]": [
      "goats and sheep",
      "chickens and pigs",
      "dogs and jackals"
    ],
    "The relationships that will be full of hostility [dn26:19.0]": [
      "mother and child",
      "father and child",
      "brother and sister",
      "sister and brother"
    ],
    "The places where some beings will hide [dn26:19.0]": [
      "thick grass",
      "thick jungle",
      "thick trees",
      "inaccessible riverlands",
      "rugged mountains"
    ],
    "The things that the beings will survive on [dn26:19.0]": [
      "forest roots",
      "fruits"
    ],
    "The skillful things that the beings undertake [dn26:21.10.0]": [
      "refrain from killing living creatures",
      "refrain from stealing",
      "refrain from sexual misconduct",
      "refrain from lying",
      "refrain from backbiting",
      "refrain from harsh speech",
      "refrain from talking nonsense",
      "give up covetousness",
      "give up ill will",
      "give up wrong view",
      "give up illicit desire, immoral greed, and wrong thoughts",
      "pay due respect to mother and father, ascetics and brahmins, honoring the elders in our families"
    ],
    "The lifespan and beauty growth of the beings [dn26:21.10.0]": [
      "Undertaking the skillful thing of refraining from killing living creatures",
      "Lifespan and beauty growth",
      "Children who live for twenty years",
      "Undertaking more skillful things",
      "Lifespan and beauty growth",
      "Children who live for forty years",
      "Children who live for eighty years",
      "Children who live for a hundred and sixty years",
      "Children who live for three hundred and twenty years",
      "Children who live for six hundred and forty years",
      "Children who live for 2,000 years",
      "Children who live for 4,000 years",
      "Children who live for 8,000 years",
      "Children who live for 20,000 years",
      "Children who live for 40,000 years",
      "Children who live for 80,000 years"
    ],
    "The age at which girls will be marriageable (a causal chain) [dn26:21.10.0]": [
      "Among the people who live for 80,000 years, girls will be marriageable at five hundred."
    ],
    "The three afflictions among the people who live for 80,000 years [dn26:23.4.0]": [
      "Greed",
      "Starvation",
      "Old age"
    ],
    "The description of India during the time of King Saṅkha [dn26:23.4.0]": [
      "Villages, towns, and capital cities will be no more than a chicken’s flight apart",
      "The land will be as crowded as hell, just full of people, like a thicket of rushes or reeds",
      "There will be 84,000 cities in India, with the royal capital of Ketumati foremost"
    ],
    "The seven treasures possessed by King Saṅkha [dn26:23.4.0]": [
      "The wheel",
      "The elephant",
      "The horse",
      "The jewel",
      "The woman",
      "The treasurer",
      "The counselor as the seventh treasure"
    ],
    "The achievements of King Saṅkha [dn26:23.4.0]": [
      "His dominion will extend to all four sides",
      "He will achieve stability in the country",
      "He will possess the seven treasures",
      "He will have over a thousand sons who are valiant and heroic",
      "He will crush the armies of his enemies",
      "After conquering this land girt by sea, he will reign by principle, without rod or sword."
    ],
    "The description of the Buddha Metteyya [dn26:25.0]": [
      "Perfected, a fully awakened Buddha",
      "Accomplished in knowledge and conduct",
      "Holy, knower of the world",
      "Supreme guide for those who wish to train",
      "Teacher of gods and humans",
      "Awakened, blessed"
    ],
    "The Dhamma and spiritual practice of the Buddha Metteyya [dn26:25.0]": [
      "He will teach the Dhamma that’s good in the beginning, good in the middle, and good in the end, meaningful and well-phrased",
      "He will reveal a spiritual practice that’s entirely full and pure"
    ],
    "The actions of King Saṅkha [dn26:25.0]": [
      "He will have the sacrificial post that had been built by King Mahāpanāda raised up",
      "After staying there, he will give it away to ascetics and brahmins, paupers, vagrants, travelers, and beggars",
      "Having shaved off his hair and beard and dressed in ocher robes, he will go forth from the lay life to homelessness in the Buddha Metteyya’s presence",
      "Soon after going forth, living withdrawn, diligent, keen, and resolute, he will realize the supreme end of the spiritual path in this very life",
      "He will live having achieved with his own insight the goal for which gentlemen rightly go forth from the lay life to homelessness"
    ],
    "The way a mendicant lives as their own island and refuge [dn26:25.0]": [
      "They meditate by observing an aspect of the body—keen, aware, and mindful, rid of desire and aversion for the world",
      "They meditate observing an aspect of feelings—keen, aware, and mindful, rid of desire and aversion for the world",
      "They meditate observing an aspect of mind—keen, aware, and mindful, rid of desire and aversion for the world",
      "They meditate observing an aspect of principles—keen, aware, and mindful, rid of desire and aversion for the world"
    ],
    "The basis of psychic power for a mendicant [dn26:28.0]": [
      "The basis of psychic power that has immersion due to enthusiasm, and active effort",
      "The basis of psychic power that has immersion due to energy, and active effort",
      "The basis of psychic power that has immersion due to mental development, and active effort",
      "The basis of psychic power that has immersion due to inquiry, and active effort"
    ],
    "The qualities of beauty for a mendicant [dn26:28.0]": [
      "Ethical conduct",
      "Restrained in the monastic code",
      "Conducting themselves well",
      "Seeking alms in suitable places",
      "Seeing danger in the slightest fault",
      "Keeping the rules they’ve undertaken"
    ],
    "The absorptions and happiness for a mendicant [dn26:28.0]": [
      "They enter and remain in the first absorption, which has the rapture and bliss born of seclusion, while placing the mind and keeping it connected",
      "As the placing of the mind and keeping it connected are stilled, they enter and remain in the second absorption",
      "They enter and remain in the third absorption",
      "They enter and remain in the fourth absorption"
    ],
    "The qualities of wealth for a mendicant (a causal sequence) [dn26:28.0]": [
      "Spreading a heart full of love to one direction, and to the second, and to the third, and to the fourth",
      "Spreading a heart full of compassion to one direction, and to the second, and to the third, and to the fourth",
      "Spreading a heart full of rejoicing to one direction, and to the second, and to the third, and to the fourth",
      "Spreading a heart full of equanimity to one direction, and to the second, and to the third, and to the fourth"
    ],
    "The power of a mendicant [dn26:28.0]": [
      "Realizing the undefiled freedom of heart and freedom by wisdom in this very life",
      "Living having realized it with their own insight due to the ending of defilements"
    ]
  }
}