{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn27": {
    "The two types of deeds seen in the four castes [dn27:5.0]": [
      "Some aristocrats kill living creatures, steal, and commit sexual misconduct. They use speech that’s false, divisive, harsh, and nonsensical. And they’re covetous, malicious, with wrong view.",
      "Some aristocrats refrain from killing living creatures, stealing, and committing sexual misconduct. They refrain from speech that’s false, divisive, harsh, and nonsensical. And they’re content, kind-hearted, with right view."
    ],
    "The false claims made by the brahmins (a causal sequence) [dn27:5.0]": [
      "Only brahmins are the first caste; other castes are inferior.",
      "Only brahmins are the light caste; other castes are dark.",
      "Only brahmins are purified, not others.",
      "Only brahmins are Brahmā’s rightful sons, born of his mouth, born of Brahmā, created by Brahmā, heirs of Brahmā."
    ],
    "Terms for the Realized One [dn27:5.0]": [
      "The embodiment of truth",
      "The embodiment of holiness",
      "The one who has become the truth",
      "The one who has become holy"
    ],
    "The meanings of the terms invented for the elected one [dn27:20.0]": [
      "Elected by the people",
      "Lord of the fields",
      "They please others with principle"
    ],
    "The meanings of the terms invented for the circle of brahmins [dn27:22.0]": [
      "They set aside bad, unskillful things",
      "They meditate",
      "Now they don’t meditate"
    ],
    "The four circles [dn27:25.0]": [
      "The Circle of Aristocrats",
      "The Circle of Brahmins",
      "The Circle of Merchants",
      "The Circle of Workers"
    ],
    "Bad conduct [dn27:27.0]": [
      "An aristocrat may do bad things by way of body, speech, and mind",
      "A brahmin may do bad things by way of body, speech, and mind",
      "A merchant may do bad things by way of body, speech, and mind",
      "A worker may do bad things by way of body, speech, and mind",
      "An ascetic may do bad things by way of body, speech, and mind"
    ],
    "Good conduct [dn27:27.0]": [
      "An aristocrat may do good things by way of body, speech, and mind",
      "A brahmin may do good things by way of body, speech, and mind",
      "A merchant may do good things by way of body, speech, and mind",
      "A worker may do good things by way of body, speech, and mind",
      "An ascetic may do good things by way of body, speech, and mind"
    ],
    "The seven qualities that lead to awakening [dn27:30.0]": [
      "Mindfulness",
      "Investigation of principles",
      "Energy",
      "Rapture",
      "Tranquility",
      "Immersion",
      "Equanimity"
    ],
    "The qualities of one accomplished in knowledge and conduct [dn27:30.0]": [
      "Perfected—with defilements ended",
      "Completed the spiritual journey",
      "Done what had to be done",
      "Laid down the burden",
      "Achieved their own true goal",
      "Utterly ended the fetters of rebirth",
      "Rightly freed through enlightenment"
    ],
    "The comparison between the aristocrat and one accomplished in knowledge and conduct [dn27:30.0]": [
      "The aristocrat is first among people who take clan as the standard",
      "One accomplished in knowledge and conduct is first among gods and humans"
    ]
  }
}