{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn28": {
    "The qualities of all the perfected ones, fully awakened Buddhas [dn28:0.3]": [
      "Give up the five hindrances",
      "Corruptions of the heart that weaken wisdom",
      "Their mind is firmly established in the four kinds of mindfulness meditation",
      "They correctly develop the seven awakening factors",
      "They wake up to the supreme perfect awakening"
    ],
    "The stages of Dhamma [dn28:0.3]": [
      "Higher and higher stages",
      "Better and better stages",
      "Dark and bright sides"
    ],
    "Skillful qualities taught by the Buddha [dn28:3.0]": [
      "Four kinds of mindfulness meditation",
      "Four right efforts",
      "Four bases of psychic power",
      "Five faculties",
      "Five powers",
      "Seven awakening factors",
      "Noble eightfold path"
    ],
    "The six interior and exterior sense fields [dn28:4.0]": [
      "The eye and sights",
      "The ear and sounds",
      "The nose and smells",
      "The tongue and tastes",
      "The body and touches",
      "The mind and thoughts"
    ],
    "The four kinds of conception [dn28:5.0]": [
      "Unaware when conceived in their mother’s womb, unaware as they remain there, and unaware as they emerge. This is the first kind of conception.",
      "Aware when conceived in their mother’s womb, but unaware as they remain there, and unaware as they emerge. This is the second kind of conception.",
      "Aware when conceived in their mother’s womb, aware as they remain there, but unaware as they emerge. This is the third kind of conception.",
      "Aware when conceived in their mother’s womb, aware as they remain there, and aware as they emerge. This is the fourth kind of conception."
    ],
    "The four ways of revealing [dn28:6.0]": [
      "Revealing by means of a sign, ‘This is what you’re thinking, such is your thought, and thus is your state of mind.’",
      "Revealing after hearing it from humans or non-humans or deities, ‘This is what you’re thinking, such is your thought, and thus is your state of mind.’",
      "Revealing by hearing the sound of thought spreading as someone thinks and considers, ‘This is what you’re thinking, such is your thought, and thus is your state of mind.’",
      "Comprehending the mind of a person who has attained the immersion that’s free of placing the mind and keeping it connected. They understand, ‘Judging by the way this person’s intentions are directed, immediately after this mind state, they’ll think this thought.’"
    ],
    "The four attainments of vision [dn28:7.0]": [
      "Examining one's own body up from the soles of the feet and down from the tips of the hairs, wrapped in skin and full of many kinds of filth.",
      "Examining a person’s bones with skin, flesh, and blood.",
      "Understanding a person’s stream of consciousness, unbroken on both sides, established in both this world and the next.",
      "Understanding a person’s stream of consciousness, unbroken on both sides, not established in either this world or the next."
    ],
    "The seven individuals [dn28:8.0]": [
      "One freed both ways",
      "One freed by wisdom",
      "A personal witness",
      "One attained to view",
      "One freed by faith",
      "A follower of the teachings",
      "A follower by faith"
    ],
    "The seven awakening factors [dn28:9.0]": [
      "The awakening factor of mindfulness",
      "The awakening factor of investigation of principles",
      "The awakening factor of energy",
      "The awakening factor of rapture",
      "The awakening factor of tranquility",
      "The awakening factor of immersion",
      "The awakening factor of equanimity"
    ],
    "The ways of practice [dn28:10.0]": [
      "Painful practice with slow insight",
      "Painful practice with swift insight",
      "Pleasant practice with slow insight",
      "Pleasant practice with swift insight"
    ],
    "The inferior ways of practice [dn28:10.0]": [
      "The painful practice with slow insight is said to be inferior both ways: because it’s painful and because it’s slow.",
      "The painful practice with swift insight is said to be inferior because it’s painful.",
      "The pleasant practice with slow insight is said to be inferior because it’s slow."
    ],
    "A person’s ethical behavior (a sentence) [dn28:11.0]": [
      "They are honest and faithful.",
      "They don’t use deceit, flattery, hinting, or belittling.",
      "They don’t use material possessions to chase after other material possessions.",
      "They guard the sense doors and eat in moderation.",
      "They’re fair, dedicated to wakefulness, tireless, energetic, and meditative.",
      "They have good memory, eloquence, range, retention, and thoughtfulness.",
      "They’re not greedy for sensual pleasures.",
      "They are mindful and alert."
    ],
    "The different degrees of responsiveness to instruction [dn28:13.0]": [
      "By practicing as instructed this individual will, with the ending of three fetters, become a stream-enterer, not liable to be reborn in the underworld, bound for awakening.",
      "By practicing as instructed this individual will, with the ending of three fetters, and the weakening of greed, hate, and delusion, become a once-returner. They will come back to this world once only, then make an end of suffering.",
      "By practicing as instructed this individual will, with the ending of the five lower fetters, be reborn spontaneously. They will be extinguished there, and are not liable to return from that world.",
      "By practicing as instructed this individual will realize the undefiled freedom of heart and freedom by wisdom in this very life, and live having realized it with their own insight due to the ending of defilements."
    ],
    "The knowledge and freedom of other individuals [dn28:14.0]": [
      "With the ending of three fetters this individual will become a stream-enterer, not liable to be reborn in the underworld, bound for awakening.",
      "With the ending of three fetters, and the weakening of greed, hate, and delusion, this individual will become a once-returner. They will come back to this world once only, then make an end of suffering.",
      "With the ending of the five lower fetters, this individual will be reborn spontaneously. They will be extinguished there, and are not liable to return from that world.",
      "This individual will realize the undefiled freedom of heart and freedom by wisdom in this very life, and live having realized it with their own insight due to the ending of defilements."
    ],
    "The three eternalist doctrines [dn28:15.0]": [
      "The self and the cosmos are eternal, barren, steady as a mountain peak, standing firm like a pillar. They remain the same for all eternity, while these sentient beings wander and transmigrate and pass away and rearise. (Experienced by some ascetic or brahmin who recollects many hundreds of thousands of past lives)",
      "The self and the cosmos are eternal, barren, steady as a mountain peak, standing firm like a pillar. They remain the same for all eternity, while these sentient beings wander and transmigrate and pass away and rearise. (Experienced by some ascetic or brahmin who recollects their past lives for as many as ten eons of the expansion and contraction of the cosmos)",
      "The self and the cosmos are eternal, barren, steady as a mountain peak, standing firm like a pillar. They remain the same for all eternity, while these sentient beings wander and transmigrate and pass away and rearise. (Experienced by some ascetic or brahmin who recollects their past lives for as many as forty eons of the expansion and contraction of the cosmos)"
    ],
    "The many kinds of past lives that can be recollected [dn28:16.0]": [
      "One rebirth",
      "Two rebirths",
      "Three rebirths",
      "Four rebirths",
      "Five rebirths",
      "Ten rebirths",
      "Twenty rebirths",
      "Thirty rebirths",
      "Forty rebirths",
      "Fifty rebirths",
      "A hundred rebirths",
      "A thousand rebirths",
      "A hundred thousand rebirths",
      "Many eons of the world contracting",
      "Many eons of the world expanding",
      "Many eons of the world contracting and expanding"
    ],
    "The types of sentient beings seen passing away and being reborn [dn28:17.0]": [
      "Inferior beings",
      "Superior beings",
      "Beautiful beings",
      "Ugly beings",
      "Beings in a good place",
      "Beings in a bad place"
    ],
    "The psychic powers that are accompanied by defilements and attachments, and are said to be ignoble [dn28:18.0]": [
      "Multiplying themselves and becoming one again",
      "Going unimpeded through a wall, a rampart, or a mountain as if through space",
      "Diving in and out of the earth as if it were water",
      "Walking on water as if it were earth",
      "Flying cross-legged through the sky like a bird",
      "Touching and stroking with the hand the sun and moon",
      "Controlling the body as far as the Brahmā realm"
    ],
    "The psychic powers that are free of defilements and attachments, and are said to be noble [dn28:18.0]": [
      "Meditating perceiving the unrepulsive in the repulsive",
      "Meditating perceiving the repulsive in the unrepulsive",
      "Meditating perceiving the unrepulsive in the repulsive and the unrepulsive",
      "Meditating perceiving the repulsive in the unrepulsive and the repulsive",
      "Meditating staying equanimous, mindful and aware, rejecting both the repulsive and the unrepulsive"
    ],
    "The qualities of the Buddha [dn28:19.0]": [
      "Being energetic and strong",
      "Having human strength, energy, vigor, and exertion",
      "Not indulging in sensual pleasures",
      "Not indulging in self-mortification",
      "Getting the four absorptions"
    ],
    "The questions asked to Reverend Sāriputta [dn28:19.4.0]": [
      "Is there any other ascetic or brahmin—whether past, future, or present—whose direct knowledge is superior to the Buddha when it comes to awakening?",
      "Is there any other ascetic or brahmin—whether past or future—whose direct knowledge is equal to the Buddha when it comes to awakening?",
      "Is there any other ascetic or brahmin at present whose direct knowledge is equal to the Buddha when it comes to awakening?"
    ],
    "The statements made by Reverend Sāriputta [dn28:19.4.0]": [
      "The perfected ones, fully awakened Buddhas of the past and the future are equal to myself when it comes to awakening.",
      "It’s impossible for two perfected ones, fully awakened Buddhas to arise in the same solar system at the same time."
    ],
    "The qualities of the Realized One [dn28:20.0]": [
      "So few wishes",
      "Such contentment",
      "Such self-effacement"
    ],
    "The wanderers following other paths (a repetitive sentence structure) [dn28:20.0]": [
      "If the wanderers following other paths were to see even a single one of these qualities in themselves they’d carry around a banner to that effect."
    ],
    "The instruction given by the Buddha to Venerable Sāriputta (a repetitive sentence structure) [dn28:20.0]": [
      "The Buddha instructs Venerable Sāriputta to frequently speak this exposition of the teaching to the monks, nuns, laymen, and laywomen.",
      "Some foolish people who have doubt or uncertainty regarding the Realized One, when they hear this exposition of the teaching they’ll give up that doubt or uncertainty."
    ]
  }
}