{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn29": {
    "The case where a teacher is not awakened, and the teaching is poorly explained and poorly propounded, not emancipating, not leading to peace, proclaimed by someone who is not a fully awakened Buddha [dn29:4.0]": [
      "A disciple in that teaching does not practice in line with the teachings",
      "Does not practice following that procedure",
      "Does not live in line with the teaching",
      "They proceed having turned away from that teaching"
    ],
    "The case where a teacher is not awakened, and the teaching is poorly explained and poorly propounded, not emancipating, not leading to peace, proclaimed by someone who is not a fully awakened Buddha (a causal chain) [dn29:4.0]": [
      "A disciple in that teaching practices in line with the teachings",
      "Practices following that procedure",
      "Lives in line with the teaching",
      "They proceed having undertaken that teaching"
    ],
    "The case where a teacher is awakened, and the teaching is well explained and well propounded, emancipating, leading to peace, proclaimed by someone who is a fully awakened Buddha [dn29:6.0]": [
      "A disciple in that teaching does not practice in line with the teachings",
      "Does not practice following that procedure",
      "Does not live in line with the teaching",
      "They proceed having turned away from that teaching"
    ],
    "The case where a teacher is awakened, and the teaching is well explained and well propounded, emancipating, leading to peace, proclaimed by someone who is a fully awakened Buddha (a causal chain) [dn29:6.0]": [
      "A disciple in that teaching practices in line with the teachings",
      "Practices following that procedure",
      "Lives in line with the teaching",
      "They proceed having undertaken that teaching"
    ],
    "The case where a teacher arises in the world who is perfected, a fully awakened Buddha [dn29:8.0]": [
      "The teaching is well explained and well propounded, emancipating, leading to peace, proclaimed by someone who is fully awakened",
      "The disciples haven’t inquired about the meaning of that good teaching",
      "The spiritual practice that’s entirely full and pure has not been disclosed and revealed to them with all its collected sayings, with its demonstrable basis, well proclaimed wherever there are gods and humans",
      "Their teacher passes away"
    ],
    "The case where a teacher arises in the world who is perfected, a fully awakened Buddha [dn29:9.0]": [
      "The teaching is well explained and well propounded, emancipating, leading to peace, proclaimed by someone who is fully awakened",
      "The disciples have inquired about the meaning of that good teaching",
      "The spiritual practice that’s entirely full and pure has been disclosed and revealed to them with all its collected sayings, with its demonstrable basis, well proclaimed wherever there are gods and humans",
      "Their teacher passes away"
    ],
    "Incomplete spiritual path [dn29:10.0]": [
      "The teacher is not senior, long standing, long gone forth, advanced in years, and reached the final stage of life",
      "There are no senior monk disciples who are competent, educated, assured, have attained sanctuary, who can rightly explain the true teaching, and who can legitimately and completely refute the doctrines of others that come up, and teach with a demonstrable basis",
      "There are no competent middle monks, junior monks, senior nuns, middle nuns, junior nuns, celibate white-clothed laymen, white-clothed laymen enjoying sensual pleasures, celibate white-clothed laywomen, white-clothed laywomen enjoying sensual pleasures",
      "The spiritual path is not successful and prosperous, extensive, popular, widespread, and well proclaimed wherever there are gods and humans",
      "The spiritual path has not reached the peak of material possessions and fame"
    ],
    "Complete spiritual path (a causal chain) [dn29:10.0]": [
      "The teacher is senior",
      "There are competent senior monks, middle monks, junior monks, senior nuns, middle nuns, junior nuns, celibate laymen, laymen enjoying sensual pleasures, celibate laywomen, laywomen enjoying sensual pleasures",
      "The spiritual path is successful and prosperous, extensive, popular, widespread, and well proclaimed wherever there are gods and humans",
      "The spiritual path has reached the peak of material possessions and fame"
    ],
    "The spiritual path endowed with all good qualities (a causal chain) [dn29:10.0]": [
      "A spiritual path endowed with all good qualities",
      "Complete in all good qualities",
      "Neither too little nor too much",
      "Well explained",
      "Whole",
      "Full",
      "Well propounded"
    ],
    "Things taught from direct knowledge [dn29:17.0]": [
      "The four kinds of mindfulness meditation",
      "The four right efforts",
      "The four bases of psychic power",
      "The five faculties",
      "The five powers",
      "The seven awakening factors",
      "The noble eightfold path"
    ],
    "Steps to take when someone recites the teaching in the Saṅgha (a causal sequence) [dn29:18.0]": [
      "Neither approve nor dismiss them",
      "Ask which phrasing or meaning is more fitting",
      "Without flattering or rebuking, carefully convince them by examining that meaning and that phrasing",
      "Say ‘Good!’ and applaud and cheer that mendicant’s statement, and then say to them, ‘We are fortunate, reverend, so very fortunate to see a venerable such as yourself, so well-versed in the meaning and the phrasing, as one of our spiritual companions!’"
    ],
    "The reasons for allowing requisites [dn29:22.0]": [
      "I do not teach you solely for restraining defilements that affect the present life.",
      "Nor do I teach solely for protecting against defilements that affect lives to come.",
      "I teach both for restraining defilements that affect the present life and protecting against defilements that affect lives to come."
    ],
    "The requisites allowed by the Buddha (a causal sequence) [dn29:22.0]": [
      "Robes that suffice only for the sake of warding off cold and heat; for warding off the touch of flies, mosquitoes, wind, sun, and reptiles; and for covering up the private parts.",
      "Almsfood that suffices only to sustain this body, avoid harm, and support spiritual practice; so that you will put an end to old discomfort and not give rise to new discomfort, and will keep on living blamelessly and at ease.",
      "Lodgings that suffice only for the sake of warding off cold and heat; for warding off the touch of flies, mosquitoes, wind, sun, and reptiles; to shelter from harsh weather and to enjoy retreat.",
      "Medicines and supplies for the sick that suffice only for the sake of warding off the pains of illness and to promote good health."
    ],
    "The four kinds of indulgence in pleasure that are low, crude, ordinary, ignoble, and pointless [dn29:23.0]": [
      "Killing living creatures",
      "Theft",
      "Lying",
      "Amusing oneself with the five kinds of sensual stimulation"
    ],
    "The four kinds of indulgence in pleasure that lead solely to disillusionment, dispassion, cessation, peace, insight, awakening, and extinguishment [dn29:23.0]": [
      "First absorption",
      "Second absorption",
      "Third absorption",
      "Fourth absorption"
    ],
    "The four fruits and benefits of indulgence in pleasure in these four ways [dn29:25.0]": [
      "Becoming a stream-enterer",
      "Becoming a once-returner",
      "Being reborn spontaneously and becoming extinguished there",
      "Realizing the undefiled freedom of heart and freedom by wisdom in this very life"
    ],
    "The nine respects in which a mendicant who is perfected can't transgress [dn29:26.0]": [
      "Deliberately taking the life of a living creature",
      "Taking something with the intention to steal",
      "Having sex",
      "Telling a deliberate lie",
      "Storing up goods for their own enjoyment like they did as a lay person",
      "Making decisions prejudiced by favoritism",
      "Making decisions prejudiced by hostility",
      "Making decisions prejudiced by stupidity",
      "Making decisions prejudiced by cowardice"
    ],
    "The Realized One's knowledge and vision [dn29:27.0]": [
      "Knowledge stemming from memory",
      "Knowledge born of awakening"
    ],
    "The Realized One's replies to questions (a causal sequence) [dn29:27.0]": [
      "If a question about the past is untrue, false, and pointless, the Realized One does not reply.",
      "If a question about the past is true and substantive, but pointless, he does not reply.",
      "If a question about the past is true, substantive, and beneficial, he knows the right time to reply.",
      "The Realized One replies to questions about the future or the present in the same way."
    ],
    "The Realized One's characteristics [dn29:27.0]": [
      "Speech that’s well-timed, true, meaningful, in line with the teaching and training",
      "Understanding of whatever is seen, heard, thought, known, sought, and explored by the mind",
      "Doing as he says, and saying as he does"
    ],
    "The Realized One's titles [dn29:27.0]": [
      "The undefeated",
      "The champion",
      "The universal seer",
      "The wielder of power"
    ],
    "The views about a Realized One after death [dn29:30.0]": [
      "A Realized One exists after death. This is the only truth, other ideas are silly.",
      "A Realized One doesn’t exist after death. This is the only truth, other ideas are silly.",
      "A Realized One both exists and doesn’t exist after death. This is the only truth, other ideas are silly.",
      "A Realized One neither exists nor doesn’t exist after death. This is the only truth, other ideas are silly."
    ],
    "Reasons why the Buddha did not declare the views about a Realized One after death [dn29:30.0]": [
      "It’s not beneficial or relevant to the fundamentals of the spiritual life.",
      "It doesn’t lead to disillusionment, dispassion, cessation, peace, insight, awakening, and extinguishment."
    ],
    "The declared points by the Buddha [dn29:32.0]": [
      "“This is suffering”",
      "“This is the origin of suffering”",
      "“This is the cessation of suffering”",
      "“This is the practice that leads to the cessation of suffering”"
    ],
    "Reasons why the Buddha declared the points [dn29:32.0]": [
      "It’s beneficial and relevant to the fundamentals of the spiritual life.",
      "It leads to disillusionment, dispassion, cessation, peace, insight, awakening, and extinguishment."
    ],
    "The views that some rely on regarding the past [dn29:34.0]": [
      "The self and the cosmos are eternal. This is the only truth, other ideas are silly.",
      "The self and the cosmos are not eternal, or both eternal and not eternal, or neither eternal nor not eternal. The self and the cosmos are made by oneself, or made by another, or made by both oneself and another, or they have arisen by chance, not made by oneself or another. Pleasure and pain are eternal, or not eternal, or both eternal and not eternal, or neither eternal nor not eternal. Pleasure and pain are made by oneself, or made by another, or made by both oneself and another, or they have arisen by chance, not made by oneself or another. This is the only truth, other ideas are silly."
    ],
    "The reasons why the speaker doesn't acknowledge the views [dn29:34.0]": [
      "Because there are beings who have different opinions on this topic.",
      "I don’t see any such expositions that are equal to my own, still less superior.",
      "Rather, I am the one who is superior when it comes to the higher exposition."
    ],
    "The views that some rely on regarding the future [dn29:37.0]": [
      "The self is physical and well after death, or it is non-physical, or both physical and non-physical, or neither physical nor non-physical, or percipient, or non-percipient, or neither percipient nor non-percipient, or the self is annihilated and destroyed when the body breaks up, and doesn’t exist after death. This is the only truth, other ideas are silly."
    ],
    "The reasons why the speaker doesn't acknowledge the views [dn29:37.0]": [
      "Because there are beings who have different opinions on this topic.",
      "I don’t see any such expositions that are equal to my own, still less superior.",
      "Rather, I am the one who is superior when it comes to the higher exposition."
    ],
    "The four kinds of mindfulness meditation (a repetitive sentence structure) [dn29:37.0]": [
      "Meditating by observing an aspect of the body",
      "Meditating by observing an aspect of feelings",
      "Meditating by observing an aspect of mind",
      "Meditating by observing an aspect of principles"
    ],
    "The name of the exposition of the teaching [dn29:37.0]": [
      "The Impressive Discourse"
    ],
    "The Realized One's replies to questions [dn29:27.0]": [
      "If a question about the past is untrue, false, and pointless, the Realized One does not reply.",
      "If a question about the past is true and substantive, but pointless, he does not reply.",
      "If a question about the past is true, substantive, and beneficial, he knows the right time to reply.",
      "The Realized One replies to questions about the future or the present in the same way."
    ]
  }
}