{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn3": {
    "The thirty-two marks of a great man [dn3:1.3.0]": [
      "A great man who possesses these has only two possible destinies, no other.",
      "If he stays at home he becomes a king, a wheel-turning monarch, a just and principled king.",
      "His dominion extends to all four sides, he achieves stability in the country, and he possesses the seven treasures.",
      "He has the following seven treasures: the wheel, the elephant, the horse, the jewel, the woman, the treasurer, and the counselor as the seventh treasure.",
      "He has over a thousand sons who are valiant and heroic, crushing the armies of his enemies.",
      "After conquering this land girt by sea, he reigns by principle, without rod or sword.",
      "But if he goes forth from the lay life to homelessness, he becomes a perfected one, a fully awakened Buddha, who draws back the veil from the world."
    ],
    "The four castes [dn3:1.14.0]": [
      "Aristocrats",
      "Brahmins",
      "Merchants",
      "Workers"
    ],
    "The three castes that serve the brahmins (a structured repetition) [dn3:1.14.0]": [
      "Aristocrats",
      "Merchants",
      "Workers"
    ],
    "The superiority of aristocrats over brahmins [dn3:1.24.0](a causal sequence)( a causal chain)": [
      "The aristocrats are superior and the brahmins inferior, whether comparing women with women or men with men.",
      "Even if an aristocrat is banished from the nation or the city, he would still receive a seat and water from the brahmins, be fed at an offering of food for ancestors, an offering of a dish of milk-rice, a sacrifice, or a feast for guests, and be taught the hymns.",
      "One accomplished in knowledge and conduct is first among gods and humans.",
      "The aristocrats are superior and the brahmins inferior, whether comparing women with women or men with men.",
      "Even if an aristocrat is banished from the nation or the city, he would still receive a seat and water from the brahmins, be fed at an offering of food for ancestors, an offering of a dish of milk-rice, a sacrifice, or a feast for guests, and would not be kept from the women.",
      "One accomplished in knowledge and conduct is first among gods and humans."
    ],
    "The conduct and knowledge of a Realized One [dn3:2.1.0]": [
      "A Realized One arises in the world, perfected, a fully awakened Buddha",
      "Accomplished in knowledge and conduct",
      "Holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed",
      "Realized with his own insight this world—with its gods, Māras and Brahmās, this population with its ascetics and brahmins, gods and humans—and he makes it known to others",
      "Teaches Dhamma that’s good in the beginning, good in the middle, and good in the end, meaningful and well-phrased",
      "Reveals a spiritual practice that’s entirely full and pure"
    ],
    "The conduct of a mendicant (a causal sequence) [dn3:2.1.0]": [
      "Quite secluded from sensual pleasures, secluded from unskillful qualities, they enter and remain in the first absorption",
      "With the placing of the mind and keeping it connected stilled, a mendicant enters and remains in the second absorption",
      "With the fading away of rapture, they enter and remain in the third absorption",
      "Giving up pleasure and pain, and ending former happiness and sadness, they enter and remain in the fourth absorption",
      "Quite secluded from sensual pleasures, secluded from unskillful qualities, they enter and remain in the first absorption",
      "With the placing of the mind and keeping it connected stilled, a mendicant enters and remains in the second absorption",
      "With the fading away of rapture, they enter and remain in the third absorption",
      "Giving up pleasure and pain, and ending former happiness and sadness, they enter and remain in the fourth absorption"
    ],
    "The knowledge of a mendicant (a causal sequence) [dn3:2.1.0]": [
      "When their mind has become immersed in samādhi like this, they extend it and project it toward knowledge and vision",
      "They understand: ‘There is no return to any state of existence.’ This pertains to their knowledge."
    ],
    "The insults hurled by Ambaṭṭha towards the Buddha and his disciples [dn3:1.10.0]": [
      "shavelings",
      "fake ascetics",
      "riffraff",
      "black spawn from the feet of our Kinsman"
    ],
    "The accusations made by Ambaṭṭha against the Sakyans [dn3:1.10.0]": [
      "rude",
      "harsh",
      "touchy",
      "argumentative",
      "riffraff",
      "don’t honor, respect, revere, worship, or venerate brahmins"
    ],
    "The accusations made by Ambaṭṭha against the Sakyans [dn3:1.13.0]": [
      "riffraff",
      "don’t honor, respect, revere, worship, or venerate brahmins"
    ],
    "The four castes according to Ambaṭṭha [dn3:1.14.0]": [
      "Aristocrats",
      "Brahmins",
      "Merchants",
      "Workers"
    ],
    "The four drains that affect this supreme knowledge and conduct [dn3:2.3.0]": [
      "Plunging into a wilderness region carrying their stuff with a shoulder-pole, thinking they will get by eating fallen fruit",
      "Plunging into a wilderness region carrying a spade and basket, thinking they will get by eating tubers and fruit",
      "Setting up a fire chamber in the neighborhood of a village or town and dwelling there serving the sacred flame",
      "Setting up a fire chamber in the central square and dwelling there, thinking: ‘When an ascetic or brahmin comes from the four quarters, I will honor them as best I can.’"
    ],
    "The things to which Pokkharasāti goes for refuge [dn3:2.22.0]": [
      "Master Gotama",
      "The teaching",
      "The mendicant Saṅgha"
    ]
  }
}