{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn30": {
    "The thirty-two marks of a great man [dn30:0.2]": [
      "Well-planted feet",
      "Thousand-spoked wheels on the soles of his feet",
      "Projecting heels",
      "Long fingers",
      "Tender hands and feet",
      "Graceful hands and feet",
      "Arched feet",
      "Calves like those of an antelope",
      "Palms of both hands touch the knees when standing upright",
      "Private parts covered in a foreskin",
      "Gold-colored skin with a golden sheen",
      "Delicate skin that doesn't attract dust and dirt",
      "Hairs grow one per pore",
      "Blue-black hairs that curl clockwise and stand up",
      "Body as straight as Brahmā's",
      "Bulging muscles in seven places",
      "Chest like that of a lion",
      "Gap between the shoulder-blades filled in",
      "Proportional circumference of a banyan tree",
      "Torso cylindrical",
      "Excellent sense of taste",
      "Jaw like that of a lion",
      "Forty even teeth with no gaps and perfectly white",
      "Large tongue",
      "Voice of Brahmā, like a cuckoo's call",
      "Deep blue eyes",
      "Eyelashes like a cow's",
      "Tuft between the eyebrows, soft and white like cotton-wool",
      "Head shaped like a turban",
      "A great man who possesses these has only two possible destinies, no other."
    ],
    "Skillful behaviors [dn30:1.4.0]": [
      "Good conduct by way of body, speech, and mind",
      "Giving and sharing",
      "Taking precepts",
      "Observing the sabbath",
      "Paying due respect to mother and father, ascetics and brahmins",
      "Honoring the elders in the family",
      "Various other things pertaining to skillful behaviors"
    ],
    "The ten respects in which the Realized One surpassed other gods [dn30:1.4.0]": [
      "Divine life span",
      "Beauty",
      "Happiness",
      "Glory",
      "Sovereignty",
      "Sights",
      "Sounds",
      "Smells",
      "Tastes",
      "Touches"
    ],
    "The seven treasures of a wheel-turning monarch [dn30:1.4.0]": [
      "The wheel",
      "The elephant",
      "The horse",
      "The jewel",
      "The woman",
      "The treasurer",
      "The counselor"
    ],
    "The qualities obtained by a Buddha [dn30:1.4.0]": [
      "Cannot be stopped by any foe or enemy whether internal or external",
      "Cannot be stopped by greed, hate, or delusion",
      "Cannot be stopped by any ascetic or brahmin or god or Māra or Brahmā or by anyone in the world."
    ],
    "Deeds performed by the Realized One [dn30:1.7.0]": [
      "Brought happiness to many people",
      "Eliminated threats, terror, and danger",
      "Provided just protection and security",
      "Gave gifts with all the trimmings"
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:1.7.0]": [
      "Has a large following of brahmins and householders, people of town and country, treasury officials, military officers, guardsmen, ministers, counselors, rulers, tax beneficiaries, and princes"
    ],
    "The qualities obtained by a Buddha [dn30:1.7.0]": [
      "Has a large following of monks, nuns, laymen, laywomen, gods, humans, demons, dragons, and fairies."
    ],
    "Deeds performed by the Realized One [dn30:1.10.0]": [
      "Gave up killing living creatures",
      "Renounced the rod and the sword",
      "Was scrupulous and kind",
      "Lived full of compassion for all living beings"
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:1.10.0]": [
      "He’s long-lived, preserving his life for a long time",
      "No human foe or enemy is able to take his life before his time"
    ],
    "The qualities obtained by a Buddha [dn30:1.10.0]": [
      "He’s long-lived, preserving his life for a long time",
      "No foes or enemies—nor any ascetic or brahmin or god or Māra or Brahmā or anyone in the world—is able to take his life before his time"
    ],
    "The three marks obtained by the Realized One [dn30:1.10.0]": [
      "Projecting heels",
      "Long fingers",
      "Body is as straight as Brahmā’s"
    ],
    "Deeds performed by the Realized One [dn30:1.13.0]": [
      "Was a donor of fine and tasty foods and drinks of all kinds, delicious and scrumptious"
    ],
    "The quality obtained by the Realized One [dn30:1.13.0]": [
      "Bulging muscles in seven places - both hands, both feet, both shoulders, and his chest"
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:1.13.0]": [
      "He gets fine and tasty foods and drinks of all kinds, delicious and scrumptious"
    ],
    "The qualities obtained by a Buddha [dn30:1.13.0]": [
      "He gets fine and tasty foods and drinks of all kinds, delicious and scrumptious"
    ],
    "The four ways of being inclusive [dn30:1.16.0]": [
      "Giving",
      "Kindly words",
      "Taking care",
      "Equality"
    ],
    "Deeds performed by the Realized One [dn30:1.16.0]": [
      "Brought people together using the four ways of being inclusive"
    ],
    "The quality obtained by the Realized One [dn30:1.16.0]": [
      "His hands and feet are tender, and they cling gracefully"
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:1.16.0]": [
      "His retinue is inclusive, cohesive, and well-managed",
      "Includes brahmins and householders, people of town and country, treasury officials, military officers, guardsmen, ministers, counselors, rulers, tax beneficiaries, and princes"
    ],
    "The qualities obtained by a Buddha [dn30:1.16.0]": [
      "His retinue is inclusive, cohesive, and well-managed",
      "Includes monks, nuns, laymen, laywomen, gods, humans, demons, dragons, and fairies"
    ],
    "Deeds performed by the Realized One [dn30:1.19.0]": [
      "His speech was meaningful and principled",
      "He educated many people, bringing welfare and happiness, offering the teaching"
    ],
    "The quality obtained by the Realized One [dn30:1.19.0]": [
      "His feet are arched and his hairs stand up"
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:1.19.0]": [
      "He is the foremost, best, chief, highest, and finest of those who enjoy sensual pleasures"
    ],
    "The qualities obtained by a Buddha [dn30:1.19.0]": [
      "He is the foremost, best, chief, highest, and finest of all sentient beings."
    ],
    "Deeds performed by the Realized One [dn30:1.22.0]": [
      "He was a thorough teacher of a profession, a branch of knowledge, conduct, or action",
      "He thought of how they might swiftly learn",
      "He quickly taught so they would not get tired"
    ],
    "The quality obtained by the Realized One [dn30:1.22.0]": [
      "His calves are like those of an antelope"
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:1.22.0]": [
      "He quickly obtains the things worthy of a king, the factors, supports, and things befitting a king"
    ],
    "The qualities obtained by a Buddha [dn30:1.22.0]": [
      "He quickly obtains the things worthy of an ascetic, the factors, supports, and things befitting an ascetic."
    ],
    "Questions asked by the Realized One [dn30:1.25.0]": [
      "What is skillful?",
      "What is unskillful?",
      "What is blameworthy?",
      "What is blameless?",
      "What should be cultivated?",
      "What should not be cultivated?",
      "Doing what leads to my lasting harm and suffering?",
      "Doing what leads to my lasting welfare and happiness?"
    ],
    "The quality obtained by the Realized One [dn30:1.25.0]": [
      "He has delicate skin, so delicate that dust and dirt don’t stick to his body."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:1.25.0]": [
      "He has great wisdom.",
      "Of those who enjoy sensual pleasures, none is his equal or better in wisdom."
    ],
    "The qualities obtained by a Buddha [dn30:1.25.0]": [
      "He has great wisdom.",
      "Widespread wisdom.",
      "Laughing wisdom.",
      "Swift wisdom.",
      "Sharp wisdom.",
      "Penetrating wisdom.",
      "No sentient being is his equal or better in wisdom."
    ],
    "Deeds performed by the Realized One [dn30:1.28.0]": [
      "He wasn’t irritable or bad-tempered.",
      "Even when heavily criticized he didn’t lose his temper, become annoyed, hostile, and hard-hearted, or display annoyance, hate, and bitterness.",
      "He donated soft and fine mats and blankets, and fine cloths of linen, cotton, silk, and wool."
    ],
    "The quality obtained by the Realized One [dn30:1.28.0]": [
      "He is gold colored; his skin has a golden sheen."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:1.28.0]": [
      "He obtains soft and fine mats and blankets, and fine cloths of linen, cotton, silk, and wool."
    ],
    "The qualities obtained by a Buddha [dn30:1.28.0]": [
      "He obtains soft and fine mats and blankets, and fine cloths of linen, cotton, silk, and wool."
    ],
    "Deeds performed by the Realized One [dn30:1.31.0]": [
      "He reunited long-lost and long-separated relatives, friends, loved ones, and companions.",
      "He reunited mother with child and child with mother; father with child and child with father; brother with brother, brother with sister, sister with brother, and sister with sister, bringing them together with rejoicing."
    ],
    "The quality obtained by the Realized One [dn30:1.31.0]": [
      "His private parts are covered in a foreskin."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:1.31.0]": [
      "He has many sons, over a thousand sons who are valiant and heroic, crushing the armies of his enemies."
    ],
    "The qualities obtained by a Buddha [dn30:1.31.0]": [
      "He has many sons, many thousands of sons who are valiant and heroic, crushing the armies of his enemies."
    ],
    "Deeds performed by the Realized One [dn30:2.1.0]": [
      "He regarded the gathered population equally.",
      "He knew what they had in common and what was their own.",
      "He knew each person, and he knew the distinctions between people.",
      "In each case, he made appropriate distinctions between people: ‘This one deserves that; that one deserves this.’"
    ],
    "The qualities obtained by the Realized One [dn30:2.1.0]": [
      "He has the proportional circumference of a banyan tree.",
      "When standing upright and not bending over, the palms of both hands touch the knees."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:2.1.0]": [
      "He is rich, affluent, and wealthy, with lots of gold and silver, lots of property and assets, lots of money and grain, and a full treasury and storehouses."
    ],
    "The qualities obtained by a Buddha [dn30:2.1.0]": [
      "He is rich, affluent, and wealthy.",
      "He has these kinds of wealth: the wealth of faith, ethical conduct, conscience, prudence, learning, generosity, and wisdom."
    ],
    "Deeds performed by the Realized One [dn30:2.4.0]": [
      "He desired the good, the welfare, the comfort, and sanctuary of the people.",
      "He thought: ‘How might they flourish in faith, ethics, learning, generosity, teachings, and wisdom; in wealth and grain, fields and land, birds and beasts, children and partners; in bondservants, workers, and staff; in family, friends, and kin?’",
      "Due to performing those deeds he was reborn in a heavenly realm."
    ],
    "The qualities obtained by the Realized One [dn30:2.4.0]": [
      "His chest is like that of a lion.",
      "The gap between the shoulder-blades is filled in.",
      "His torso is cylindrical."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:2.4.0]": [
      "He’s not liable to decline.",
      "He doesn’t decline in wealth and grain, fields and land, birds and beasts, children and partners; in bondservants, workers, and staff; in family, friends, and kin.",
      "He doesn’t decline in any of his accomplishments."
    ],
    "The qualities obtained by a Buddha [dn30:2.4.0]": [
      "He’s not liable to decline.",
      "He doesn’t decline in faith, ethics, learning, generosity, and wisdom.",
      "He doesn’t decline in any of his accomplishments."
    ],
    "Deeds performed by the Realized One [dn30:2.7.0]": [
      "He would never hurt any sentient being with fists, stones, rods, or swords.",
      "Due to performing those deeds he was reborn in a heavenly realm."
    ],
    "The quality obtained by the Realized One [dn30:2.7.0]": [
      "He has an excellent sense of taste.",
      "Taste-buds are produced in the throat for the tongue-tip and dispersed evenly."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:2.7.0]": [
      "He is rarely ill or unwell.",
      "His stomach digests well, being neither too hot nor too cold."
    ],
    "The qualities obtained by a Buddha [dn30:2.7.0]": [
      "He is rarely ill or unwell.",
      "His stomach digests well, being neither too hot nor too cold, but just right, and fit for meditation."
    ],
    "Deeds performed by the Realized One [dn30:2.10.0]": [
      "When looking at others he didn’t glare, look askance, or avert his eyes.",
      "Being straightforward, he reached out to others with straightforward intentions, looking at people with kindly eyes.",
      "Due to performing those deeds he was reborn in a heavenly realm."
    ],
    "The qualities obtained by the Realized One [dn30:2.10.0]": [
      "His eyes are deep blue.",
      "He has eyelashes like a cow’s."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:2.10.0]": [
      "The people look on him with kindly eyes.",
      "He is dear and beloved to the brahmins and householders, people of town and country, treasury officials, military officers, guardsmen, ministers, counselors, rulers, tax beneficiaries, and princes."
    ],
    "The qualities obtained by a Buddha [dn30:2.10.0]": [
      "The people look on him with kindly eyes.",
      "He is dear and beloved to the monks, nuns, laymen, laywomen, gods, humans, demons, dragons, and fairies."
    ],
    "Skillful behaviors performed by the Realized One [dn30:2.13.0]": [
      "Good conduct by way of body, speech, and mind.",
      "Giving and sharing.",
      "Taking precepts.",
      "Observing the sabbath.",
      "Paying due respect to mother and father, ascetics and brahmins.",
      "Honoring the elders in the family.",
      "Various other things pertaining to skillful behaviors."
    ],
    "The quality obtained by the Realized One [dn30:2.13.0]": [
      "His head is shaped like a turban."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:2.13.0]": [
      "He has a large following of brahmins and householders, people of town and country, treasury officials, military officers, guardsmen, ministers, counselors, rulers, tax beneficiaries, and princes."
    ],
    "The qualities obtained by a Buddha [dn30:2.13.0]": [
      "He has a large following of monks, nuns, laymen, laywomen, gods, humans, demons, dragons, and fairies."
    ],
    "Deeds performed by the Realized One [dn30:2.16.0]": [
      "He refrained from lying.",
      "He spoke the truth and stuck to the truth.",
      "He was honest and trustworthy.",
      "He didn’t trick the world with his words."
    ],
    "The qualities obtained by the Realized One [dn30:2.16.0]": [
      "His hairs grow one per pore.",
      "Between his eyebrows, there grows a tuft, soft and white like cotton-wool."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:2.16.0]": [
      "He has many close adherents among the brahmins and householders, people of town and country, treasury officials, military officers, guardsmen, ministers, counselors, rulers, tax beneficiaries, and princes."
    ],
    "The qualities obtained by a Buddha [dn30:2.16.0]": [
      "He has many close adherents among the monks, nuns, laymen, laywomen, gods, humans, demons, dragons, and fairies."
    ],
    "Deeds performed by the Realized One [dn30:2.19.0]": [
      "He refrained from divisive speech.",
      "He didn’t repeat in one place what he heard in another so as to divide people against each other.",
      "He reconciled those who were divided.",
      "He supported unity.",
      "He delighted in harmony.",
      "He loved harmony.",
      "He spoke words that promote harmony."
    ],
    "The qualities obtained by the Realized One [dn30:2.19.0]": [
      "He has forty teeth.",
      "His teeth have no gaps."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:2.19.0]": [
      "His retinue cannot be divided.",
      "This includes brahmins and householders, people of town and country, treasury officials, military officers, guardsmen, ministers, counselors, rulers, tax beneficiaries, and princes."
    ],
    "The qualities obtained by a Buddha [dn30:2.19.0]": [
      "His retinue cannot be divided.",
      "This includes monks, nuns, laymen, laywomen, gods, humans, demons, dragons, and fairies."
    ],
    "Deeds performed by the Realized One [dn30:2.22.0]": [
      "He refrained from harsh speech.",
      "He spoke in a way that’s mellow, pleasing to the ear, lovely, going to the heart, polite, likable and agreeable to the people."
    ],
    "The qualities obtained by the Realized One [dn30:2.22.0]": [
      "He has a large tongue.",
      "The voice of Brahmā, like a cuckoo’s call."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:2.22.0]": [
      "He has a persuasive voice.",
      "His words are persuasive to brahmins and householders, people of town and country, treasury officials, military officers, guardsmen, ministers, counselors, rulers, tax beneficiaries, and princes."
    ],
    "The qualities obtained by a Buddha [dn30:2.22.0]": [
      "He has a persuasive voice.",
      "His words are persuasive to monks, nuns, laymen, laywomen, gods, humans, demons, dragons, and fairies."
    ],
    "Deeds performed by the Realized One [dn30:2.25.0]": [
      "He refrained from talking nonsense.",
      "His words were timely, true, and meaningful, in line with the teaching and training.",
      "He said things at the right time which were valuable, reasonable, succinct, and beneficial."
    ],
    "The quality obtained by the Realized One [dn30:2.25.0]": [
      "His jaw is like that of a lion."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:2.25.0]": [
      "He can’t be destroyed by any human foe or enemy."
    ],
    "The qualities obtained by a Buddha [dn30:2.25.0]": [
      "He can’t be destroyed by any foe or enemy whether internal or external; nor by greed, hate, or delusion; nor by any ascetic or brahmin or god or Māra or Brahmā or by anyone in the world."
    ],
    "Deeds performed by the Realized One [dn30:2.28.0]": [
      "He gave up wrong livelihood and earned a living by right livelihood.",
      "He refrained from falsifying weights, metals, or measures; bribery, fraud, cheating, and duplicity; mutilation, murder, abduction, banditry, plunder, and violence."
    ],
    "The qualities obtained by the Realized One [dn30:2.28.0]": [
      "His teeth are even and perfectly white."
    ],
    "The qualities obtained by a wheel-turning monarch [dn30:2.28.0]": [
      "His dominion extends to all four sides.",
      "He achieves stability in the country.",
      "He possesses the seven treasures: the wheel, the elephant, the horse, the jewel, the woman, the treasurer, and the counselor as the seventh treasure.",
      "He has over a thousand sons who are valiant and heroic, crushing the armies of his enemies.",
      "His retinue is pure. This includes brahmins and householders, people of town and country, treasury officials, military officers, guardsmen, ministers, counselors, rulers, tax beneficiaries, and princes."
    ],
    "The qualities obtained by a Buddha [dn30:2.28.0]": [
      "His retinue is pure. This includes monks, nuns, laymen, laywomen, gods, humans, demons, dragons, and fairies."
    ]
  }
}