{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn33": {
    "Preparations made by the Mallas of Pāvā [dn33:0.2]": [
      "Spread carpets all over",
      "Prepared seats",
      "Set up a water jar",
      "Placed a lamp"
    ],
    "The seating arrangement in the new town hall [dn33:0.2]": [
      "The Buddha sat against the central column facing east",
      "The Saṅgha of mendicants sat against the west wall facing east",
      "The Mallas of Pāvā sat against the east wall facing west"
    ],
    "The arguments and disputes among the Jain ascetics [dn33:0.2]": [
      "The Nigaṇṭha Nātaputta passed away at Pāvā",
      "The Jain ascetics split into two factions",
      "They argued, quarreled, and disputed",
      "They wounded each other with barbed words",
      "The Nigaṇṭha Nātaputta's white-clothed lay disciples were disillusioned, dismayed, and disappointed in the Jain ascetics"
    ],
    "The qualities of the Buddha's teaching and training (a causal sequence) [dn33:0.2]": [
      "Well explained",
      "Well propounded",
      "Emancipating",
      "Leading to peace",
      "Proclaimed by someone who is a fully awakened Buddha"
    ],
    "The benefits of reciting the Buddha's teaching in concert [dn33:0.2]": [
      "The spiritual path may last for a long time",
      "For the welfare and happiness of the people",
      "For the benefit, welfare, and happiness of gods and humans"
    ],
    "Teachings grouped by one [dn33:1.7.9.0]": [
      "‘All sentient beings are sustained by food.’",
      "‘All sentient beings are sustained by conditions.’"
    ],
    "Teachings grouped by two [dn33:1.9.0]": [
      "Name and form",
      "Ignorance and craving for continued existence",
      "Views favoring continued existence and views favoring ending existence",
      "Lack of conscience and prudence",
      "Conscience and prudence",
      "Being hard to admonish and having bad friends",
      "Being easy to admonish and having good friends",
      "Skill in offenses and skill in rehabilitation from offenses",
      "Skill in meditative attainments and skill in emerging from those attainments",
      "Skill in the elements and skill in attention",
      "Skill in the sense fields and skill in dependent origination",
      "Skill in what is possible and skill in what is impossible",
      "Integrity and scrupulousness",
      "Patience and gentleness",
      "Friendliness and hospitality",
      "Harmlessness and purity",
      "Lack of mindfulness and lack of situational awareness",
      "Mindfulness and situational awareness",
      "Not guarding the sense doors and eating too much",
      "Guarding the sense doors and moderation in eating",
      "The power of reflection and the power of development",
      "The power of mindfulness and the power of immersion",
      "Serenity and discernment",
      "The foundation of serenity and the foundation of exertion",
      "Exertion, and not being distracted",
      "Failure in ethics and failure in view",
      "Accomplishment in ethics and accomplishment in view",
      "Purification of ethics and purification of view",
      "Purification of view and making an effort in line with that view",
      "Inspiration, and making a suitable effort when inspired by inspiring places",
      "To never be content with skillful qualities, and to never stop trying",
      "Knowledge and freedom",
      "Knowledge of ending and knowledge of non-arising"
    ],
    "Teachings grouped by three that have been rightly explained by the Buddha [dn33:1.10.0]": [
      "Three unskillful roots: greed, hate, and delusion.",
      "Three skillful roots: non-greed, non-hate, and non-delusion.",
      "Three ways of performing bad conduct: by body, speech, and mind.",
      "Three ways of performing good conduct: by body, speech, and mind.",
      "Three unskillful thoughts: sensuality, malice, and cruelty.",
      "Three skillful thoughts: renunciation, good will, and harmlessness.",
      "Three unskillful intentions: sensuality, malice, and cruelty.",
      "Three skillful intentions: renunciation, good will, and harmlessness.",
      "Three unskillful perceptions: sensuality, malice, and cruelty.",
      "Three skillful perceptions: renunciation, good will, and harmlessness.",
      "Three unskillful elements: sensuality, malice, and cruelty.",
      "Three skillful elements: renunciation, good will, and harmlessness.",
      "Another three elements: sensuality, form, and formlessness.",
      "Another three elements: form, formlessness, and cessation.",
      "Another three elements: lower, middle, and higher.",
      "Three cravings: for sensual pleasures, to continue existence, and to end existence.",
      "Another three cravings: sensuality, form, and formlessness.",
      "Another three cravings: form, formlessness, and cessation.",
      "Three fetters: identity view, doubt, and misapprehension of precepts and observances.",
      "Three defilements: sensuality, desire for continued existence, and ignorance.",
      "Three realms of existence: sensual, form, and formless.",
      "Three searches: for sensual pleasures, for continued existence, and for a spiritual path.",
      "Three kinds of discrimination: ‘I’m better’, ‘I’m equal’, and ‘I’m worse’.",
      "Three periods: past, future, and present.",
      "Three extremes: identity, the origin of identity, and the cessation of identity.",
      "Three feelings: pleasure, pain, and neutral.",
      "Three forms of suffering: the suffering inherent in painful feeling, the suffering inherent in conditions, and the suffering inherent in perishing.",
      "Three heaps: inevitability regarding the wrong way, inevitability regarding the right way, and lack of inevitability.",
      "Three darknesses: one is doubtful, uncertain, undecided, and lacking confidence about the past, future, and present.",
      "Three things a Realized One need not hide: behavior by way of body, speech, and mind.",
      "Three possessions: greed, hate, and delusion.",
      "Three fires: greed, hate, and delusion.",
      "Another three fires: a fire for those worthy of offerings dedicated to the gods, a fire for householders, and a fire for those worthy of a religious donation.",
      "A threefold classification of the physical: visible and resistant, invisible and resistant, and invisible and non-resistant.",
      "Three choices: good choices, bad choices, and imperturbable choices.",
      "Three individuals: a trainee, an adept, and one who is neither a trainee nor an adept.",
      "Three seniors: a senior by birth, a senior in the teaching, and a senior by convention.",
      "Three grounds for making merit: giving, ethical conduct, and meditation.",
      "Three grounds for accusations: what is seen, heard, and suspected.",
      "Three kinds of sensual rebirth: present, creating, and created by others.",
      "Three kinds of pleasant rebirth: dwelling in pleasure, drenched with pleasure and inspired, drenched with pleasure and content.",
      "Three kinds of wisdom: trainee, adept, and neither trainee nor adept.",
      "Another three kinds of wisdom: produced by thought, learning, and meditation.",
      "Three weapons: learning, seclusion, and wisdom.",
      "Three faculties: understanding that one’s enlightenment is imminent, enlightenment, and one who is enlightened.",
      "Three eyes: the eye of the flesh, the eye of clairvoyance, and the eye of wisdom.",
      "Three trainings: in higher ethics, higher mind, and higher wisdom.",
      "Three kinds of development: physical endurance, the mind, and wisdom.",
      "Three unsurpassable things: seeing, practice, and freedom.",
      "Three kinds of immersion: with placing the mind and keeping it connected, without placing the mind but keeping it connected, without placing the mind or keeping it connected.",
      "Another three kinds of immersion: emptiness, signless, and undirected.",
      "Three purities: purity of body, speech, and mind.",
      "Three kinds of sagacity: sagacity of body, speech, and mind.",
      "Three skills: progress, regress, and means.",
      "Three vanities: health, youth, and life.",
      "Three ways of putting something in charge: oneself, the world, or the teaching.",
      "Three topics of discussion: past, future, and present.",
      "Three knowledges: recollection of past lives, knowledge of the death and rebirth of sentient beings, and knowledge of the ending of defilements.",
      "Three meditative abidings: the meditation of the gods, the meditation of Brahmā, and the meditation of the noble ones.",
      "Three demonstrations: psychic power, revealing, and instructional."
    ],
    "Four things to be realized [dn33:1.11.0]": [
      "Past lives",
      "Passing away and rebirth of sentient beings",
      "Eight liberations",
      "Ending of defilements"
    ],
    "Four floods [dn33:1.11.0]": [
      "Sensuality",
      "Desire for rebirth",
      "Views",
      "Ignorance"
    ],
    "Four bonds [dn33:1.11.0]": [
      "Sensuality",
      "Desire for rebirth",
      "Views",
      "Ignorance"
    ],
    "Four detachments [dn33:1.11.0]": [
      "Detachment from the bonds of sensuality",
      "Detachment from the bonds of desire for rebirth",
      "Detachment from the bonds of views",
      "Detachment from the bonds of ignorance"
    ],
    "Four ties [dn33:1.11.0]": [
      "Personal ties to covetousness",
      "Personal ties to ill will",
      "Personal ties to misapprehension of precepts and observances",
      "Personal ties to the insistence that this is the only truth"
    ],
    "Four kinds of grasping [dn33:1.11.0]": [
      "Grasping at sensual pleasures",
      "Grasping at views",
      "Grasping at precepts and observances",
      "Grasping at theories of a self"
    ],
    "Four kinds of reproduction [dn33:1.11.0]": [
      "Reproduction for creatures born from an egg",
      "Reproduction for creatures born from a womb",
      "Reproduction for creatures born from moisture",
      "Reproduction for creatures born spontaneously"
    ],
    "Four kinds of conception [dn33:1.11.0]": [
      "Unaware when conceived in their mother’s womb",
      "Aware when conceived in their mother’s womb, but unaware as they remain there",
      "Aware when conceived in their mother’s womb, aware as they remain there, but unaware as they emerge",
      "Aware when conceived in their mother’s womb, aware as they remain there, and aware as they emerge"
    ],
    "Four kinds of reincarnation [dn33:1.11.0]": [
      "Reincarnation where only one’s own intention is effective, not that of others",
      "Reincarnation where only the intention of others is effective, not one’s own",
      "Reincarnation where both one’s own and others’ intentions are effective",
      "Reincarnation where neither one’s own nor others’ intentions are effective"
    ],
    "Four ways of purifying a religious donation [dn33:1.11.0]": [
      "Religious donation that’s purified by the giver, not the recipient",
      "Religious donation that’s purified by the recipient, not the giver",
      "Religious donation that’s purified by neither the giver nor the recipient",
      "Religious donation that’s purified by both the giver and the recipient"
    ],
    "Four ways of being inclusive [dn33:1.11.0]": [
      "Giving",
      "Kindly words",
      "Taking care",
      "Equality"
    ],
    "Four ignoble expressions [dn33:1.11.0]": [
      "Speech that’s false",
      "Speech that’s divisive",
      "Speech that’s harsh",
      "Speech that’s nonsensical"
    ],
    "Four noble expressions [dn33:1.11.0]": [
      "Refraining from speech that’s false",
      "Refraining from speech that’s divisive",
      "Refraining from speech that’s harsh",
      "Refraining from speech that’s nonsensical"
    ],
    "Another four ignoble expressions [dn33:1.11.0]": [
      "Saying you’ve seen something, but you haven’t",
      "Saying you’ve heard something, but you haven’t",
      "Saying you’ve thought something, but you haven’t",
      "Saying you’ve known something, but you haven’t",
      "Saying you haven’t seen something, and you have",
      "Saying you haven’t heard something, and you have",
      "Saying you haven’t thought something, and you have",
      "Saying you haven’t known something, and you have"
    ],
    "Another four noble expressions [dn33:1.11.0]": [
      "Saying you haven’t seen something, and you haven’t",
      "Saying you haven’t heard something, and you haven’t",
      "Saying you haven’t thought something, and you haven’t",
      "Saying you haven’t known something, and you haven’t",
      "Saying you’ve seen something, and you have",
      "Saying you’ve heard something, and you have",
      "Saying you’ve thought something, and you have",
      "Saying you’ve known something, and you have"
    ],
    "Four persons [dn33:1.11.0]": [
      "Person who mortifies themselves",
      "Person who mortifies others",
      "Person who mortifies themselves and others",
      "Person who doesn’t mortify either themselves or others"
    ],
    "Another four persons [dn33:1.11.0]": [
      "Person who practices to benefit themselves, but not others",
      "Person who practices to benefit others, but not themselves",
      "Person who practices to benefit neither themselves nor others",
      "Person who practices to benefit both themselves and others",
      "The dark bound for darkness",
      "The dark bound for light",
      "The light bound for darkness",
      "The light bound for light",
      "The confirmed ascetic",
      "The white lotus ascetic",
      "The pink lotus ascetic",
      "The exquisite ascetic of ascetics"
    ],
    "The teachings grouped by four that have been rightly explained by the Buddha [dn33:1.11.0]": [
      "Four things to be realized",
      "Four floods",
      "Four bonds",
      "Four detachments",
      "Four ties",
      "Four kinds of grasping",
      "Four kinds of reproduction",
      "Four kinds of conception",
      "Four kinds of reincarnation",
      "Four ways of purifying a religious donation",
      "Four ways of being inclusive",
      "Four ignoble expressions",
      "Four noble expressions",
      "Another four ignoble expressions",
      "Another four noble expressions",
      "Another four ignoble expressions",
      "Another four noble expressions",
      "Four persons",
      "Another four persons",
      "Another four persons"
    ],
    "Six interior sense fields, Six exterior sense fields, Six classes of consciousness, Six classes of contact, Six classes of feeling, Six classes of perception, Six bodies of intention, Six classes of craving, Six kinds of disrespect, Six kinds of respect, Six preoccupations with happiness, Six preoccupations with sadness, Six preoccupations with equanimity, Six warm-hearted qualities, Six roots of arguments, Six elements, Six elements of escape, Six unsurpassable things, Six topics for recollection, Six consistent responses, Six classes of rebirth, Six perceptions that help penetration [dn33:2.2.0]": [
      "Six interior sense fields: eye, ear, nose, tongue, body, and mind.",
      "Six exterior sense fields: sights, sounds, smells, tastes, touches, and thoughts.",
      "Six classes of consciousness: eye, ear, nose, tongue, body, and mind consciousness.",
      "Six classes of contact: contact through the eye, ear, nose, tongue, body, and mind.",
      "Six classes of feeling: feeling born of contact through the eye, ear, nose, tongue, body, and mind.",
      "Six classes of perception: perceptions of sights, sounds, smells, tastes, touches, and thoughts.",
      "Six bodies of intention: intention regarding sights, sounds, smells, tastes, touches, and thoughts.",
      "Six classes of craving: craving for sights, sounds, smells, tastes, touches, and thoughts.",
      "Six kinds of disrespect: lack of respect and reverence for the Teacher, the teaching, and the Saṅgha, the training, diligence, and hospitality.",
      "Six kinds of respect: respect and reverence for the Teacher, the teaching, and the Saṅgha, the training, diligence, and hospitality.",
      "Six preoccupations with happiness: preoccupation with a sight, sound, smell, taste, touch, or thought that’s a basis for happiness.",
      "Six preoccupations with sadness: preoccupation with a sight, sound, smell, taste, touch, or thought that’s a basis for sadness.",
      "Six preoccupations with equanimity: preoccupation with a sight, sound, smell, taste, touch, or thought that’s a basis for equanimity.",
      "Six warm-hearted qualities: bodily kindness, verbal kindness, mental kindness, sharing possessions, living according to precepts, living according to the noble view.",
      "Six roots of arguments: irritable and hostile, offensive and contemptuous, jealous and stingy, devious and deceitful, wicked desires and wrong view, attached to one's own views.",
      "Six elements: earth, water, fire, air, space, and consciousness.",
      "Six elements of escape: heart’s release by love, heart’s release by compassion, heart’s release by rejoicing, heart’s release by equanimity, signless release of the heart, uprooting of the conceit “I am”.",
      "Six unsurpassable things: seeing, listening, acquisition, training, service, and recollection.",
      "Six topics for recollection: Buddha, teaching, Saṅgha, ethics, generosity, and deities.",
      "Six consistent responses: remaining equanimous, mindful and aware when seeing, hearing, smelling, tasting, feeling, or knowing.",
      "Six classes of rebirth: dark class giving rise to a dark result, dark class giving rise to a bright result, dark class giving rise to extinguishment, bright class giving rise to a bright result, bright class giving rise to a dark result, bright class giving rise to extinguishment.",
      "Six perceptions that help penetration: impermanence, suffering in impermanence, not-self in suffering, giving up, fading away, and cessation."
    ],
    "Teachings grouped by seven [dn33:2.3.0]": [
      "Seven kinds of noble wealth",
      "Seven awakening factors",
      "Seven prerequisites for immersion",
      "Seven bad qualities",
      "Seven good qualities",
      "Seven aspects of the teachings of the good persons",
      "Seven qualifications for graduation",
      "Seven perceptions",
      "Seven powers",
      "Seven planes of consciousness",
      "Seven persons worthy of a religious donation",
      "Seven underlying tendencies",
      "Seven fetters",
      "Seven principles for the settlement of any disciplinary issues that might arise"
    ],
    "Planes of consciousness [dn33:2.3.0]": [
      "First plane of consciousness",
      "Second plane of consciousness",
      "Third plane of consciousness",
      "Fourth plane of consciousness",
      "Fifth plane of consciousness",
      "Sixth plane of consciousness",
      "Seventh plane of consciousness"
    ],
    "Eight liberations [dn33:3.1.0]": [
      "Having physical form, they see visions. This is the first liberation.",
      "Not perceiving physical form internally, they see visions externally. This is the second liberation.",
      "They’re focused only on beauty. This is the third liberation.",
      "Going totally beyond perceptions of form, with the ending of perceptions of impingement, not focusing on perceptions of diversity, aware that ‘space is infinite’, they enter and remain in the dimension of infinite space. This is the fourth liberation.",
      "Going totally beyond the dimension of infinite space, aware that ‘consciousness is infinite’, they enter and remain in the dimension of infinite consciousness. This is the fifth liberation.",
      "Going totally beyond the dimension of infinite consciousness, aware that ‘there is nothing at all’, they enter and remain in the dimension of nothingness. This is the sixth liberation.",
      "Going totally beyond the dimension of nothingness, they enter and remain in the dimension of neither perception nor non-perception. This is the seventh liberation.",
      "Going totally beyond the dimension of neither perception nor non-perception, they enter and remain in the cessation of perception and feeling. This is the eighth liberation."
    ],
    "The eighth dimension of mastery [dn33:3.1.0]": [
      "They’re like the morning star that’s white, with white color, white hue, and white tint.",
      "Or a cloth from Bāraṇasī that’s smoothed on both sides, white, with white color, white hue, and white tint.",
      "Mastering them, they perceive: ‘I know and see.’",
      "This is the eighth dimension of mastery."
    ],
    "Nine grounds for resentment [dn33:3.2.0]": [
      "They did wrong to me",
      "They are doing wrong to me",
      "They will do wrong to me",
      "They did wrong by someone I love",
      "They are doing wrong by someone I love",
      "They will do wrong by someone I love",
      "They helped someone I dislike",
      "They are helping someone I dislike",
      "They will help someone I dislike"
    ],
    "Nine methods to get rid of resentment [dn33:3.2.0]": [
      "They did wrong to me, but what can I possibly do?",
      "They are doing wrong to me, but what can I possibly do?",
      "They will do wrong to me, but what can I possibly do?",
      "They did wrong by someone I love, but what can I possibly do?",
      "They are doing wrong by someone I love, but what can I possibly do?",
      "They will do wrong by someone I love, but what can I possibly do?",
      "They helped someone I dislike, but what can I possibly do?",
      "They are helping someone I dislike, but what can I possibly do?",
      "They will help someone I dislike, but what can I possibly do?"
    ],
    "Nine abodes of sentient beings [dn33:3.2.0]": [
      "Human beings, some gods, and some beings in the underworld",
      "The gods reborn in Brahmā’s Host through the first absorption",
      "The gods of streaming radiance",
      "The gods replete with glory",
      "The gods who are non-percipient beings",
      "The dimension of infinite space",
      "The dimension of infinite consciousness",
      "The dimension of nothingness",
      "The dimension of neither perception nor non-perception"
    ],
    "Nine lost opportunities for spiritual practice [dn33:3.2.0]": [
      "Reborn in hell",
      "Reborn in the animal realm",
      "Reborn in the ghost realm",
      "Reborn among the demons",
      "Reborn in one of the long-lived orders of gods",
      "Reborn in the borderlands, among strange barbarian tribes",
      "Reborn in a central country with wrong view and distorted perspective",
      "Reborn in a central country with inability to distinguish what is well said from what is poorly said",
      "Reborn in a central country where a Realized One has arisen but doesn't teach the Dhamma leading to peace, extinguishment, awakening"
    ],
    "Nine progressive meditations [dn33:3.2.0]": [
      "First absorption",
      "Second absorption",
      "Third absorption",
      "Fourth absorption",
      "Dimension of infinite space",
      "Dimension of infinite consciousness",
      "Dimension of nothingness",
      "Dimension of neither perception nor non-perception",
      "Cessation of perception and feeling"
    ],
    "Nine progressive cessations [dn33:3.2.0]": [
      "Sensual perceptions",
      "Placing of the mind and keeping it connected",
      "Rapture",
      "Breathing",
      "Perception of form",
      "Perception of the dimension of infinite space",
      "Perception of the dimension of infinite consciousness",
      "Perception of the dimension of nothingness",
      "Perception and feeling"
    ],
    "Ten qualities that serve as protector [dn33:3.3.0]": [
      "Ethical conduct",
      "Being learned",
      "Having good friends, companions, and associates",
      "Being easy to admonish",
      "Being deft and tireless in a diverse spectrum of duties for their spiritual companions",
      "Loving the teachings and being a delight to converse with",
      "Being content with any kind of robes, almsfood, lodgings, and medicines and supplies for the sick",
      "Living with energy roused up for giving up unskillful qualities and embracing skillful qualities",
      "Being mindful",
      "Being wise"
    ],
    "Ten universal dimensions of meditation [dn33:3.3.0]": [
      "Meditation on universal earth",
      "Meditation on universal water",
      "Meditation on universal fire",
      "Meditation on universal air",
      "Meditation on universal blue",
      "Meditation on universal yellow",
      "Meditation on universal red",
      "Meditation on universal white",
      "Meditation on universal space",
      "Meditation on universal consciousness"
    ],
    "Ten ways of doing unskillful deeds [dn33:3.3.0]": [
      "Killing living creatures",
      "Stealing",
      "Sexual misconduct",
      "False speech",
      "Divisive speech",
      "Harsh speech",
      "Nonsensical speech",
      "Covetousness",
      "Ill will",
      "Wrong view"
    ],
    "Ten ways of doing skillful deeds [dn33:3.3.0]": [
      "Refraining from killing living creatures",
      "Refraining from stealing",
      "Refraining from sexual misconduct",
      "Refraining from false speech",
      "Refraining from divisive speech",
      "Refraining from harsh speech",
      "Refraining from nonsensical speech",
      "Contentment",
      "Good will",
      "Right view"
    ],
    "Ten noble abodes [dn33:3.3.0]": [
      "Giving up sensual desire",
      "Giving up ill will",
      "Giving up dullness and drowsiness",
      "Giving up restlessness and remorse",
      "Giving up doubt",
      "Possessing six factors",
      "Having a single guard",
      "Having four supports",
      "Eliminating idiosyncratic interpretations of the truth",
      "Totally giving up searching"
    ],
    "Ten qualities of an adept [dn33:3.3.0]": [
      "Right view",
      "Right thought",
      "Right speech",
      "Right action",
      "Right livelihood",
      "Right effort",
      "Right mindfulness",
      "Right immersion",
      "Right knowledge",
      "Right freedom"
    ]
  }
}