{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn4": {
    "The qualities of Soṇadaṇḍa [dn4:4.0]": [
      "Well born on both mother's and father's side, of pure descent, irrefutable and impeccable in questions of ancestry back to the seventh paternal generation",
      "Rich, affluent, and wealthy",
      "Recites and remembers the hymns, and has mastered the three Vedas, together with their vocabularies, ritual, phonology and etymology, and the testament as fifth",
      "Attractive, good-looking, lovely, of surpassing beauty, magnificent, splendid, remarkable to behold",
      "Ethical, mature in ethical conduct",
      "A good speaker, with a polished, clear, and articulate voice that expresses the meaning",
      "Teaches the teachers of many, and teaches three hundred students to recite the hymns",
      "Old, elderly and senior, advanced in years, and have reached the final stage of life",
      "Honored, respected, revered, venerated, and esteemed by King Bimbisāra of Magadha and the brahmin Pokkharasāti",
      "Lives in Campā, a crown property given by King Seniya Bimbisāra of Magadha, teeming with living creatures, full of hay, wood, water, and grain, a royal endowment of the highest quality."
    ],
    "The Qualities of the Buddha [dn4:6.0]": [
      "He is well born on both his mother’s and father’s side, of pure descent, irrefutable and impeccable in questions of ancestry back to the seventh paternal generation.",
      "When he went forth he abandoned a large family circle.",
      "When he went forth he abandoned abundant gold coin and bullion stored in dungeons and towers.",
      "He went forth from the lay life to homelessness while still a youth, young, black-haired, blessed with youth, in the prime of life.",
      "Though his mother and father wished otherwise, weeping with tearful faces, he shaved off his hair and beard, dressed in ocher robes, and went forth from the lay life to homelessness.",
      "He is attractive, good-looking, lovely, of surpassing beauty. He is magnificent, splendid, remarkable to behold.",
      "He is ethical, possessing ethical conduct that is noble and skillful.",
      "He’s a good speaker, with a polished, clear, and articulate voice that expresses the meaning.",
      "He’s a teacher of teachers.",
      "He has ended sensual desire, and is rid of caprice.",
      "He teaches the efficacy of deeds and action. He doesn’t wish any harm upon the community of brahmins.",
      "He went forth from an eminent family of unbroken aristocratic lineage.",
      "He went forth from a rich, affluent, and wealthy family.",
      "People come from distant lands and distant countries to question him.",
      "Many thousands of deities have gone for refuge for life to him.",
      "He has this good reputation: ‘That Blessed One is perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.’",
      "He has the thirty-two marks of a great man.",
      "He is welcoming, congenial, polite, smiling, open, the first to speak.",
      "He’s honored, respected, revered, venerated, and esteemed by the four assemblies.",
      "Many gods and humans are devoted to him.",
      "While he is residing in a village or town, non-human entities do not harass them.",
      "He leads an order and a community, and teaches a community, and is said to be the best of the various religious founders. He didn’t come by his fame in the same ways as those other ascetics and brahmins. Rather, he came by his fame due to his supreme knowledge and conduct.",
      "King Seniya Bimbisāra of Magadha and his wives and children have gone for refuge for life to the ascetic Gotama.",
      "King Pasenadi of Kosala and his wives and children have gone for refuge for life to the ascetic Gotama.",
      "The brahmin Pokkharasāti and his wives and children have gone for refuge for life to the ascetic Gotama.",
      "He’s honored, respected, revered, venerated, and esteemed by King Bimbisāra of Magadha, King Pasenadi of Kosala, and the brahmin Pokkharasāti."
    ],
    "The five factors which a brahmin must possess [dn4:11.0]": [
      "Well born on both his mother’s and father’s side, of pure descent, irrefutable and impeccable in questions of ancestry back to the seventh paternal generation",
      "Recites and remembers the hymns, and has mastered the three Vedas, together with their vocabularies, ritual, phonology and etymology, and the testament as fifth",
      "Knows philology and grammar, and is well versed in cosmology and the marks of a great man",
      "Attractive, good-looking, lovely, of surpassing beauty. Magnificent, splendid, remarkable to behold",
      "Ethical, mature in ethical conduct. Astute and clever, being the first or second to hold the sacrificial ladle"
    ],
    "The factors that can be set aside and still rightly describe someone as a brahmin (a causal sequence) [dn4:11.0]": [
      "Appearance",
      "The hymns",
      "Birth"
    ],
    "The two factors that a brahmin must possess for the brahmins to rightly describe him as a brahmin (a causal sequence) [dn4:11.0]": [
      "Ethical, mature in ethical conduct",
      "Astute and clever, being the first or second to hold the sacrificial ladle"
    ],
    "The two factors that always go together (a structured repetition) [dn4:21.0]": [
      "Ethics",
      "Wisdom"
    ],
    "The accomplishments of a mendicant in ethics [dn4:21.0]": [
      "They enter and remain in the first absorption",
      "They enter and remain in the second absorption",
      "They enter and remain in the third absorption",
      "They enter and remain in the fourth absorption"
    ],
    "The pertains to their wisdom [dn4:21.0]": [
      "They extend and project the mind toward knowledge and vision",
      "They understand: ‘… there is no return to any state of existence.’"
    ]
  }
}