{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn5": {
    "Qualities of Kūṭadanta [dn5:5.0]": [
      "Well born on both mother's and father's side",
      "Rich, affluent, and wealthy",
      "Recites and remembers the hymns, and has mastered the three Vedas",
      "Attractive, good-looking, lovely, of surpassing beauty",
      "Ethical, mature in ethical conduct",
      "A good speaker, with a polished, clear, and articulate voice that expresses the meaning",
      "Teaches the teachers of many, and teaches three hundred students to recite the hymns",
      "Old, elderly and senior, advanced in years, and have reached the final stage of life",
      "Honored, respected, revered, venerated, and esteemed by King Bimbisāra of Magadha and the brahmin Pokkharasāti",
      "Lives in Khāṇumata, a crown property given by King Seniya Bimbisāra of Magadha, teeming with living creatures, full of hay, wood, water, and grain, a royal endowment of the highest quality."
    ],
    "The Qualities of the Buddha [dn5:7.0]": [
      "He is well born on both his mother’s and father’s side, of pure descent, irrefutable and impeccable in questions of ancestry back to the seventh paternal generation.",
      "When he went forth he abandoned a large family circle.",
      "When he went forth he abandoned abundant gold coin and bullion stored in dungeons and towers.",
      "He went forth from the lay life to homelessness while still a youth, young, black-haired, blessed with youth, in the prime of life.",
      "Though his mother and father wished otherwise, weeping with tearful faces, he shaved off his hair and beard, dressed in ocher robes, and went forth from the lay life to homelessness.",
      "He is attractive, good-looking, lovely, of surpassing beauty. He is magnificent, splendid, remarkable to behold.",
      "He is ethical, possessing ethical conduct that is noble and skillful.",
      "He’s a good speaker, with a polished, clear, and articulate voice that expresses the meaning.",
      "He’s a teacher of teachers.",
      "He has ended sensual desire, and is rid of caprice.",
      "He teaches the efficacy of deeds and action. He doesn’t wish any harm upon the community of brahmins.",
      "He went forth from an eminent family of unbroken aristocratic lineage.",
      "He went forth from a rich, affluent, and wealthy family.",
      "People come from distant lands and distant countries to question him.",
      "Many thousands of deities have gone for refuge for life to him.",
      "He has this good reputation: ‘That Blessed One is perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.’",
      "He has the thirty-two marks of a great man.",
      "He is welcoming, congenial, polite, smiling, open, the first to speak.",
      "He’s honored, respected, revered, venerated, and esteemed by the four assemblies.",
      "Many gods and humans are devoted to him.",
      "While he is residing in a village or town, non-human entities do not harass them.",
      "He leads an order and a community, and teaches a community, and is said to be the best of the various religious founders. He didn’t come by his fame in the same ways as those other ascetics and brahmins. Rather, he came by his fame due to his supreme knowledge and conduct.",
      "King Seniya Bimbisāra of Magadha and his wives and children have gone for refuge for life to the ascetic Gotama.",
      "King Pasenadi of Kosala and his wives and children have gone for refuge for life to the ascetic Gotama.",
      "The brahmin Pokkharasāti and his wives and children have gone for refuge for life to the ascetic Gotama.",
      "He’s honored, respected, revered, venerated, and esteemed by King Bimbisāra of Magadha, King Pasenadi of Kosala, and the brahmin Pokkharasāti."
    ],
    "The plan to uproot the outlaw threat (a causal sequence) [dn5:8.0]": [
      "Let the king provide seed and fodder for those in the realm who work in farming and raising cattle.",
      "Let the king provide funding for those who work in trade.",
      "Let the king guarantee food and wages for those in government service."
    ],
    "The actions taken by the king (a causal sequence) [dn5:8.0]": [
      "The king agreed with the high priest’s advice and followed his recommendation.",
      "The king eradicated the outlaw threat.",
      "The king's revenue increased.",
      "The country was secured as a sanctuary, free of being harried and oppressed.",
      "The happy people, with joy in their hearts, dancing with children at their breast, dwell as if their houses were wide open."
    ],
    "The four consenting factions [dn5:12.0]": [
      "Aristocrat vassals",
      "Ministers and counselors",
      "Well-to-do brahmins",
      "Well-off householders, both of town and country"
    ],
    "The four accessories to the sacrifice [dn5:12.0]": [
      "Aristocrat vassals",
      "Ministers and counselors",
      "Well-to-do brahmins",
      "Well-off householders, both of town and country"
    ],
    "The eight factors possessed by King Mahāvijita [dn5:13.0]": [
      "Well born on both his mother’s and father’s side, of pure descent, irrefutable and impeccable in questions of ancestry back to the seventh paternal generation",
      "Attractive, good-looking, lovely, of surpassing beauty",
      "Magnificent, splendid, remarkable to behold",
      "Rich, affluent, and wealthy, with lots of gold and silver, lots of property and assets, lots of money and grain, and a full treasury and storehouses",
      "Powerful, having an army of four divisions that was obedient and carried out instructions",
      "Faithful, generous, a donor, his door always open. He was a well-spring of support, making merit with ascetics and brahmins, for paupers, vagrants, travelers, and beggars",
      "Very learned in diverse fields of learning. He understood the meaning of diverse statements, saying: ‘This is what that statement means; that is what this statement means.’",
      "Astute, competent, and intelligent, able to think issues through as they bear upon the past, future, and present"
    ],
    "The eight accessories to the sacrifice [dn5:13.0]": [
      "Well born on both his mother’s and father’s side",
      "Attractive, good-looking, lovely, of surpassing beauty",
      "Magnificent, splendid, remarkable to behold",
      "Rich, affluent, and wealthy",
      "Powerful, having an army of four divisions that was obedient and carried out instructions",
      "Faithful, generous, a donor, his door always open",
      "Very learned in diverse fields of learning",
      "Astute, competent, and intelligent, able to think issues through as they bear upon the past, future, and present"
    ],
    "The four factors possessed by the brahmin high priest [dn5:14.0]": [
      "Well born on both his mother’s and father’s side, of pure descent, irrefutable and impeccable in questions of ancestry back to the seventh paternal generation",
      "Recited and remembered the hymns, and had mastered the three Vedas, together with their vocabularies, ritual, phonology and etymology, and the testament as fifth. He knew philology and grammar, and was well versed in cosmology and the marks of a great man",
      "Ethical, mature in ethical conduct",
      "Astute and clever, being the first or second to hold the sacrificial ladle"
    ],
    "The four accessories to the sacrifice [dn5:14.0]": [
      "Well born on both his mother’s and father’s side",
      "Recited and remembered the hymns, and had mastered the three Vedas, together with their vocabularies, ritual, phonology and etymology, and the testament as fifth. He knew philology and grammar, and was well versed in cosmology and the marks of a great man",
      "Ethical, mature in ethical conduct",
      "Astute and clever, being the first or second to hold the sacrificial ladle"
    ],
    "The three modes taught by the brahmin high priest to the king [dn5:15.0]": [
      "“I shall lose a great fortune”",
      "“I am losing a great fortune”",
      "“I have lost a great fortune”"
    ],
    "The ten respects in which the high priest dispelled the king’s regret regarding the recipients [dn5:16.0]": [
      "Those who kill living creatures and those who refrain from killing living creatures",
      "Those who steal and those who refrain from stealing",
      "Those who commit sexual misconduct and those who refrain from committing sexual misconduct",
      "Those who lie and those who refrain from lying",
      "Those who use divisive speech and those who refrain from using divisive speech",
      "Those who use harsh speech and those who refrain from using harsh speech",
      "Those who talk nonsense and those who refrain from talking nonsense",
      "Those who are covetous and those who are not covetous",
      "Those who have ill will and those who do not have ill will",
      "Those who have wrong view and those who have right view"
    ],
    "The sixteen respects in which the high priest educated, encouraged, fired up, and inspired the king’s mind [dn5:17.0]": [
      "The king did indeed announce the sacrifice to the aristocrat vassals of town and country",
      "The king did indeed announce the sacrifice to the ministers and counselors, well-to-do brahmins, and well-off householders, both of town and country",
      "The king does indeed possess the eight factors",
      "The high priest does indeed possess the four factors"
    ],
    "The things that were not done in the sacrifice [dn5:17.0]": [
      "No cattle were killed",
      "No goats were killed",
      "No chickens or pigs were killed",
      "No trees were felled for the sacrificial post",
      "No grass was reaped to strew over the place of sacrifice",
      "No bondservants, employees, or workers did their jobs under threat of punishment and danger, weeping with tearful faces"
    ],
    "The items used in the sacrifice [dn5:17.0]": [
      "Ghee",
      "Oil",
      "Butter",
      "Curds",
      "Honey",
      "Molasses"
    ],
    "The factions that set up gifts [dn5:17.0]": [
      "The aristocrat vassals of town and country set up gifts to the east of the sacrificial pit",
      "The ministers and counselors of town and country set up gifts to the south of the sacrificial pit",
      "The well-to-do brahmins of town and country set up gifts to the west of the sacrificial pit",
      "The well-off householders of town and country set up gifts to the north of the sacrificial pit"
    ],
    "Sacrifices that have fewer requirements and undertakings, yet are more fruitful and beneficial [dn5:22.0]": [
      "Regular gifts as ongoing family sacrifice given specially to ethical renunciates",
      "Giving a dwelling specially for the Saṅgha of the four quarters",
      "Going for refuge to the Buddha, the teaching, and the Saṅgha",
      "Undertaking the training rules to refrain from killing living creatures, stealing, sexual misconduct, lying, and alcoholic drinks that cause negligence",
      "A Realized One arises in the world, perfected, a fully awakened Buddha"
    ],
    "The accomplishment of sacrifice [dn5:22.0](a causal sequence)( a causal sequence)": [
      "A mendicant is accomplished in ethics",
      "They enter and remain in the first absorption",
      "They enter and remain in the second absorption",
      "They enter and remain in the third absorption",
      "They enter and remain in the fourth absorption",
      "They extend and project the mind toward knowledge and vision",
      "They understand that there is no return to any state of existence."
    ],
    "The Buddha's teachings to Kūṭadanta [dn5:29.0]": [
      "Giving",
      "Ethical conduct",
      "Heaven",
      "The drawbacks of sensual pleasures",
      "The benefit of renunciation",
      "The special teaching of the Buddhas: suffering, its origin, its cessation, and the path"
    ]
  }
}