{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn8": {
    "Matters on which we agree [dn8:5.0]": [
      "There are things that are unskillful, blameworthy, not to be cultivated, unworthy of the noble ones, and dark—and are reckoned as such.",
      "Who behaves like they’ve totally given these things up: the ascetic Gotama, or the teachers of other communities?"
    ],
    "Things that are skillful, blameless, worth cultivating, worthy of the noble ones, and bright [dn8:5.0]": [
      "There are things that are skillful, blameless, worth cultivating, worthy of the noble ones, and bright—and are reckoned as such.",
      "Who proceeds having totally undertaken these things: the ascetic Gotama, or the teachers of other communities?"
    ],
    "Unskillful things that have been given up [dn8:5.0]": [
      "There are things that are unskillful, blameworthy, not to be cultivated, unworthy of the noble ones, and dark—and are reckoned as such.",
      "Who behaves like they’ve totally given these things up: the ascetic Gotama’s disciples, or the disciples of other teachers?"
    ],
    "Skillful things that have been undertaken [dn8:5.0]": [
      "There are things that are skillful, blameless, worth cultivating, worthy of the noble ones, and bright—and are reckoned as such.",
      "Who proceeds having totally undertaken these things: the ascetic Gotama’s disciples, or the disciples of other teachers?"
    ],
    "The Noble Eightfold Path [dn8:13.0]": [
      "Right view",
      "Right thought",
      "Right speech",
      "Right action",
      "Right livelihood",
      "Right effort",
      "Right mindfulness",
      "Right immersion"
    ],
    "Practices of self-mortification [dn8:14.0]": [
      "Going naked, ignoring conventions",
      "Licking their hands, and not coming or waiting when called",
      "Not consenting to food brought to them, or food prepared on purpose for them, or an invitation for a meal",
      "Not receiving anything from a pot or bowl; or from someone who keeps sheep, or who has a weapon or a shovel in their home; or where a couple is eating; or where there is a woman who is pregnant, breastfeeding, or who has a man in her home; or where there’s a dog waiting or flies buzzing",
      "Accepting no fish or meat or liquor or wine, and drinking no beer",
      "Going to just one house for alms, taking just one mouthful, or two houses and two mouthfuls, up to seven houses and seven mouthfuls",
      "Feeding on one saucer a day, two saucers a day, up to seven saucers a day",
      "Eating once a day, once every second day, up to once a week, and so on, even up to once a fortnight",
      "Living committed to the practice of eating food at set intervals",
      "Eating herbs, millet, wild rice, poor rice, water lettuce, rice bran, scum from boiling rice, sesame flour, grass, or cow dung",
      "Surviving on forest roots and fruits, or eating fallen fruit",
      "Wearing robes of sunn hemp, mixed hemp, corpse-wrapping cloth, rags, lodh tree bark, antelope hide (whole or in strips), kusa grass, bark, wood-chips, human hair, horse-tail hair, or owls’ wings",
      "Tearing out hair and beard, committed to this practice",
      "Constantly standing, refusing seats",
      "Squatting, committed to persisting in the squatting position",
      "Lying on a mat of thorns, making a mat of thorns their bed",
      "Making their bed on a plank, or the bare ground",
      "Lying only on one side",
      "Wearing dust and dirt",
      "Staying in the open air",
      "Sleeping wherever they lay their mat",
      "Eating unnatural things, committed to the practice of eating unnatural foods",
      "Not drinking, committed to the practice of not drinking liquids",
      "Being committed to the practice of immersion in water three times a day, including the evening."
    ],
    "Forms of self-mortification [dn8:15.0]": [
      "Practice all those forms of self-mortification",
      "Self-mortification"
    ],
    "Accomplishment in ethics, mind, and wisdom [dn8:15.0]": [
      "Accomplishment in ethics",
      "Accomplishment in mind",
      "Accomplishment in wisdom"
    ],
    "Characteristics of a true ascetic or brahmin [dn8:15.0]": [
      "Develops a heart of love, free of enmity and ill will",
      "Realizes the undefiled freedom of heart and freedom by wisdom in this very life",
      "Lives having realized it with their own insight due to the ending of defilements"
    ],
    "Difficulty in being a true ascetic or brahmin (a causal sequence) [dn8:15.0]": [
      "Practice all those forms of self-mortification",
      "Something other than just that much, something other than that self-mortification",
      "Difficulty in being a true ascetic or brahmin"
    ],
    "Difficulty in knowing a true ascetic or brahmin (a causal sequence) [dn8:15.0]": [
      "Practice all those forms of self-mortification",
      "Something other than just that much, something other than that self-mortification",
      "Difficulty in knowing a true ascetic or brahmin"
    ],
    "Accomplishment in ethics [dn8:18.0]": [
      "Gives up killing living creatures",
      "Renounces the rod and the sword",
      "Is scrupulous and kind, living full of compassion for all living beings",
      "Refrains from unworthy branches of knowledge and wrong livelihood"
    ],
    "Accomplishment in mind [dn8:18.0]": [
      "Enters and remains in the first absorption",
      "Enters and remains in the second absorption",
      "Enters and remains in the third absorption",
      "Enters and remains in the fourth absorption"
    ],
    "Accomplishment in wisdom [dn8:18.0]": [
      "Extends and projects the mind toward knowledge and vision",
      "Understands that there is no return to any state of existence"
    ],
    "Spectrum of noble ethics (a structured repetition) [dn8:18.0]": [
      "Seeing danger in the slightest fault, a mendicant keeps the rules they’ve undertaken.",
      "They act skillfully by body and speech.",
      "They’re purified in livelihood and accomplished in ethical conduct.",
      "They guard the sense doors, have mindfulness and situational awareness, and are content."
    ],
    "Characteristics of a mendicant accomplished in ethics (a structured repetition) [dn8:18.0]": [
      "They see no danger in any quarter in regards to their ethical restraint.",
      "They experience a blameless happiness inside themselves."
    ],
    "The highest noble ethics (a structured repetition) [dn8:21.0]": [
      "Some ascetics and brahmins teach ethics and praise ethical conduct in many ways.",
      "As far as the highest noble ethics goes, the Buddha doesn't see anyone who's his equal, still less his superior.",
      "The Buddha is the one who is superior when it comes to the higher ethics."
    ],
    "The highest noble mortification in disgust of sin (a structured repetition) [dn8:21.0]": [
      "Some ascetics and brahmins teach mortification in disgust of sin and praise it in many ways.",
      "As far as the highest noble mortification in disgust of sin goes, the Buddha doesn't see anyone who's his equal, still less his superior.",
      "The Buddha is the one who is superior when it comes to the higher mortification in disgust of sin."
    ],
    "The highest noble wisdom (a structured repetition) [dn8:21.0]": [
      "Some ascetics and brahmins teach wisdom and praise it in many ways.",
      "As far as the highest noble wisdom goes, the Buddha doesn't see anyone who's his equal, still less his superior.",
      "The Buddha is the one who is superior when it comes to the higher wisdom."
    ],
    "The highest noble freedom (a structured repetition) [dn8:21.0]": [
      "Some ascetics and brahmins teach freedom and praise it in many ways.",
      "As far as the highest noble freedom goes, the Buddha doesn't see anyone who's his equal, still less his superior.",
      "The Buddha is the one who is superior when it comes to the higher freedom."
    ]
  }
}