{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "dn9": {
    "Different views on how the cessation of perception happens [dn9:6.0]": [
      "A person’s perceptions arise and cease without cause or reason.",
      "Perception is a person’s self. When it enters, you become percipient. When it departs, you become non-percipient.",
      "There are ascetics and brahmins of great power and might. They insert and extract a person’s perception. When they insert it, you become percipient. When they extract it, you become non-percipient.",
      "There are deities of great power and might. They insert and extract a person’s perception. When they insert it, you become percipient. When they extract it, you become non-percipient."
    ],
    "The stages of training to attain certain perceptions and cessation of perception (a causal sequence) [dn9:7.0]": [
      "Realized One arises in the world, perfected, a fully awakened Buddha",
      "Accomplished in ethics",
      "Enter and remain in the first absorption",
      "Enter and remain in the second absorption",
      "Enter and remain in the third absorption",
      "Enter and remain in the fourth absorption",
      "Going totally beyond perceptions of form, enter and remain in the dimension of infinite space",
      "Going totally beyond the dimension of infinite space, enter and remain in the dimension of infinite consciousness",
      "Going totally beyond the dimension of infinite consciousness, enter and remain in the dimension of nothingness"
    ],
    "The gradual cessation of perception (a causal sequence) [dn9:7.0]": [
      "Proceed from one stage to the next, gradually reaching the peak of perception",
      "Standing on the peak of perception, think \"Intentionality is bad for me, it's better to be free of it\"",
      "Neither make a choice nor form an intention",
      "Those perceptions cease in them, and other coarser perceptions don't arise",
      "Touch cessation"
    ],
    "The relationship between perception and knowledge (a causal sequence) [dn9:7.0]": [
      "Perception arises first",
      "Knowledge arises afterwards",
      "The arising of perception leads to the arising of knowledge"
    ],
    "Different views on self and perception [dn9:21.0]": [
      "Poṭṭhapāda's belief in a substantial self",
      "Poṭṭhapāda's belief in a mind-made self",
      "Poṭṭhapāda's belief in a non-physical self made of perception"
    ],
    "Different beliefs about the cosmos and the self [dn9:21.0]": [
      "The cosmos is eternal",
      "The cosmos is not eternal",
      "The cosmos is finite",
      "The cosmos is infinite",
      "The soul and the body are the same thing",
      "The soul and the body are different things",
      "A Realized One exists after death",
      "A Realized One doesn't exist after death",
      "A Realized One both exists and doesn't exist after death",
      "A Realized One neither exists nor doesn't exist after death"
    ],
    "What has been declared by the Buddha [dn9:21.0]": [
      "This is suffering",
      "This is the origin of suffering",
      "This is the cessation of suffering",
      "This is the practice that leads to the cessation of suffering"
    ],
    "Things that are not definitive [dn9:32.0]": [
      "The cosmos is eternal",
      "The cosmos is not eternal",
      "The cosmos is finite",
      "The cosmos is infinite",
      "The soul is the same thing as the body",
      "The soul and the body are different things",
      "A Realized One exists after death",
      "A Realized One doesn’t exist after death",
      "A Realized One both exists and doesn’t exist after death",
      "A Realized One neither exists nor doesn’t exist after death."
    ],
    "Things that are definitive [dn9:33.19.0]": [
      "This is suffering",
      "This is the origin of suffering",
      "This is the cessation of suffering",
      "This is the practice that leads to the cessation of suffering"
    ],
    "Questions asked to ascetics and brahmins who have the doctrine and view that the self is exclusively happy and well after death [dn9:33.19.0]": [
      "Do you meditate knowing and seeing an exclusively happy world?",
      "Have you perceived an exclusively happy self for a single day or night, or even half a day or night?",
      "Do you know a path and a practice to realize an exclusively happy world?",
      "Have you ever heard the voice of the deities reborn in an exclusively happy world saying, “Practice well, dear sirs, practice directly so as to realize an exclusively happy world. For this is how we practiced, and we were reborn in an exclusively happy world”?"
    ],
    "Examples given by the Buddha to illustrate the lack of demonstrable basis of the doctrines and views of the ascetics and brahmins [dn9:33.19.0]": [
      "Suppose a man were to say: ‘Whoever the finest lady in the land is, it is her that I want, her that I desire!’",
      "Suppose a man was to build a ladder at the crossroads for climbing up to a stilt longhouse."
    ],
    "Three kinds of reincarnation [dn9:39.0]": [
      "Substantial reincarnation",
      "Mind-made reincarnation",
      "Non-physical reincarnation"
    ],
    "Questions asked to Citta Hatthisāriputta [dn9:39.0]": [
      "Did you exist in the past?",
      "Will you exist in the future?",
      "Do you exist now?",
      "The reincarnation I had in the past was real at that time, and those of the future and present fictitious.",
      "The reincarnation I will have in the future will be real at the time, and those of the past and present fictitious.",
      "The reincarnation I have now is real at this time, and those of the past and future fictitious."
    ],
    "The process of milk to cream of ghee (a causal sequence) [dn9:39.0]": [
      "From a cow comes milk",
      "From milk comes curds",
      "From curds come butter",
      "From butter comes ghee",
      "From ghee comes cream of ghee"
    ],
    "The world's usages, terms, expressions, and descriptions [dn9:39.0]": [
      "Milk",
      "Curds",
      "Butter",
      "Ghee",
      "Cream of ghee"
    ]
  }
}