{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn1.33": {
    "Sentiments on the goodness of giving [sn1.33:19.4]": [
      "Good, sir, is giving! Because of stinginess and negligence a gift is not given. Wanting merit, a smart person would give.",
      "Good, sir, is giving! Even when one has little, giving is good. Some who have little are happy to provide, while some who have much don’t wish to give. An offering given from little is multiplied a thousand times.",
      "Good, sir, is giving! Even when one has little, giving is good. And it’s also good to give out of faith. Giving and warfare are similar, they say, for even a few of the good may conquer the many. If a faithful person gives even a little, it still brings them happiness in the hereafter.",
      "Good, sir, is giving! Even when one has little, giving is good. And it’s also good to give out of faith. And it’s also good to give legitimate wealth. A man who gives legitimate wealth, earned by his efforts and initiative, has passed over Yama’s Vetaraṇi River; that mortal arrives at celestial fields.",
      "Good, sir, is giving! Even when one has little, giving is good. And it’s also good to give out of faith. And it’s also good to give legitimate wealth. And it’s also good to give intelligently. The Holy One praises giving intelligently to those worthy of offerings here in the world of the living. What’s given to these is very fruitful, like seeds sown in a fertile field.",
      "Good, sir, is giving! Even when one has little, giving is good. And it’s also good to give out of faith. And it’s also good to give legitimate wealth. And it’s also good to give intelligently. And it’s also good to be restrained when it comes to living creatures. One who lives without harming any living being never does bad because of others’ blame; for in that case they praise the coward, not the brave; and the virtuous never do bad out of fear."
    ]
  }
}