{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn11.5": {
    "The verses recited by Vepacitti and Sakka [sn11.5:14.8]": [
      "Vepacitti's verse: \"Fools would vent even more if there’s no-one to put a stop to them. So an intelligent person should stop a fool with forceful punishment.\"",
      "Sakka's verse: \"I think that this is the only way to put a stop to a fool, when you know that the other is upset, be mindful and stay calm.\"",
      "Vepacitti's verse: \"I see this fault, Vāsava, in just being patient. When a fool thinks, “He puts up with me out of fear,” the idiot will go after you even harder, like a cow chasing someone who runs away.\"",
      "Sakka's verses: \"Let him think this if he wishes, or not— “He puts up with me out of fear.” Of goals culminating in one’s own good, none better than patience is found. When a strong person puts up with a weakling, they call that the ultimate patience, for a weakling must always be patient. The strength of folly is really just weakness, they say. But no-one can challenge a person who’s strong, guarded by the teaching. When you get angry at an angry person you just make things worse for yourself. When you don’t get angry at an angry person you win a battle hard to win. When you know that the other is angry, you act for the good of both yourself and the other if you’re mindful and stay calm. People unfamiliar with the teaching consider one who heals both oneself and the other to be a fool.\""
    ],
    "The judges' evaluation of the verses [sn11.5:14.8]": [
      "The verses spoken by Vepacitti evoke punishment and violence.",
      "That’s how you get arguments, quarrels, and disputes.",
      "The verses spoken by Sakka don’t evoke punishment and violence.",
      "That’s how you stay free of arguments, quarrels, and disputes."
    ],
    "The outcome of the battle (a causal sequence) [sn11.5:14.8]": [
      "Sakka wins victory by fine words.",
      "The battle is won by the gods."
    ]
  }
}