{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn12.21": {
    "The Ten Powers [sn12.21:1.15]": [
      "Power of knowing what is possible and what is impossible",
      "Power of knowing the outcome of actions",
      "Power of knowing the thoughts of others",
      "Power of knowing the past lives of others",
      "Power of recollecting past lives",
      "Power of divine ear",
      "Power of knowing the minds of others",
      "Power of remembering past lives",
      "Power of understanding the ending of defilements",
      "Power of understanding the ending of suffering"
    ],
    "Four kinds of self-assurance [sn12.21:1.15]": [
      "Self-assurance in the teaching",
      "Self-assurance in the training",
      "Self-assurance in the goal",
      "Self-assurance in the fruit of the spiritual life"
    ],
    "Causal Chain [sn12.21:1.15]": [
      "Ignorance is a condition for choices",
      "Choices are a condition for consciousness",
      "Consciousness is a condition for name and form",
      "Name and form are conditions for the six sense fields",
      "The six sense fields are conditions for contact",
      "Contact is a condition for feeling",
      "Feeling is a condition for craving",
      "Craving is a condition for grasping",
      "Grasping is a condition for continued existence",
      "Continued existence is a condition for rebirth",
      "Rebirth is a condition for old age and death"
    ],
    "Repetitive or similar sentence structure (a causal chain) [sn12.21:1.15]": [
      "Such is form, such is the origin of form, such is the ending of form",
      "Such is feeling, such is the origin of feeling, such is the ending of feeling",
      "Such is perception, such is the origin of perception, such is the ending of perception",
      "Such are choices, such is the origin of choices, such is the ending of choices",
      "Such is consciousness, such is the origin of consciousness, such is the ending of consciousness"
    ]
  }
}