{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn12.68": {
    "The series of questions [sn12.68:14.3]": [
      "Do you know for yourself that rebirth is a condition for old age and death?",
      "Do you know for yourself that continued existence is a condition for rebirth?",
      "Do you know for yourself that grasping is a condition for continued existence?",
      "Do you know for yourself that craving is a condition for grasping?",
      "Do you know for yourself that feeling is a condition for craving?",
      "Do you know for yourself that contact is a condition for feeling?",
      "Do you know for yourself that the six sense fields are conditions for contact?",
      "Do you know for yourself that name and form are conditions for the six sense fields?",
      "Do you know for yourself that consciousness is a condition for name and form?",
      "Do you know for yourself that choices are a condition for consciousness?",
      "Do you know for yourself that ignorance is a condition for choices?"
    ],
    "The response to the questions (a causal chain) [sn12.68:14.3]": [
      "I know and see that rebirth is a condition for old age and death.",
      "I know and see that continued existence is a condition for rebirth.",
      "I know and see that grasping is a condition for continued existence.",
      "I know and see that craving is a condition for grasping.",
      "I know and see that feeling is a condition for craving.",
      "I know and see that contact is a condition for feeling.",
      "I know and see that the six sense fields are conditions for contact.",
      "I know and see that name and form are conditions for the six sense fields.",
      "I know and see that consciousness is a condition for name and form.",
      "I know and see that choices are a condition for consciousness.",
      "I know and see that ignorance is a condition for choices."
    ]
  }
}