{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn12.49": {
    "The causal chain of dependent origination [sn12.49:5.1]": [
      "When ignorance exists, choices come to be.",
      "When choices exist, consciousness comes to be.",
      "When consciousness exists, name and form come to be.",
      "When name and form exist, the six sense fields come to be.",
      "When the six sense fields exist, contact comes to be.",
      "When contact exists, feeling comes to be.",
      "When feeling exists, craving comes to be.",
      "When craving exists, grasping comes to be.",
      "When grasping exists, continued existence comes to be.",
      "When continued existence exists, rebirth comes to be.",
      "When rebirth exists, old age and death come to be."
    ],
    "The causal chain of cessation (a causal chain) [sn12.49:5.1]": [
      "When ignorance doesn’t exist, choices don’t come to be.",
      "When choices don't exist, consciousness doesn’t come to be.",
      "When consciousness doesn’t exist, name and form don’t come to be.",
      "When name and form don’t exist, the six sense fields don’t come to be.",
      "When the six sense fields don’t exist, contact doesn’t come to be.",
      "When contact doesn’t exist, feeling doesn’t come to be.",
      "When feeling doesn’t exist, craving doesn’t come to be.",
      "When craving doesn’t exist, grasping doesn’t come to be.",
      "When grasping doesn’t exist, continued existence doesn’t come to be.",
      "When continued existence doesn’t exist, rebirth doesn’t come to be.",
      "When rebirth doesn’t exist, old age and death don’t come to be."
    ],
    "The titles of a noble disciple who understands the world, its origin, its cessation, and the practice that leads to its cessation (a causal chain) [sn12.49:5.1]": [
      "One accomplished in view",
      "One accomplished in vision",
      "One who has come to the true teaching",
      "One who sees this true teaching",
      "One endowed with a trainee’s knowledge",
      "One who has entered the stream of the teaching",
      "A noble one with penetrative wisdom",
      "One who stands knocking at the door of the deathless."
    ]
  }
}