{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn12.61": {
    "Reasons why an uneducated ordinary person might become disillusioned, dispassionate, and freed [sn12.61:6.3]": [
      "This body made up of the four primary elements is seen to accumulate and disperse, to be taken up and laid to rest."
    ],
    "Reasons why an uneducated ordinary person is unable to become disillusioned, dispassionate, or freed [sn12.61:6.3]": [
      "For a long time they’ve been attached to it",
      "Thought of it as their own",
      "Mistaken it: ‘This is mine, I am this, this is my self.’"
    ],
    "Why an uneducated ordinary person would be better off taking this body made up of the four primary elements to be their self, rather than the mind [sn12.61:6.3]": [
      "This body made up of the four primary elements is seen to last for a year, or for two, three, four, five, ten, twenty, thirty, forty, fifty, or a hundred years, or even longer."
    ],
    "How that which is called ‘mind’ or ‘sentience’ or ‘consciousness’ arises and ceases [sn12.61:6.3]": [
      "Arises as one thing and ceases as another all day and all night",
      "It’s like a monkey moving through the forest. It grabs hold of one branch, lets it go, and grabs another; then it lets that go and grabs yet another."
    ],
    "Dependent origination (a repetitive or similar sentence structure) [sn12.61:6.3]": [
      "Ignorance is a condition for choices.",
      "Choices are a condition for consciousness.",
      "Consciousness is a condition for name and form.",
      "Name and form are conditions for the six sense fields.",
      "The six sense fields are conditions for contact.",
      "Contact is a condition for feeling.",
      "Feeling is a condition for craving.",
      "Craving is a condition for grasping.",
      "Grasping is a condition for continued existence.",
      "Continued existence is a condition for rebirth.",
      "Rebirth is a condition for suffering."
    ],
    "The path to freedom (a causal chain) [sn12.61:6.3]": [
      "Seeing dependent origination, a learned noble disciple grows disillusioned with form, feeling, perception, choices, and consciousness.",
      "Being disillusioned, desire fades away.",
      "When desire fades away they’re freed.",
      "When they’re freed, they know they’re freed.",
      "They understand: ‘Rebirth is ended, the spiritual journey has been completed, what had to be done has been done, there is no return to any state of existence.’”"
    ]
  }
}