{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn12.25": {
    "The ascetics and brahmins who teach the efficacy of deeds [sn12.25:14.3]": [
      "Some of them declare that pleasure and pain are made by oneself.",
      "Some of them declare that pleasure and pain are made by another.",
      "Some of them declare that pleasure and pain are made by both oneself and another.",
      "Some of them declare that pleasure and pain arise by chance, not made by oneself or another."
    ],
    "The causes of pleasure and pain [sn12.25:14.3]": [
      "Pleasure and pain are dependently originated.",
      "Dependent on contact."
    ],
    "The intention that gives rise to bodily, verbal, and mental action (a causal chain) [sn12.25:14.3]": [
      "As long as there’s a body, the intention that gives rise to bodily action causes pleasure and pain to arise in oneself.",
      "As long as there’s a voice, the intention that gives rise to verbal action causes pleasure and pain to arise in oneself.",
      "As long as there’s a mind, the intention that gives rise to mental action causes pleasure and pain to arise in oneself."
    ],
    "The ways in which pleasure and pain arise in oneself [sn12.25:14.3]": [
      "By oneself one instigates the choice that gives rise to bodily, verbal, and mental action, conditioned by which that pleasure and pain arise in oneself.",
      "Or else others instigate the choice.",
      "One consciously instigates the choice.",
      "Or else one unconsciously instigates the choice."
    ],
    "The absence of pleasure and pain (a causal chain) [sn12.25:14.3]": [
      "When ignorance fades away and ceases with nothing left over, there is no body and no voice and no mind, conditioned by which that pleasure and pain arise in oneself.",
      "There is no field, no ground, no scope, no basis, conditioned by which that pleasure and pain arise in oneself."
    ]
  }
}