{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn12.22": {
    "The Ten Powers [sn12.22:3.12]": [
      "The power of knowing what is possible and what is impossible",
      "The power of knowing the outcome of actions",
      "The power of knowing the minds of all beings",
      "The power of recollecting past lives",
      "The power of seeing the passing away and rebirth of beings",
      "The power of understanding the ending of defilements",
      "The power of psychic power",
      "The power of clairaudience",
      "The power of knowing the thoughts of others",
      "The power of teaching the Dhamma with its practices"
    ],
    "Four kinds of self-assurance [sn12.22:3.12]": [
      "Self-assurance in the teaching",
      "Self-assurance in the training",
      "Self-assurance in the goal",
      "Self-assurance in the knowledge and vision of liberation"
    ],
    "Causal Chain [sn12.22:3.12]": [
      "Ignorance is a condition for choices",
      "Choices are a condition for consciousness",
      "Consciousness is a condition for name and form",
      "Name and form are conditions for the six sense fields",
      "The six sense fields are conditions for contact",
      "Contact is a condition for feeling",
      "Feeling is a condition for craving",
      "Craving is a condition for grasping",
      "Grasping is a condition for continued existence",
      "Continued existence is a condition for rebirth",
      "Rebirth is a condition for old age and death"
    ],
    "The process of cessation of suffering (a causal chain) [sn12.22:3.12]": [
      "When ignorance fades away and ceases with nothing left over, choices cease",
      "When choices cease, consciousness ceases",
      "When consciousness ceases, name and form cease",
      "When name and form cease, the six sense fields cease",
      "When the six sense fields cease, contact ceases",
      "When contact ceases, feeling ceases",
      "When feeling ceases, craving ceases",
      "When craving ceases, grasping ceases",
      "When grasping ceases, continued existence ceases",
      "When continued existence ceases, rebirth ceases",
      "When rebirth ceases, old age and death cease."
    ]
  }
}