{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn12.24": {
    "The ascetics and brahmins who teach the efficacy of deeds [sn12.24:21.17]": [
      "Some of them declare that suffering is made by oneself.",
      "Some of them declare that suffering is made by another.",
      "Some of them declare that suffering is made by both oneself and another.",
      "Some of them declare that suffering arises by chance, not made by oneself or another."
    ],
    "The causal relationship between suffering and contact [sn12.24:21.17]": [
      "Suffering is dependently originated.",
      "Dependent on contact."
    ],
    "The causal relationship between suffering and ascetics and brahmins who teach the efficacy of deeds (a causal chain) [sn12.24:21.17]": [
      "In the case of those who declare that suffering is made by oneself, that’s conditioned by contact.",
      "In the case of those who declare that suffering is made by another, that’s also conditioned by contact.",
      "In the case of those who declare that suffering is made by oneself and another, that’s also conditioned by contact.",
      "In the case of those who declare that suffering arises by chance, not made by oneself or another, that’s also conditioned by contact."
    ],
    "The causal relationship between suffering and the source of suffering (a causal chain) [sn12.24:21.17]": [
      "Rebirth is the source, origin, birthplace, and inception of old age and death.",
      "Continued existence is the source of rebirth.",
      "Grasping is the source of continued existence.",
      "Craving is the source of grasping.",
      "Feeling is the source of craving.",
      "Contact is the source of feeling.",
      "The six sense fields are the source, origin, birthplace, and inception of contact."
    ],
    "The cessation of suffering (a causal chain) [sn12.24:21.17]": [
      "When the six sense fields fade away and cease with nothing left over, contact ceases.",
      "When contact ceases, feeling ceases.",
      "When feeling ceases, craving ceases.",
      "When craving ceases, grasping ceases.",
      "When grasping ceases, continued existence ceases.",
      "When continued existence ceases, rebirth ceases.",
      "When rebirth ceases, old age and death, sorrow, lamentation, pain, sadness, and distress cease."
    ]
  }
}