{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn20.9": {
    "The behavior of the great bull elephants [sn20.9:4.13]": [
      "They plunge into the lake",
      "They pull up lotus bulbs with their trunks",
      "They wash them thoroughly until they are free of mud",
      "They chew and swallow them",
      "It is good for their appearance and health, and wouldn’t result in death or deadly pain"
    ],
    "The behavior of the young cubs (a causal sequence) [sn20.9:4.13]": [
      "They plunge into the lake",
      "They pull up lotus bulbs with their trunks",
      "They don’t wash them thoroughly",
      "They chew and swallow them while they are still muddy",
      "It is not good for their appearance and health, and results in death or deadly pain"
    ],
    "The behavior of senior mendicants (a causal sequence) [sn20.9:4.13]": [
      "They robe up in the morning",
      "They take their bowl and robe",
      "They enter the town or village for alms",
      "They speak on the teachings",
      "Lay people demonstrate their confidence in them",
      "When they get things, they use them untied, uninfatuated, unattached, seeing the drawbacks, and understanding the escape",
      "It is good for their appearance and health, and doesn’t result in death or deadly pain"
    ],
    "The behavior of junior mendicants (a causal sequence) [sn20.9:4.13]": [
      "They robe up in the morning",
      "They take their bowl and robe",
      "They enter the town or village for alms",
      "They speak on the teachings",
      "Lay people demonstrate their confidence in them",
      "When they get things, they use them tied, infatuated, attached, blind to the drawbacks, not understanding the escape",
      "It is not good for their appearance and health, and results in death or deadly pain"
    ],
    "The training that should be followed (a causal sequence) [sn20.9:4.13]": [
      "When we get things, we will use them untied",
      "We will use them uninfatuated",
      "We will use them unattached",
      "We will see the drawbacks",
      "We will understand the escape"
    ]
  }
}