{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn22.89": {
    "The message to be conveyed to Venerable Khemaka [sn22.89:14.3]": [
      "The seniors hope you’re keeping well; they hope you’re alright.",
      "They hope that your pain is fading, not growing, that its fading is evident, not its growing."
    ],
    "The five grasping aggregates taught by the Buddha [sn22.89:14.3]": [
      "The grasping aggregates of form",
      "Feeling",
      "Perception",
      "Choices",
      "Consciousness"
    ],
    "The questions asked by the senior mendicants [sn22.89:14.3]": [
      "When you say ‘I am’, what is it that you’re talking about? Is it form or apart from form?",
      "Is it feeling … perception … choices … consciousness, or apart from consciousness?",
      "When you say ‘I am’, what is it that you’re talking about?"
    ],
    "The observations made by a noble disciple to eradicate the lingering residue of the conceit ‘I am’ [sn22.89:14.3]": [
      "Observing rise and fall in the five grasping aggregates",
      "Such is form, such is the origin of form, such is the ending of form.",
      "Such is feeling … Such is perception … Such are choices … Such is consciousness, such is the origin of consciousness, such is the ending of consciousness."
    ],
    "The similes used by Venerable Khemaka [sn22.89:14.3]": [
      "It’s like the scent of a blue water lily, or a pink or white lotus.",
      "Suppose there was a cloth that was dirty and soiled, so the owners give it to a launderer. The launderer kneads it thoroughly with salt, lye, and cow dung, and rinses it in clear water. Although that cloth is clean and bright, it still has a lingering scent of salt, lye, or cow dung that had not been eradicated. The launderer returns it to its owners, who store it in a fragrant casket. And that lingering scent would be eradicated."
    ]
  }
}