{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn22.55": {
    "How an uneducated ordinary person regards the aggregates [sn22.55:13.9]": [
      "They regard form as self, self as having form, form in self, or self in form.",
      "They regard feeling as self, self as having feeling, feeling in self, or self in feeling.",
      "They regard perception as self, self as having perception, perception in self, or self in perception.",
      "They regard choices as self, self as having choices, choices in self, or self in choices.",
      "They regard consciousness as self, self as having consciousness, consciousness in self, or self in consciousness."
    ],
    "How an educated noble disciple regards the aggregates [sn22.55:13.9]": [
      "They don’t regard form as self.",
      "They don’t regard feeling as self.",
      "They don’t regard perception as self.",
      "They don’t regard choices as self.",
      "They don’t regard consciousness as self."
    ],
    "How a mendicant who makes such a resolution can cut off the five lower fetters [sn22.55:13.9]": [
      "The disappearance of form, feeling, perception, choices, and consciousness",
      "The resolution—‘It might not be, and it might not be mine. It will not be, and it will not be mine’",
      "Cutting off the five lower fetters"
    ],
    "How consciousness remains involved with the aggregates (a causal chain) [sn22.55:13.9]": [
      "Consciousness remains involved with form, supported by form, founded on form.",
      "Consciousness remains involved with feeling.",
      "Consciousness remains involved with perception.",
      "Consciousness remains involved with choices, supported by choices, grounded on choices."
    ],
    "How a mendicant can end the defilements in the present life [sn22.55:13.9]": [
      "Giving up greed for the form element",
      "Giving up greed for the feeling element",
      "Giving up greed for the perception element",
      "Giving up greed for the choices element",
      "Giving up greed for the consciousness element",
      "The support is cut off, and there is no foundation for consciousness",
      "The consciousness does not become established and does not grow",
      "With no power to regenerate, it is freed",
      "Being free, it’s stable. Being stable, it’s content. Being content, they’re not anxious. Not being anxious, they personally become extinguished.",
      "They understand: ‘Rebirth is ended … there is no return to any state of existence.’”"
    ]
  }
}