{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn22.79": {
    "The five grasping aggregates [sn22.79:15.4]": [
      "Form",
      "Feeling",
      "Perception",
      "Choices",
      "Consciousness"
    ],
    "The reasons for calling the aggregates by their respective names [sn22.79:15.4]": [
      "Form is deformed by cold, heat, hunger, thirst, and the touch of flies, mosquitoes, wind, sun, and reptiles.",
      "Feeling feels pleasure, pain, and neutral.",
      "Perception perceives blue, yellow, red, and white.",
      "Choices produce conditioned phenomena, including form, feeling, perception, and consciousness.",
      "Consciousness cognizes sour, bitter, pungent, sweet, hot, mild, salty, and bland."
    ],
    "Reflections of a noble disciple [sn22.79:15.4]": [
      "Currently I’m itched by form.",
      "Currently I’m itched by feeling.",
      "Currently I’m itched by perception.",
      "Currently I’m itched by choices.",
      "In the past, I was also itched by form/feeling/perception/choices/consciousness just like now.",
      "If I were to look forward to enjoying form/feeling/perception/choices/consciousness in the future, I’d be itched by form/feeling/perception/choices/consciousness in the future just as I am today."
    ],
    "The things a noble disciple gets rid of and doesn’t accumulate, gives up and doesn’t grasp, discards and doesn’t amass, and dissipates and doesn’t get clouded by (a repetitive sentence structure) [sn22.79:15.4]": [
      "Form/feeling/perception/choices/consciousness",
      "They get rid of it and don’t accumulate it.",
      "They give it up and don’t grasp it.",
      "They discard it and don’t amass it.",
      "They dissipate it and don’t get clouded by it."
    ],
    "The things a mendicant neither gets rid of nor accumulates, neither gives up nor grasps, neither discards nor amasses, and neither dissipates nor gets clouded by (a repetitive sentence structure) [sn22.79:15.4]": [
      "Form/feeling/perception/choices/consciousness",
      "They neither get rid of nor accumulate it, but remain after getting rid of it.",
      "They neither give it up nor grasp it, but remain after giving it up.",
      "They neither discard it nor amass it, but remain after discarding it.",
      "They neither dissipate it nor get clouded by it, but remain after dissipating it."
    ]
  }
}