{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn22.82": {
    "The five grasping aggregates [sn22.82:15.6]": [
      "Form",
      "Feeling",
      "Perception",
      "Choices",
      "Consciousness"
    ],
    "The scope of the term 'aggregates' as applied to the aggregates [sn22.82:15.6]": [
      "Any kind of form at all—past, future, or present; internal or external; coarse or fine; inferior or superior; far or near: this is called the aggregate of form.",
      "Any kind of feeling at all … ",
      "Any kind of perception at all … ",
      "Any kind of choices at all … ",
      "Any kind of consciousness at all—past, future, or present; internal or external; coarse or fine; inferior or superior; far or near: this is called the aggregate of consciousness."
    ],
    "The gratification, the drawback, and the escape when it comes to form, feeling, perception, choices, and consciousness [sn22.82:15.6]": [
      "The pleasure and happiness that arise from form: this is its gratification.",
      "That form is impermanent, suffering, and perishable: this is its drawback.",
      "Removing and giving up desire and greed for form: this is its escape.",
      "The pleasure and happiness that arise from feeling … perception … choices … consciousness: this is its gratification.",
      "That consciousness is impermanent, suffering, and perishable: this is its drawback.",
      "Removing and giving up desire and greed for consciousness: this is its escape."
    ],
    "The questions asked by the mendicant [sn22.82:15.6]": [
      "Are these the five grasping aggregates?",
      "What is the root of these five grasping aggregates?",
      "Can there be different kinds of desire and greed for the five grasping aggregates?",
      "What is the scope of the term ‘aggregates’ as applied to the aggregates?",
      "What is the cause, sir, what is the reason why the aggregate of form is found? What is the cause, what is the reason why the aggregate of feeling … perception … choices … consciousness is found?",
      "How does identity view come about?",
      "How does identity view not come about?",
      "What’s the gratification, the drawback, and the escape when it comes to form, feeling, perception, choices, and consciousness?",
      "How does one know and see so that there’s no ego, possessiveness, or underlying tendency to conceit for this conscious body and all external stimuli?",
      "So it seems, good sir, that form, feeling, perception, choices, and consciousness are not-self. Then what self will the deeds done by not-self affect?"
    ]
  }
}