{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn22.126": {
    "Form, feeling, perception, choices, consciousness [sn22.126:4.15]": [
      "They don’t truly understand form, which is liable to originate, as form which is liable to originate.",
      "They don’t truly understand form, which is liable to vanish, as form which is liable to vanish.",
      "They don’t truly understand form, which is liable to originate and vanish, as form which is liable to originate and vanish.",
      "They don’t truly understand feeling, which is liable to originate, as feeling which is liable to originate.",
      "They don’t truly understand perception, which is liable to originate, as perception which is liable to originate.",
      "They don’t truly understand choices, which are liable to originate, as choices which are liable to originate.",
      "They don’t truly understand consciousness, which is liable to originate, as consciousness which is liable to originate.",
      "They don’t truly understand consciousness, which is liable to vanish, as consciousness which is liable to vanish.",
      "They don’t truly understand consciousness, which is liable to originate and vanish, as consciousness which is liable to originate and vanish."
    ],
    "Knowledge (a repetitive sentence structure) [sn22.126:4.15]": [
      "They truly understand form, which is liable to originate, as form which is liable to originate.",
      "They truly understand form, which is liable to vanish, as form which is liable to vanish.",
      "They truly understand form, which is liable to originate and vanish, as form which is liable to originate and vanish.",
      "They truly understand feeling, which is liable to originate, as feeling which is liable to originate.",
      "They truly understand perception, which is liable to originate, as perception which is liable to originate.",
      "They truly understand choices, which are liable to originate, as choices which are liable to originate.",
      "They truly understand consciousness, which is liable to originate, as consciousness which is liable to originate.",
      "They truly understand consciousness, which is liable to vanish, as consciousness which is liable to vanish.",
      "They truly understand consciousness, which is liable to originate and vanish, as consciousness which is liable to originate and vanish."
    ]
  }
}