{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn22.7": {
    "How grasping leads to anxiety [sn22.7:9.6]": [
      "An uneducated ordinary person has not seen the noble ones",
      "They are neither skilled nor trained in the teaching of the noble ones",
      "They’ve not seen good persons",
      "They are neither skilled nor trained in the teaching of the good persons",
      "They regard form as self, self as having form, form in self, or self in form",
      "That form of theirs decays and perishes",
      "Consciousness latches on to the perishing of form",
      "Anxieties occupy their mind, born of latching on to the perishing of form, and originating in accordance with natural principles",
      "They become frightened, worried, concerned, and anxious because of grasping"
    ],
    "How not grasping leads to freedom from anxiety (a causal chain) [sn22.7:9.6]": [
      "An educated noble disciple has seen the noble ones",
      "They are skilled and trained in the teaching of the noble ones",
      "They’ve seen good persons",
      "They are skilled and trained in the teaching of the good persons",
      "They don’t regard form as self, self as having form, form in self, or self in form",
      "When that form of theirs decays and perishes, consciousness doesn’t latch on to the perishing of form",
      "Anxieties—born of latching on to the perishing of form and originating in accordance with natural principles—don’t occupy their mind",
      "They don’t become frightened, worried, concerned, or anxious because of grasping",
      "They don’t regard feeling as self … ",
      "They don’t regard perception as self … ",
      "They don’t regard choices as self … ",
      "They don’t regard consciousness as self … ",
      "When that consciousness of theirs decays and perishes, consciousness doesn’t latch on to the perishing of consciousness",
      "Anxieties—born of latching on to the perishing of consciousness and originating in accordance with natural principles—don’t occupy their mind",
      "They don’t become frightened, worried, concerned, or anxious because of grasping."
    ]
  }
}