{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn24.5": {
    "The view that arises because of grasping and insisting on what [sn24.5:4.2]": [
      "There’s no meaning in giving, sacrifice, or offerings.",
      "There’s no fruit or result of good and bad deeds.",
      "There’s no afterlife.",
      "There are no duties to mother and father.",
      "No beings are reborn spontaneously.",
      "And there’s no ascetic or brahmin who is well attained and practiced, and who describes the afterlife after realizing it with their own insight.",
      "This person is made up of the four primary elements.",
      "When they die, the earth in their body merges and coalesces with the main mass of earth. The water in their body merges and coalesces with the main mass of water. The fire in their body merges and coalesces with the main mass of fire. The air in their body merges and coalesces with the main mass of air. The faculties are transferred to space. Four men with a bier carry away the corpse. Their footprints show the way to the cemetery. The bones become bleached. Offerings dedicated to the gods end in ashes.",
      "Giving is a doctrine of morons.",
      "When anyone affirms a positive teaching it’s just baseless, false nonsense.",
      "Both the foolish and the astute are annihilated and destroyed when their body breaks up, and don’t exist after death."
    ],
    "The six cases [sn24.5:4.2]": [
      "Doubt in form",
      "Doubt in feeling",
      "Doubt in perception",
      "Doubt in choices",
      "Doubt in consciousness",
      "Doubt in suffering, its origin, its cessation, and the practice that leads to its cessation"
    ],
    "The questions asked by the Buddha [sn24.5:4.2]": [
      "Is form permanent or impermanent?",
      "Is feeling permanent or impermanent?",
      "Is perception permanent or impermanent?",
      "Are choices permanent or impermanent?",
      "Is consciousness permanent or impermanent?",
      "That which is seen, heard, thought, known, sought, and explored by the mind: is that permanent or impermanent?"
    ]
  }
}