{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn24.71": {
    "The view that arises because of grasping and insisting on what [sn24.71:4.2]": [
      "When form exists, because of grasping form and insisting on form",
      "When feeling exists, because of grasping feeling and insisting on feeling",
      "When perception exists, because of grasping perception and insisting on perception",
      "When choices exist, because of grasping choices and insisting on choices",
      "When consciousness exists, because of grasping consciousness and insisting on consciousness"
    ],
    "Questions asked by the speaker [sn24.71:4.2]": [
      "Is form permanent or impermanent?",
      "But if it’s impermanent, is it suffering or happiness?",
      "But if it’s impermanent, suffering, and liable to fall apart, is it fit to be regarded thus: ‘This is mine, I am this, this is my self’?",
      "Is feeling permanent or impermanent?",
      "But if it’s impermanent, is it suffering or happiness?",
      "But if it’s impermanent, suffering, and liable to fall apart, is it fit to be regarded thus: ‘This is mine, I am this, this is my self’?",
      "Is perception permanent or impermanent?",
      "But if it’s impermanent, is it suffering or happiness?",
      "But if it’s impermanent, suffering, and liable to fall apart, is it fit to be regarded thus: ‘This is mine, I am this, this is my self’?",
      "Are choices permanent or impermanent?",
      "But if it’s impermanent, is it suffering or happiness?",
      "But if it’s impermanent, suffering, and liable to fall apart, is it fit to be regarded thus: ‘This is mine, I am this, this is my self’?",
      "Is consciousness permanent or impermanent?",
      "But if it’s impermanent, is it suffering or happiness?",
      "But if it’s impermanent, suffering, and liable to fall apart, is it fit to be regarded thus: ‘This is mine, I am this, this is my self’?"
    ],
    "The things that should be truly seen with right understanding [sn24.71:4.2]": [
      "Any kind of form at all—past, future, or present; internal or external; coarse or fine; inferior or superior; far or near: all form",
      "Any kind of feeling at all—past, future, or present; internal or external; coarse or fine; inferior or superior; far or near: all feeling",
      "Any kind of perception at all—past, future, or present; internal or external; coarse or fine; inferior or superior; far or near: all perception",
      "Any kind of choices at all—past, future, or present; internal or external; coarse or fine; inferior or superior; far or near: all choices",
      "Any kind of consciousness at all—past, future, or present; internal or external; coarse or fine; inferior or superior; far or near: all consciousness"
    ]
  }
}