{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn3.21": {
    "The four people found in the world [sn3.21:21.6]": [
      "The dark bound for darkness",
      "The dark bound for light",
      "The light bound for darkness",
      "The light bound for light"
    ],
    "How a person is dark and bound for darkness [sn3.21:21.6]": [
      "Reborn in a low family",
      "Poor, with little to eat or drink",
      "Ugly, unsightly, deformed, chronically ill",
      "Don't get to have basic necessities and do bad things by way of body, speech, and mind",
      "Reborn in a place of loss, a bad place, the underworld, hell"
    ],
    "How a person is dark and bound for light (a causal sequence) [sn3.21:21.6]": [
      "Reborn in a low family",
      "Poor, with little to eat or drink",
      "Ugly, unsightly, deformed, chronically ill",
      "Don't get to have basic necessities but do good things by way of body, speech, and mind",
      "Reborn in a good place, a heavenly realm"
    ],
    "How a person is light and bound for darkness (a causal sequence) [sn3.21:21.6]": [
      "Reborn in an eminent family",
      "Rich, affluent, and wealthy, with lots of gold and silver, lots of property and assets, and lots of money and grain",
      "Attractive, good-looking, lovely, of surpassing beauty",
      "Get to have basic necessities but do bad things by way of body, speech, and mind",
      "Reborn in a place of loss, a bad place, the underworld, hell"
    ],
    "How a person is light and bound for light (a causal sequence) [sn3.21:21.6]": [
      "Reborn in an eminent family",
      "Rich, affluent, and wealthy, with lots of gold and silver, lots of property and assets, and lots of money and grain",
      "Attractive, good-looking, lovely, of surpassing beauty",
      "Get to have basic necessities and do good things by way of body, speech, and mind",
      "Reborn in a good place, a heavenly realm"
    ],
    "Characteristics of people who fall into terrible hell (a causal sequence) [sn3.21:21.6]": [
      "Poor, faithless and stingy",
      "Miserly, with bad intentions, they lack regard, they have wrong view",
      "Abuse and insult ascetics and brahmins and other renunciates",
      "Nihilists and bullies",
      "Prevent others from giving food to beggars"
    ],
    "Characteristics of people who go to the heaven of the Three and Thirty [sn3.21:21.6]": [
      "Poor, but faithful and not stingy",
      "Give with best of intentions, that peaceful-hearted person",
      "Rise for and bow to ascetics and brahmins and other renunciates",
      "Training in moral conduct",
      "Don't prevent others from giving food to beggars"
    ]
  }
}