{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn3.19": {
    "Consequences of acquiring exceptional wealth by a bad person [sn3.19:8.4]": [
      "They don’t make themselves happy and pleased.",
      "They don’t make their mother and father, partners and children, bondservants, workers, and staff, and friends and colleagues happy and pleased.",
      "They don’t establish an uplifting religious donation for ascetics and brahmins that’s conducive to heaven, ripens in happiness, and leads to heaven.",
      "The wealth is not properly utilized, and rulers or bandits take it, or fire consumes it, or flood sweeps it away, or unloved heirs take it."
    ],
    "Consequences of acquiring exceptional wealth by a good person [sn3.19:8.4]": [
      "They make themselves happy and pleased.",
      "They make their mother and father, partners and children, bondservants, workers, and staff, and friends and colleagues happy and pleased.",
      "They establish an uplifting religious donation for ascetics and brahmins that’s conducive to heaven, ripens in happiness, and leads to heaven.",
      "The wealth is properly utilized, and rulers or bandits don’t take it, fire doesn’t consume it, flood doesn’t sweep it away, and unloved heirs don’t take it."
    ],
    "Comparison of the proper utilization of wealth with the utilization of water [sn3.19:8.4]": [
      "Suppose there was a lotus pond in an uninhabited region with clear, sweet, cool water, clean, with smooth banks, delightful. But people don’t collect it or drink it or bathe in it or use it for any purpose. Since that water is not properly utilized, it’s wasted, not used.",
      "In the same way, when a bad person has acquired exceptional wealth … it’s wasted, not used.",
      "Suppose there was a lotus pond not far from a town or village with clear, sweet, cool water, clean, with smooth banks, delightful. And people collected it and drank it and bathed in it and used it for their own purpose. Since that water is properly utilized, it’s used, not wasted.",
      "In the same way, when a good person has acquired exceptional wealth … it’s used, not wasted."
    ],
    "The duty of a wise and sensible person who acquires wealth (a causal sequence) [sn3.19:8.4]": [
      "They use it and do their duty.",
      "That head, having supported the family unit, blameless, goes to a heavenly place."
    ]
  }
}