{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn35.247": {
    "How someone is unrestrained [sn35.247:6.4]": [
      "When they see a sight with their eyes, if it’s pleasant they hold on to it, but if it’s unpleasant they dislike it.",
      "When they hear a sound with their ears, if it’s pleasant they hold on to it, but if it’s unpleasant they dislike it.",
      "When they smell an odor with their nose, if it’s pleasant they hold on to it, but if it’s unpleasant they dislike it.",
      "When they taste a flavor with their tongue, if it’s pleasant they hold on to it, but if it’s unpleasant they dislike it.",
      "When they feel a touch with their body, if it’s pleasant they hold on to it, but if it’s unpleasant they dislike it.",
      "When they know a thought with their mind, if it’s pleasant they hold on to it, but if it’s unpleasant they dislike it."
    ],
    "How someone is restrained (a causal chain) [sn35.247:6.4]": [
      "When they see a sight with their eyes, if it’s pleasant they don’t hold on to it, and if it’s unpleasant they don’t dislike it.",
      "When they hear a sound with their ears, if it’s pleasant they don’t hold on to it, and if it’s unpleasant they don’t dislike it.",
      "When they smell an odor with their nose, if it’s pleasant they don’t hold on to it, and if it’s unpleasant they don’t dislike it.",
      "When they taste a flavor with their tongue, if it’s pleasant they don’t hold on to it, and if it’s unpleasant they don’t dislike it.",
      "When they feel a touch with their body, if it’s pleasant they don’t hold on to it, and if it’s unpleasant they don’t dislike it.",
      "When they know a thought with their mind, if it’s pleasant they don’t hold on to it, and if it’s unpleasant they don’t dislike it."
    ],
    "Six animals with diverse territories and feeding grounds (a causal chain) [sn35.247:6.4]": [
      "Snake",
      "Crocodile",
      "Bird",
      "Dog",
      "Jackal",
      "Monkey"
    ]
  }
}