{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn35.237": {
    "Functions of body parts [sn35.237:2.7]": [
      "When there are hands, there’s picking up and putting down.",
      "When there are feet, there’s coming and going.",
      "When there are joints, there’s contracting and extending.",
      "When there’s a belly, there’s hunger and thirst."
    ],
    "Internal conditions for arising of pleasure and pain [sn35.237:2.7]": [
      "When there’s an eye, pleasure and pain arise internally conditioned by eye contact.",
      "When there’s an ear, pleasure and pain arise internally conditioned by ear contact.",
      "When there’s a nose, pleasure and pain arise internally conditioned by nose contact.",
      "When there’s a tongue, pleasure and pain arise internally conditioned by tongue contact.",
      "When there’s a body, pleasure and pain arise internally conditioned by body contact.",
      "When there’s a mind, pleasure and pain arise internally conditioned by mind contact."
    ],
    "Functions of body parts when absent (a repetitive sentence structure) [sn35.237:2.7]": [
      "When there are no hands, there’s no picking up and putting down.",
      "When there are no feet, there’s no coming and going.",
      "When there are no joints, there’s no contracting and extending.",
      "When there’s no belly, there’s no hunger and thirst."
    ],
    "Internal conditions for non-arising of pleasure and pain [sn35.237:2.7]": [
      "When there’s no eye, pleasure and pain don’t arise internally conditioned by eye contact.",
      "When there’s no ear, pleasure and pain don’t arise internally conditioned by ear contact.",
      "When there’s no nose, pleasure and pain don’t arise internally conditioned by nose contact.",
      "When there’s no tongue, pleasure and pain don’t arise internally conditioned by tongue contact.",
      "When there’s no body, pleasure and pain don’t arise internally conditioned by body contact.",
      "When there’s no mind, pleasure and pain don’t arise internally conditioned by mind contact."
    ]
  }
}