{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn35.111": {
    "The six senses [sn35.111:1.10]": [
      "the eye",
      "the ear",
      "the nose",
      "the tongue",
      "the body",
      "the mind"
    ],
    "The requirements for ending suffering [sn35.111:1.10]": [
      "Without directly knowing and completely understanding the eye, without dispassion for it and giving it up, you can’t end suffering.",
      "Without directly knowing and completely understanding the ear, without dispassion for it and giving it up, you can’t end suffering.",
      "Without directly knowing and completely understanding the nose, without dispassion for it and giving it up, you can’t end suffering.",
      "Without directly knowing and completely understanding the tongue, without dispassion for it and giving it up, you can’t end suffering.",
      "Without directly knowing and completely understanding the body, without dispassion for it and giving it up, you can’t end suffering.",
      "Without directly knowing and completely understanding the mind, without dispassion for it and giving it up, you can’t end suffering."
    ],
    "The way to end suffering (a repetitive or similar sentence structure) [sn35.111:1.10]": [
      "By directly knowing and completely understanding the eye, having dispassion for it and giving it up, you can end suffering.",
      "By directly knowing and completely understanding the ear, having dispassion for it and giving it up, you can end suffering.",
      "By directly knowing and completely understanding the nose, having dispassion for it and giving it up, you can end suffering.",
      "By directly knowing and completely understanding the tongue, having dispassion for it and giving it up, you can end suffering.",
      "By directly knowing and completely understanding the body, having dispassion for it and giving it up, you can end suffering.",
      "By directly knowing and completely understanding the mind, having dispassion for it and giving it up, you can end suffering."
    ]
  }
}