{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn35.121": {
    "Questions about impermanence and self [sn35.121:53.5]": [
      "Is the eye permanent or impermanent?",
      "But if it’s impermanent, is it suffering or happiness?",
      "But if it’s impermanent, suffering, and liable to fall apart, is it fit to be regarded thus: ‘This is mine, I am this, this is my self’?",
      "Are sights … eye consciousness … eye contact permanent or impermanent?",
      "Anything included in feeling, perception, choices, and consciousness that arises conditioned by eye contact: is that permanent or impermanent?",
      "Is the ear … nose … tongue … body … mind permanent or impermanent?",
      "But if it’s impermanent, is it suffering or happiness?",
      "But if it’s impermanent, suffering, and liable to fall apart, is it fit to be regarded thus: ‘This is mine, I am this, this is my self’?",
      "Are thoughts … mind consciousness … mind contact permanent or impermanent?",
      "Anything included in feeling, perception, choices, and consciousness that arises conditioned by mind contact: is that permanent or impermanent?"
    ],
    "The process of disillusionment (a causal chain) [sn35.121:53.5]": [
      "Seeing this, a learned noble disciple grows disillusioned with the eye, sights, eye consciousness, and eye contact.",
      "And they become disillusioned with anything included in feeling, perception, choices, and consciousness that arises conditioned by eye contact.",
      "They grow disillusioned with the ear … nose … tongue … body …",
      "They grow disillusioned with the mind, thoughts, mind consciousness, and mind contact.",
      "And they grow disillusioned with anything included in feeling, perception, choices, and consciousness that arises conditioned by mind contact.",
      "Being disillusioned, desire fades away.",
      "When desire fades away they’re freed.",
      "When they’re freed, they know they’re freed.",
      "They understand: ‘Rebirth is ended, the spiritual journey has been completed, what had to be done has been done, there is no return to any state of existence.’”"
    ]
  }
}