{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn35.65": {
    "The definition of Māra or what is known as Māra [sn35.65:3.6]": [
      "Where there is the eye, sights, eye consciousness, and phenomena to be known by eye consciousness, there is Māra or what is known as Māra.",
      "Where there is the ear, sounds, ear consciousness, and phenomena to be known by ear consciousness, there is Māra or what is known as Māra.",
      "Where there is the nose, smells, nose consciousness, and phenomena to be known by nose consciousness, there is Māra or what is known as Māra.",
      "Where there is the tongue, tastes, tongue consciousness, and phenomena to be known by tongue consciousness, there is Māra or what is known as Māra.",
      "Where there is the body, touches, body consciousness, and phenomena to be known by body consciousness, there is Māra or what is known as Māra.",
      "Where there is the mind, thoughts, mind consciousness, and phenomena to be known by mind consciousness, there is Māra or what is known as Māra."
    ],
    "The absence of Māra or what is known as Māra (a causal sequence) [sn35.65:3.6]": [
      "Where there is no eye, no sights, no eye consciousness, and no phenomena to be known by eye consciousness, there is no Māra or what is known as Māra.",
      "Where there is no ear, no sounds, no ear consciousness, and no phenomena to be known by ear consciousness, there is no Māra or what is known as Māra.",
      "Where there is no nose, no smells, no nose consciousness, and no phenomena to be known by nose consciousness, there is no Māra or what is known as Māra.",
      "Where there is no tongue, no tastes, no tongue consciousness, and no phenomena to be known by tongue consciousness, there is no Māra or what is known as Māra.",
      "Where there is no body, no touches, no body consciousness, and no phenomena to be known by body consciousness, there is no Māra or what is known as Māra.",
      "Where there is no mind, no thoughts, no mind consciousness, and no phenomena to be known by mind consciousness, there is no Māra or what is known as Māra."
    ]
  }
}