{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn35.234": {
    "Questions about consciousness and not-self [sn35.234:7.5]": [
      "Does eye consciousness arise dependent on the eye and sights?",
      "If the cause and condition that gives rise to eye consciousness were to totally and utterly cease without anything left over, would eye consciousness still be found?",
      "Does ear consciousness arise dependent on the ear and sounds?",
      "If the cause and condition that gives rise to ear consciousness were to totally and utterly cease without anything left over, would ear consciousness still be found?",
      "Does nose consciousness arise dependent on the nose and smells?",
      "If the cause and condition that gives rise to nose consciousness were to totally and utterly cease without anything left over, would nose consciousness still be found?",
      "Does tongue consciousness arise dependent on the tongue and tastes?",
      "If the cause and condition that gives rise to tongue consciousness were to totally and utterly cease without anything left over, would tongue consciousness still be found?",
      "Does body consciousness arise dependent on the body and touches?",
      "If the cause and condition that gives rise to body consciousness were to totally and utterly cease without anything left over, would body consciousness still be found?",
      "Does mind consciousness arise dependent on the mind and thoughts?",
      "If the cause and condition that gives rise to mind consciousness were to totally and utterly cease without anything left over, would mind consciousness still be found?"
    ],
    "The process of cutting down a banana tree (a causal chain) [sn35.234:7.5]": [
      "A person in need of heartwood takes a sharp axe and enters a forest.",
      "They see a big banana tree, straight and young and grown free of defects.",
      "They cut it down at the base, cut off the root, cut off the top, and unroll the coiled sheaths.",
      "They wouldn’t even find sapwood, much less heartwood."
    ],
    "The understanding of a mendicant (a simile) [sn35.234:7.5]": [
      "A mendicant sees these six fields of contact as neither self nor belonging to self.",
      "So seeing, they don’t grasp anything in the world.",
      "Not grasping, they’re not anxious.",
      "Not being anxious, they personally become extinguished.",
      "They understand: ‘Rebirth is ended, the spiritual journey has been completed, what had to be done has been done, there is no return to any state of existence.’”"
    ]
  }
}