{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn36.11": {
    "The three feelings the Buddha has spoken of [sn36.11:2.37]": [
      "Pleasant feeling",
      "Painful feeling",
      "Neutral feeling"
    ],
    "The progressive cessation of conditions [sn36.11:2.37]": [
      "For someone who has attained the first absorption, speech has ceased.",
      "For someone who has attained the second absorption, the placing of the mind and keeping it connected have ceased.",
      "For someone who has attained the third absorption, rapture has ceased.",
      "For someone who has attained the fourth absorption, breathing has ceased.",
      "For someone who has attained the dimension of infinite space, the perception of form has ceased.",
      "For someone who has attained the dimension of infinite consciousness, the perception of the dimension of infinite space has ceased.",
      "For someone who has attained the dimension of nothingness, the perception of the dimension of infinite consciousness has ceased.",
      "For someone who has attained the dimension of neither perception nor non-perception, the perception of the dimension of nothingness has ceased.",
      "For someone who has attained the cessation of perception and feeling, perception and feeling have ceased.",
      "For a mendicant who has ended the defilements, greed, hate, and delusion have ceased."
    ],
    "The progressive stilling of conditions (a causal sequence) [sn36.11:2.37]": [
      "For someone who has attained the first absorption, speech has stilled.",
      "For someone who has attained the second absorption, the placing of the mind and keeping it connected have stilled.",
      "For someone who has attained the cessation of perception and feeling, perception and feeling have stilled.",
      "For a mendicant who has ended the defilements, greed, hate, and delusion have stilled."
    ],
    "The six levels of tranquility (a causal sequence) [sn36.11:2.37]": [
      "For someone who has attained the first absorption, speech has been tranquilized.",
      "For someone who has attained the second absorption, the placing of the mind and keeping it connected have been tranquilized.",
      "For someone who has attained the third absorption, rapture has been tranquilized.",
      "For someone who has attained the fourth absorption, breathing has been tranquilized.",
      "For someone who has attained the cessation of perception and feeling, perception and feeling have been tranquilized.",
      "For a mendicant who has ended the defilements, greed, hate, and delusion have been tranquilized."
    ]
  }
}