{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn36.6": {
    "The difference between an uneducated ordinary person and an educated noble disciple [sn36.6:6.4]": [
      "When an uneducated ordinary person experiences painful physical feelings, they sorrow and wail and lament, beating their breast and falling into confusion.",
      "They experience two feelings: physical and mental.",
      "The underlying tendency for repulsion towards painful feeling underlies that.",
      "The underlying tendency to greed for pleasant feeling underlies that.",
      "The underlying tendency to ignorance about neutral feeling underlies that.",
      "They feel attached to pleasant, painful, and neutral feelings.",
      "They are attached to rebirth, old age, and death, to sorrow, lamentation, pain, sadness, and distress.",
      "When an educated noble disciple experiences painful physical feelings, they don’t sorrow or wail or lament, beating their breast and falling into confusion.",
      "They experience one feeling: physical, not mental.",
      "There’s no underlying tendency for repulsion towards painful feeling underlying that.",
      "There’s no underlying tendency to greed for pleasant feeling underlying that.",
      "There’s no underlying tendency to ignorance about neutral feeling underlying that.",
      "They feel detached from pleasant, painful, and neutral feelings.",
      "They are detached from rebirth, old age, and death, from sorrow, lamentation, pain, sadness, and distress."
    ],
    "The qualities of a wise and learned person (a causal chain) [sn36.6:6.4]": [
      "They are not affected by feelings of pleasure and pain.",
      "Desirable things don’t disturb their mind, nor are they repelled by the undesirable.",
      "Both favoring and opposing are cleared and ended, they are no more.",
      "They know the stainless, sorrowless state.",
      "They have gone beyond rebirth and understand rightly."
    ]
  }
}