{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn36.8": {
    "How a mendicant is mindful [sn36.8:7.4]": [
      "They meditate observing an aspect of the body",
      "They meditate observing an aspect of feelings",
      "They meditate observing an aspect of the mind",
      "They meditate observing an aspect of principles"
    ],
    "How a mendicant is aware [sn36.8:7.4]": [
      "Acting with situational awareness when going out and coming back",
      "Acting with situational awareness when looking ahead and aside",
      "Acting with situational awareness when bending and extending the limbs",
      "Acting with situational awareness when bearing the outer robe, bowl, and robes",
      "Acting with situational awareness when eating, drinking, chewing, and tasting",
      "Acting with situational awareness when urinating and defecating",
      "Acting with situational awareness when walking, standing, sitting, sleeping, waking, speaking, and keeping silent"
    ],
    "Observations made by a mendicant when pleasant feelings arise [sn36.8:7.4]": [
      "A pleasant feeling has arisen in me",
      "That’s dependent, not independent",
      "Dependent on what? Dependent on this very contact",
      "But this contact is impermanent, conditioned, dependently originated",
      "So how could a pleasant feeling be permanent, since it has arisen dependent on contact that is impermanent, conditioned, and dependently originated?"
    ],
    "Observations made by a mendicant when painful feelings arise [sn36.8:7.4]": [
      "A painful feeling has arisen in me",
      "That’s dependent, not independent",
      "Dependent on what? Dependent on this very contact",
      "But this contact is impermanent, conditioned, dependently originated",
      "So how could a painful feeling be permanent, since it has arisen dependent on contact that is impermanent, conditioned, and dependently originated?"
    ],
    "Observations made by a mendicant when neutral feelings arise [sn36.8:7.4]": [
      "A neutral feeling has arisen in me",
      "That’s dependent, not independent",
      "Dependent on what? Dependent on this very contact",
      "But this contact is impermanent, conditioned, dependently originated",
      "So how could a neutral feeling be permanent, since it has arisen dependent on contact that is impermanent, conditioned, and dependently originated?"
    ],
    "The understanding of a mendicant [sn36.8:7.4]": [
      "When my body breaks up and my life is over, everything that’s felt, since I no longer take pleasure in it, will become cool right here",
      "Feeling the end of the body approaching, a mendicant understands: ‘I feel the end of the body approaching.’",
      "Feeling the end of life approaching, they understand: ‘I feel the end of life approaching.’"
    ]
  }
}