{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn40.10": {
    "Reasons to go for refuge to the Buddha, the teaching, and the Saṅgha [sn40.10:46.4]": [
      "It’s good to go for refuge to the Buddha. It’s the reason why some sentient beings, when their body breaks up, after death, are reborn in a good place, a heavenly realm.",
      "It’s good to go for refuge to the teaching. It’s the reason why some sentient beings, when their body breaks up, after death, are reborn in a good place, a heavenly realm.",
      "It’s good to go for refuge to the Saṅgha. It’s the reason why some sentient beings, when their body breaks up, after death, are reborn in a good place, a heavenly realm."
    ],
    "Reasons to have experiential confidence in the Buddha, the teaching, and the Saṅgha [sn40.10:46.4]": [
      "It’s good to have experiential confidence in the Buddha. It’s the reason why some sentient beings, when their body breaks up, after death, are reborn in a good place, a heavenly realm.",
      "It’s good to have experiential confidence in the teaching. It’s the reason why some sentient beings, when their body breaks up, after death, are reborn in a good place, a heavenly realm.",
      "It’s good to have experiential confidence in the Saṅgha. It’s the reason why some sentient beings, when their body breaks up, after death, are reborn in a good place, a heavenly realm."
    ],
    "Qualities of the ethical conduct that’s loved by the noble ones [sn40.10:46.4]": [
      "unbroken",
      "impeccable",
      "spotless",
      "unmarred",
      "liberating",
      "praised by sensible people",
      "not mistaken",
      "leading to immersion"
    ],
    "Qualities of the Saṅgha of the Buddha’s disciples [sn40.10:46.4]": [
      "practicing the way that’s good",
      "direct",
      "methodical",
      "proper",
      "consists of the four pairs",
      "consists of the eight individuals",
      "worthy of offerings dedicated to the gods",
      "worthy of hospitality",
      "worthy of a religious donation",
      "worthy of greeting with joined palms",
      "the supreme field of merit for the world"
    ],
    "Qualities of the Buddha [sn40.10:46.4]": [
      "perfected",
      "a fully awakened Buddha",
      "accomplished in knowledge and conduct",
      "holy",
      "knower of the world",
      "supreme guide for those who wish to train",
      "teacher of gods and humans",
      "awakened",
      "blessed"
    ],
    "Qualities of the gods of the Thirty-Three [sn40.10:46.4]": [
      "divine life span",
      "beauty",
      "happiness",
      "glory",
      "sovereignty",
      "sights",
      "sounds",
      "smells",
      "tastes",
      "touches"
    ]
  }
}