{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn42.13": {
    "The process of mental immersion [sn42.13:33.5]": [
      "Joy springs up in them.",
      "Being joyful, rapture springs up.",
      "When the mind is full of rapture, the body becomes tranquil.",
      "When the body is tranquil, they feel bliss.",
      "And when blissful, the mind becomes immersed in samādhi."
    ],
    "Reflection on the teachings of a good teacher (a repetitive or similar sentence structure) [sn42.13:33.5]": [
      "There is meaning in giving, sacrifice, and offerings.",
      "There are fruits and results of good and bad deeds.",
      "There is an afterlife.",
      "There are duties to mother and father.",
      "There are beings reborn spontaneously.",
      "There are ascetics and brahmins who are well attained and practiced, and who describe the afterlife after realizing it with their own insight."
    ],
    "Reflection on the doctrine and view of a teacher [sn42.13:33.5]": [
      "Nothing bad is done by the doer when they punish, mutilate, torture, aggrieve, oppress, intimidate, or when they encourage others to do the same.",
      "Nothing bad is done when they kill, steal, break into houses, plunder wealth, steal from isolated buildings, commit highway robbery, commit adultery, and lie.",
      "If you were to reduce all the living creatures of this earth to one heap and mass of flesh with a razor-edged chakram, no evil comes of that, and no outcome of evil.",
      "If you were to go along the south bank of the Ganges killing, mutilating, and torturing, and encouraging others to do the same, no evil comes of that, and no outcome of evil.",
      "If you were to go along the north bank of the Ganges giving and sacrificing and encouraging others to do the same, no merit comes of that, and no outcome of merit.",
      "In giving, self-control, restraint, and truthfulness there is no merit or outcome of merit."
    ]
  }
}