{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn44.2": {
    "The four ways a Realized One is described by wanderers [sn44.2:17.13]": [
      "After death, a Realized One exists",
      "After death, a Realized One doesn’t exist",
      "After death, a Realized One both exists and doesn’t exist",
      "After death, a Realized One neither exists nor doesn’t exist"
    ],
    "The five aggregates [sn44.2:17.13]": [
      "Form",
      "Feeling",
      "Perception",
      "Choices",
      "Consciousness"
    ],
    "The understanding of a learned noble disciple [sn44.2:17.13]": [
      "Seeing any kind of form at all with right understanding",
      "Growing disillusioned with form, feeling, perception, choices, and consciousness",
      "Desire fades away",
      "Being freed",
      "Knowing they’re freed"
    ],
    "The questions asked by the Buddha to Anurādha (a causal chain) [sn44.2:17.13]": [
      "Is form permanent or impermanent?",
      "But if it’s impermanent, is it suffering or happiness?",
      "But if it’s impermanent, suffering, and liable to fall apart, is it fit to be regarded thus: ‘This is mine, I am this, this is my self’?",
      "Is feeling … perception … choices … consciousness permanent or impermanent?",
      "What do you think, Anurādha? Do you regard the Realized One as form?",
      "Do you regard the Realized One as feeling … perception … choices … consciousness?",
      "Do you regard the Realized One as in form?",
      "Or do you regard the Realized One as distinct from form?",
      "Do you regard the Realized One as in feeling … or distinct from feeling … as in perception … or distinct from perception … as in choices … or distinct from choices … as in consciousness … or as distinct from consciousness?",
      "Do you regard the Realized One as possessing form, feeling, perception, choices, and consciousness?",
      "Do you regard the Realized One as one who is without form, feeling, perception, choices, and consciousness?"
    ]
  }
}