{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn46.6": {
    "The things that must be developed and cultivated in order to fulfill knowledge and freedom [sn46.6:9.5]": [
      "The seven awakening factors",
      "The four kinds of mindfulness meditation",
      "The three kinds of good conduct",
      "Sense restraint"
    ],
    "The development and cultivation of sense restraint (a causal sequence) [sn46.6:9.5]": [
      "A mendicant sees an agreeable sight with their eye",
      "A mendicant hears an agreeable sound with the ear",
      "A mendicant smells an agreeable odor with the nose",
      "A mendicant tastes an agreeable flavor with the tongue",
      "A mendicant feels an agreeable touch with the body",
      "A mendicant knows an agreeable thought with their mind"
    ],
    "The development and cultivation of the three kinds of good conduct (a causal chain) [sn46.6:9.5]": [
      "Giving up bad conduct by way of body, speech, and mind",
      "Developing good conduct by way of body, speech, and mind"
    ],
    "The development and cultivation of the four kinds of mindfulness meditation (a causal chain) [sn46.6:9.5]": [
      "Meditating by observing an aspect of the body",
      "Meditating by observing an aspect of feelings",
      "Meditating by observing an aspect of mind",
      "Meditating by observing an aspect of principles"
    ],
    "The development and cultivation of the seven awakening factors (a causal chain) [sn46.6:9.5]": [
      "Developing the awakening factor of mindfulness",
      "Developing the awakening factor of investigation of principles",
      "Developing the awakening factor of energy",
      "Developing the awakening factor of rapture",
      "Developing the awakening factor of tranquility",
      "Developing the awakening factor of immersion",
      "Developing the awakening factor of equanimity"
    ]
  }
}