{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn51.21": {
    "The path and practice for developing the bases of psychic power [sn51.21:2.4]": [
      "A mendicant develops the basis of psychic power that has immersion due to enthusiasm and active effort",
      "A mendicant develops the basis of psychic power that has immersion due to energy and active effort",
      "A mendicant develops the basis of psychic power that has immersion due to mental development and active effort",
      "A mendicant develops the basis of psychic power that has immersion due to inquiry and active effort"
    ],
    "The meditative practice for developing the bases of psychic power (a causal sequence) [sn51.21:2.4]": [
      "They think: “My enthusiasm won’t be too lax or too tense. And it’ll be neither constricted internally nor scattered externally.” And they meditate perceiving continuity: as before, so after; as after, so before; as below, so above; as above, so below; as by day, so by night; as by night, so by day. And so, with an open and unenveloped heart, they develop a mind that’s full of radiance.",
      "They think: “My inquiry won’t be too lax or too tense. And it’ll be neither constricted internally nor scattered externally.” And they meditate perceiving continuity: as before, so after; as after, so before; as below, so above; as above, so below; as by day, so by night; as by night, so by day. And so, with an open and unenveloped heart, they develop a mind that’s full of radiance."
    ],
    "The psychic powers that can be wielded (a items expanded upon using repetitive or similar sentence structure) [sn51.21:2.4]": [
      "Multiplying themselves and becoming one again",
      "Controlling the body as far as the Brahmā realm"
    ],
    "The realization that can be achieved [sn51.21:2.4]": [
      "Realizing the undefiled freedom of heart and freedom by wisdom in this very life",
      "Living having realized it with their own insight due to the ending of defilements"
    ]
  }
}