{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn51.20": {
    "The four bases of psychic power [sn51.20:24.2]": [
      "The basis of psychic power that has immersion due to enthusiasm and active effort",
      "The basis of psychic power that has immersion due to energy",
      "The basis of psychic power that has immersion due to mental development",
      "The basis of psychic power that has immersion due to inquiry and active effort"
    ],
    "Different types of enthusiasm [sn51.20:24.2]": [
      "Enthusiasm that’s too lax",
      "Enthusiasm that’s too tense",
      "Enthusiasm that’s constricted internally",
      "Enthusiasm that’s distracted externally"
    ],
    "How a mendicant meditates perceiving continuity [sn51.20:24.2]": [
      "Properly grasping the perception of continuity",
      "Attending to the perception of continuity",
      "Bearing the perception of continuity in mind",
      "Comprehending the perception of continuity with wisdom"
    ],
    "How a mendicant meditates as below, so above; as above, so below (a causal sequence) [sn51.20:24.2]": [
      "Examining their own body up from the soles of the feet and down from the tips of the hairs",
      "Recognizing the different parts of the body",
      "Meditating on the body as below, so above; as above, so below"
    ],
    "Different types of inquiry (a causal sequence) [sn51.20:24.2]": [
      "Inquiry that’s too lax",
      "Inquiry that’s too tense",
      "Inquiry that’s constricted internally",
      "Inquiry that’s distracted externally"
    ],
    "How a mendicant develops a mind that’s full of radiance [sn51.20:24.2]": [
      "Properly grasping the perception of light",
      "Properly grasping the perception of day",
      "Developing a mind that’s full of radiance"
    ],
    "The benefits of developing the four bases of psychic power (a causal sequence) [sn51.20:24.2]": [
      "Wielding many kinds of psychic power",
      "Controlling the body as far as the Brahmā realm",
      "Realizing the undefiled freedom of heart and freedom by wisdom in this very life",
      "Living having realized it with their own insight due to the ending of defilements."
    ]
  }
}