{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn55.6": {
    "The sadness and joy of the chamberlains based on the Buddha's wanderings [sn55.6:18.10]": [
      "When the Buddha sets out from Sāvatthī to wander in the Kosalan lands, they are sad and upset, thinking that he will be far from them.",
      "When the Buddha sets out from the Kosalan lands to wander in the Mallian lands, they are sad and upset, thinking that he will be far from them.",
      "When the Buddha sets out from the Mallian lands to wander in the Vajjian lands, they are sad and upset, thinking that he will be far from them.",
      "When the Buddha sets out from the Vajjian lands to wander in the Kāsian lands, they are sad and upset, thinking that he will be far from them.",
      "When the Buddha sets out from the Kāsian lands to wander in the Māgadhan lands, they are sad and upset, thinking that he will be far from them.",
      "When the Buddha sets out from the Māgadhan lands to wander in the Kāsian lands, they are happy and joyful, thinking that he will be near to them.",
      "When the Buddha sets out from the Kāsian lands to wander in the Vajjian lands, they are happy and joyful, thinking that he will be near to them.",
      "When the Buddha sets out from the Vajjian lands to wander in the Mallian lands, they are happy and joyful, thinking that he will be near to them.",
      "When the Buddha sets out from the Mallian lands to wander in the Kosalan lands, they are happy and joyful, thinking that he will be near to them.",
      "When the Buddha sets out in the Kosalan lands to wander to Sāvatthī, they are happy and joyful, thinking that he will be near to them."
    ],
    "The four things that make a noble disciple a stream-enterer (a causal sequence) [sn55.6:18.10]": [
      "Experiential confidence in the Buddha",
      "Experiential confidence in the teaching",
      "Experiential confidence in the Saṅgha",
      "Living at home rid of the stain of stinginess, freely generous, open-handed, loving to let go, committed to charity, loving to give and to share."
    ],
    "The things the chamberlains share with those who are ethical and of good character [sn55.6:18.10]": [
      "Whatever there is in their family that's available to give."
    ]
  }
}