{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn55.24": {
    "Different types of people and their spiritual status [sn55.24:9.11]": [
      "A lay follower who has for a long time gone for refuge to the Buddha, the teaching, and the Saṅgha, and has realized the undefiled freedom of heart and freedom by wisdom in this very life.",
      "A person who has experiential confidence in the Buddha, the teaching, and the Saṅgha, and has laughing wisdom and swift wisdom, but is not endowed with freedom. With the ending of the five lower fetters, they’re reborn spontaneously and are extinguished there, not liable to return from that world.",
      "A person who has experiential confidence in the Buddha, the teaching, and the Saṅgha, but doesn’t have laughing wisdom or swift wisdom, nor are they endowed with freedom. With the ending of three fetters, and the weakening of greed, hate, and delusion, they’re a once-returner.",
      "A person who has experiential confidence in the Buddha, the teaching, and the Saṅgha, but doesn’t have laughing wisdom or swift wisdom, nor are they endowed with freedom. With the ending of three fetters, they’re a stream-enterer, not liable to be reborn in the underworld, bound for awakening.",
      "A person who doesn’t have experiential confidence in the Buddha, the teaching, and the Saṅgha, but has the faculties of faith, energy, mindfulness, immersion, and wisdom, and accepts the principles proclaimed by the Realized One after considering them with a degree of wisdom.",
      "A person who doesn’t have experiential confidence in the Buddha, the teaching, and the Saṅgha, but has the faculties of faith, energy, mindfulness, immersion, and wisdom, and has a degree of faith and love for the Buddha."
    ],
    "The qualities of Sarakāni [sn55.24:9.11]": [
      "Undertook the training at the time of his death. ",
      "Had gone for refuge to the Buddha, the teaching, and the Saṅgha for a long time."
    ]
  }
}