{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn56.43": {
    "Whatever sensations are experienced in The Mighty Fever [sn56.43:5.1]": [
      "Whatever sight you see with your eye is unlikable, not likable; undesirable, not desirable; unpleasant, not pleasant.",
      "Whatever sound you hear is unlikable, not likable; undesirable, not desirable; unpleasant, not pleasant.",
      "Whatever odor you smell is unlikable, not likable; undesirable, not desirable; unpleasant, not pleasant.",
      "Whatever flavor you taste is unlikable, not likable; undesirable, not desirable; unpleasant, not pleasant.",
      "Whatever touch you feel is unlikable, not likable; undesirable, not desirable; unpleasant, not pleasant.",
      "Whatever thought you know with your mind is unlikable, not likable; undesirable, not desirable; unpleasant, not pleasant."
    ],
    "Ascetics and brahmins who don’t truly understand about suffering [sn56.43:5.1]": [
      "They take pleasure in choices that lead to rebirth",
      "They continue to make such choices",
      "Having made such choices, they burn with the fever of rebirth, old age, and death, of sorrow, lamentation, pain, sadness, and distress.",
      "They’re not freed from rebirth, old age, and death, from sorrow, lamentation, pain, sadness, and distress.",
      "They’re not freed from suffering, I say."
    ],
    "Ascetics and brahmins who truly understand about suffering (a causal chain) [sn56.43:5.1]": [
      "They don’t take pleasure in choices that lead to rebirth",
      "They stop making such choices",
      "Having stopped making such choices, they don’t burn with the fever of rebirth, old age, and death, of sorrow, lamentation, pain, sadness, and distress.",
      "They’re freed from rebirth, old age, and death, from sorrow, lamentation, pain, sadness, and distress.",
      "They’re freed from suffering, I say."
    ]
  }
}