{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "sn56.11": {
    "The two extremes that should not be cultivated by one who has gone forth [sn56.11:14.3]": [
      "Indulgence in sensual pleasures",
      "Indulgence in self-mortification"
    ],
    "The noble eightfold path [sn56.11:14.3]": [
      "Right view",
      "Right thought",
      "Right speech",
      "Right action",
      "Right livelihood",
      "Right effort",
      "Right mindfulness",
      "Right immersion"
    ],
    "The four noble truths [sn56.11:14.3]": [
      "The noble truth of suffering",
      "The noble truth of the origin of suffering",
      "The noble truth of the cessation of suffering",
      "The noble truth of the practice that leads to the cessation of suffering"
    ],
    "The visions that arose in the Buddha (a causal sequence) [sn56.11:14.3]": [
      "This is the noble truth of suffering.",
      "This noble truth of suffering should be completely understood.",
      "This noble truth of suffering has been completely understood.",
      "This is the noble truth of the origin of suffering.",
      "This noble truth of the origin of suffering should be given up.",
      "This noble truth of the origin of suffering has been given up.",
      "This is the noble truth of the cessation of suffering.",
      "This noble truth of the cessation of suffering should be realized.",
      "This noble truth of the cessation of suffering has been realized.",
      "This is the noble truth of the practice that leads to the cessation of suffering.",
      "This noble truth of the practice that leads to the cessation of suffering should be developed.",
      "This noble truth of the practice that leads to the cessation of suffering has been developed."
    ],
    "The gods who raised the cry (a items expanded upon using repetitive or similar sentence structure) [sn56.11:14.3]": [
      "The earth gods",
      "The Gods of the Four Great Kings",
      "The Gods of the Thirty-Three",
      "The Gods of Yama",
      "The Joyful Gods",
      "The Gods Who Love to Create",
      "The Gods Who Control the Creations of Others",
      "The Gods of Brahmā’s Host"
    ]
  }
}