{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn119": {
    "Ten benefits of cultivating mindfulness of the body [mn119:43.3]": [
      "Prevail over desire and discontent",
      "Prevail over fear and dread",
      "Endure physical discomforts and pain",
      "Attain the four absorptions",
      "Wield psychic powers",
      "Possess clairaudience",
      "Understand the minds of other beings",
      "Recollect past lives",
      "Possess clairvoyance",
      "Realize the freedom of heart and wisdom"
    ],
    "Examples of causal chains [mn119:43.3]": [
      "When a mendicant has not developed or cultivated mindfulness of the body, Māra finds a vulnerability and gets hold of them.",
      "When a mendicant has developed and cultivated mindfulness of the body, Māra cannot find a vulnerability and doesn’t get hold of them."
    ],
    "Examples of hypothetical scenarios (a causal chains) [mn119:43.3]": [
      "Suppose there was a dried up, withered log.",
      "Suppose a water jar was placed on a stand, empty and hollow.",
      "Suppose a person were to throw a light ball of string at a door-panel made entirely of hardwood.",
      "Suppose there was a green, sappy log.",
      "Suppose a water jar was placed on a stand, full to the brim so a crow could drink from it.",
      "Suppose there was a square, walled lotus pond on level ground, full to the brim so a crow could drink from it.",
      "Suppose a chariot stood harnessed to thoroughbreds at a level crossroads, with a goad ready."
    ],
    "Examples of repetitive sentence structures [mn119:43.3]": [
      "They enter and remain in the first absorption",
      "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial.",
      "They enter and remain in the second absorption",
      "They enter and remain in the third absorption",
      "They enter and remain in the fourth absorption"
    ]
  }
}