{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn124": {
    "Bakkula's accomplishments in the past 80 years [mn124:41.2]": [
      "No sensual perception has ever arisen in him",
      "No perception of ill will or cruelty has ever arisen in him",
      "No thought of sensuality, ill will, or cruelty has ever arisen in him",
      "He has never accepted a robe from a householder, cut a robe with a knife, sewn a robe with a needle, dyed a robe, sewn a robe during the robe-making ceremony, looked for robe material for his companions in the spiritual life when they are making robes, accepted an invitation, sat down inside a house, eaten inside a house, got caught up in the details of a female's appearance, taught a female, even so much as a four-line verse, gone to the nuns’ quarters, taught the nuns, taught the trainee nuns, taught the novice nuns, given the going forth, given the ordination, given dependence, been looked after by a novice, bathed in the sauna, bathed with bath powder, looked for a massage from his companions in the spiritual life, been ill, even for as long as it takes to pull a cow’s udder, been presented with medicine, even as much as a bit of yellow myrobalan, leaned on a headrest, or prepared a cot."
    ],
    "Kassapa's spiritual journey [mn124:41.2]": [
      "He received the going forth and the ordination in this teaching and training from Venerable Bakkula",
      "He lived alone, withdrawn, diligent, keen, and resolute",
      "He soon realized the supreme end of the spiritual path in this very life",
      "He became one of the perfected"
    ],
    "Bakkula's final moments (a causal sequence) [mn124:41.2]": [
      "He took a key and went from dwelling to dwelling, saying, “Come forth, venerables, come forth! Today will be my final extinguishment.”",
      "He became fully extinguished while sitting right in the middle of the Saṅgha."
    ]
  }
}