{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn142": {
    "Fourteen religious donations to individuals [mn142:14.22]": [
      "A gift to the Realized One, the perfected one, the fully awakened Buddha",
      "A gift to a Buddha awakened for themselves",
      "A gift to a perfected one",
      "A gift to someone practicing to realize the fruit of perfection",
      "A gift to a non-returner",
      "A gift to someone practicing to realize the fruit of non-return",
      "A gift to a once-returner",
      "A gift to someone practicing to realize the fruit of once-return",
      "A gift to a stream-enterer",
      "A gift to someone practicing to realize the fruit of stream-entry",
      "A gift to an outsider who is free of sensual desire",
      "A gift to an ordinary person who has good ethical conduct",
      "A gift to an ordinary person who has bad ethical conduct",
      "A gift to an animal"
    ],
    "Gifts to the following persons and their expected returns [mn142:14.22]": [
      "An animal - a hundred times",
      "An unethical ordinary person - a thousand",
      "An ethical ordinary person - a hundred thousand",
      "An outsider free of sensual desire - 10,000,000,000",
      "Someone practicing to realize the fruit of stream-entry - incalculable, immeasurable returns"
    ],
    "Seven religious donations bestowed on a Saṅgha [mn142:14.22]": [
      "A gift to the communities of both monks and nuns headed by the Buddha",
      "A gift to the communities of both monks and nuns after the Buddha has finally become extinguished",
      "A gift to the Saṅgha of monks",
      "A gift to the Saṅgha of nuns",
      "A gift, thinking: ‘Appoint this many monks and nuns for me from the Saṅgha.’",
      "A gift, thinking: ‘Appoint this many monks for me from the Saṅgha.’",
      "A gift, thinking: ‘Appoint this many nuns for me from the Saṅgha.’"
    ],
    "Four ways of purifying a religious donation [mn142:14.22]": [
      "A religious donation that’s purified by the giver, not the recipient",
      "A religious donation that’s purified by the recipient, not the giver",
      "A religious donation that’s purified by neither the giver nor the recipient",
      "A religious donation that’s purified by both the giver and the recipient"
    ]
  }
}