{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn15": {
    "The qualities that make a mendicant hard to admonish [mn15:8.9]": [
      "A mendicant has wicked desires, having fallen under the sway of wicked desires.",
      "A mendicant glorifies themselves and puts others down.",
      "A mendicant is irritable, overcome by anger.",
      "A mendicant is irritable, and hostile due to anger.",
      "A mendicant is irritable, and stubborn due to anger.",
      "A mendicant is irritable, and blurt out words bordering on anger.",
      "When accused, they object to the accuser.",
      "When accused, they rebuke the accuser.",
      "When accused, they retort to the accuser.",
      "When accused, they dodge the issue, distract the discussion with irrelevant points, and display annoyance, hate, and bitterness.",
      "When accused, they are unable to account for their behavior.",
      "They are offensive and contemptuous.",
      "They’re jealous and stingy.",
      "They’re devious and deceitful.",
      "They’re obstinate and vain.",
      "A mendicant is attached to their own views, holding them tight, and refusing to let go."
    ],
    "The qualities that make a mendicant easy to admonish [mn15:8.9]": [
      "A mendicant doesn’t have wicked desires.",
      "A mendicant isn’t attached to their own views, not holding them tight, but letting them go easily."
    ],
    "The process of checking oneself [mn15:8.9]": [
      "A mendicant should check themselves like this: ‘Do I have wicked desires? Have I fallen under the sway of wicked desires?’",
      "If a mendicant knows that they have fallen under the sway of wicked desires, then they should make an effort to give up those bad, unskillful qualities.",
      "If a mendicant knows that they haven’t fallen under the sway of wicked desires, then they should meditate with rapture and joy, training day and night in skillful qualities.",
      "If a mendicant knows that they are attached to their own views, holding them tight, and refusing to let go, then they should make an effort to give up those bad, unskillful qualities.",
      "If a mendicant knows that they’re not attached to their own views, holding them tight, but let them go easily, then they should meditate with rapture and joy, training day and night in skillful qualities.",
      "If a mendicant sees that they haven’t given up all these bad, unskillful qualities, then they should make an effort to give them all up.",
      "If a mendicant sees that they have given up all these bad, unskillful qualities, then they should meditate with rapture and joy, training day and night in skillful qualities."
    ]
  }
}