{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn16": {
    "The five kinds of emotional barrenness they haven’t given up [mn16:27.9]": [
      "Doubts about the Teacher",
      "Doubts about the teaching",
      "Doubts about the Saṅgha",
      "Doubts about the training",
      "Anger and upset with spiritual companions"
    ],
    "The five emotional shackles they haven’t cut off [mn16:27.9]": [
      "Greed, desire, fondness, thirst, passion, and craving for sensual pleasures",
      "Greed for the body",
      "Greed for form",
      "Eating as much as they like until their belly is full, then indulging in the pleasures of sleeping, lying down, and drowsing",
      "Leading the spiritual life hoping to be reborn in one of the orders of gods"
    ],
    "The five kinds of emotional barrenness they’ve given up [mn16:27.9]": [
      "No doubts about the Teacher",
      "No doubts about the teaching",
      "No doubts about the Saṅgha",
      "No doubts about the training",
      "Not angry and upset with spiritual companions"
    ],
    "The five emotional shackles they’ve cut off [mn16:27.9]": [
      "Rid of greed, desire, fondness, thirst, passion, and craving for sensual pleasures",
      "Rid of greed for the body",
      "Rid of greed for form",
      "Not eating as much as they like until their belly is full, then indulging in the pleasures of sleeping, lying down, and drowsing",
      "Not leading the spiritual life hoping to be reborn in one of the orders of gods"
    ],
    "The basis of psychic power [mn16:27.9]": [
      "Immersion due to enthusiasm, and active effort",
      "Immersion due to energy, and active effort",
      "Immersion due to mental development, and active effort",
      "Immersion due to inquiry, and active effort",
      "Sheer vigor"
    ],
    "The fifteen factors [mn16:27.9]": [
      "The five kinds of emotional barrenness they’ve given up",
      "The five emotional shackles they’ve cut off",
      "The basis of psychic power that has immersion due to enthusiasm, and active effort",
      "The basis of psychic power that has immersion due to energy, and active effort",
      "The basis of psychic power that has immersion due to mental development, and active effort",
      "The basis of psychic power that has immersion due to inquiry, and active effort",
      "Sheer vigor",
      "Breaking out",
      "Becoming awakened",
      "Reaching the supreme sanctuary"
    ]
  }
}