{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn22": {
    "The foolish teaching of self and the cosmos being one and the same [mn22:47.4]": [
      "Someone has the view that the self and the cosmos are one and the same",
      "They hear the Realized One or their disciple teaching Dhamma for the uprooting of all grounds, fixations, obsessions, insistences, and underlying tendencies regarding views",
      "They think, ‘Whoa, I’m going to be annihilated and destroyed! I won’t exist any more!’",
      "They sorrow and wail and lament, beating their breast and falling into confusion."
    ],
    "The correct view of self and the cosmos (a causal sequence) [mn22:47.4]": [
      "Someone doesn't have the view that the self and the cosmos are one and the same",
      "They hear the Realized One or their disciple teaching Dhamma for the uprooting of all grounds, fixations, obsessions, insistences, and underlying tendencies regarding views",
      "It never occurs to them, ‘Whoa, I’m going to be annihilated and destroyed! I won’t exist any more!’",
      "They don’t sorrow and wail and lament, beating their breast and falling into confusion."
    ],
    "The five aggregates (a causal sequence) [mn22:47.4]": [
      "Form",
      "Feeling",
      "Perception",
      "Choices",
      "Consciousness"
    ],
    "The process of liberation [mn22:47.4]": [
      "Giving up ignorance",
      "Giving up transmigrating through births in future lives",
      "Giving up craving",
      "Giving up the five lower fetters",
      "Giving up the conceit ‘I am’"
    ],
    "The four stages of enlightenment (a causal chain) [mn22:47.4]": [
      "Stream-enterers",
      "Once-returners",
      "Non-returners",
      "Arahants"
    ],
    "The qualities of those who have faith and love for the Buddha [mn22:47.4]": [
      "They have a degree of faith and love for the Buddha",
      "They are bound for heaven."
    ]
  }
}