{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn25": {
    "The four herds of deer and their plans to avoid the trapper's bait [mn25:20.4]": [
      "The first herd of deer intruded on where the trapper cast the bait and recklessly enjoyed eating it.",
      "The second herd of deer avoided eating the bait altogether and ventured deep into a wilderness region to live there.",
      "The third herd of deer set up their lair close by the place where the trapper had cast the bait and enjoyed eating it without being reckless.",
      "The fourth herd of deer set up their lair somewhere the trapper and his companions couldn't go and intruded on where the trapper had cast the bait and enjoyed eating it without being reckless."
    ],
    "The eight levels of absorption (a causal sequence) [mn25:20.4]": [
      "The first absorption, which has the rapture and bliss born of seclusion, while placing the mind and keeping it connected.",
      "The second absorption, which has the rapture and bliss born of immersion, with internal clarity and confidence, and unified mind, without placing the mind and keeping it connected.",
      "The third absorption, where they meditate with equanimity, mindful and aware, personally experiencing the bliss of which the noble ones declare, ‘Equanimous and mindful, one meditates in bliss.’",
      "The fourth absorption, without pleasure or pain, with pure equanimity and mindfulness.",
      "The dimension of infinite space.",
      "The dimension of infinite consciousness.",
      "The dimension of nothingness.",
      "The dimension of neither perception nor non-perception."
    ],
    "The terms used in the simile [mn25:20.4]": [
      "‘Bait’ is a term for the five kinds of sensual stimulation.",
      "‘Trapper’ is a term for Māra.",
      "‘Trapper’s companions’ is a term for Māra’s assembly.",
      "‘Deer’ is a term for ascetics and brahmins."
    ]
  }
}