{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn32": {
    "The kind of mendicant who would beautify the park [mn32:17.9]": [
      "A mendicant who is very learned, remembering and keeping what they’ve learned",
      "A mendicant who enjoys retreat and loves retreat",
      "A mendicant who surveys the entire galaxy with clairvoyance that is purified and surpasses the human",
      "A mendicant who lives in the wilderness, eats only almsfood, wears rag robes, and owns just three robes; and they praise these things",
      "When two mendicants engage in discussion about the teaching. They question each other and answer each other’s questions without faltering, and their discussion on the teaching flows on",
      "A mendicant who masters their mind and is not mastered by it. In the morning, they abide in whatever meditation or attainment they want. At midday, and in the evening, they abide in whatever meditation or attainment they want"
    ],
    "The responses of each senior disciple to the question (a multiple items expanded upon using repetitive or similar sentence structures) [mn32:17.9]": [
      "Venerable Ānanda - A mendicant who is very learned, remembering and keeping what they’ve learned",
      "Venerable Revata - A mendicant who enjoys retreat and loves retreat",
      "Venerable Anuruddha - A mendicant who surveys the entire galaxy with clairvoyance that is purified and surpasses the human",
      "Venerable Mahākassapa - A mendicant who lives in the wilderness, eats only almsfood, wears rag robes, and owns just three robes; and they praise these things. They are accomplished in ethics, immersion, wisdom, freedom, and the knowledge and vision of freedom; and they praise these things",
      "Venerable Mahāmoggallāna - When two mendicants engage in discussion about the teaching. They question each other and answer each other’s questions without faltering, and their discussion on the teaching flows on"
    ]
  }
}