{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn34": {
    "The story of the unintelligent Magadhan cowherd [mn34:12.14]": [
      "Drove his cattle across a place with no ford on the Ganges river to the land of the Suvidehans on the northern shore",
      "Cattle bunched up in mid-stream and came to ruin right there"
    ],
    "The story of the intelligent Magadhan cowherd (a narrative) [mn34:12.14]": [
      "Inspected the near shore and the far shore",
      "Drove his cattle across a ford on the Ganges river to the land of the Suvidehans on the northern shore",
      "First drove across the bulls, the fathers and leaders of the herd",
      "Then drove across the strong and tractable cattle",
      "Then drove across the bullocks and heifers",
      "Then drove across the calves and weak cattle",
      "A baby calf had just been born and even it managed to breast the stream of the Ganges and safely reach the far shore"
    ],
    "The mendicants who have crossed the Ganges to safety (a narrative) [mn34:12.14]": [
      "Mendicants who are perfected, who have ended the defilements, completed the spiritual journey, done what had to be done, laid down the burden, achieved their own goal, utterly ended the fetters of rebirth, and are rightly freed through enlightenment",
      "Mendicants who, with the ending of the five lower fetters, are reborn spontaneously. They’re extinguished there, and are not liable to return from that world",
      "Mendicants who, with the ending of three fetters, and the weakening of greed, hate, and delusion, are once-returners. They come back to this world once only, then make an end of suffering",
      "Mendicants who, with the ending of three fetters are stream-enterers, not liable to be reborn in the underworld, bound for awakening",
      "Mendicants who are followers of principles, followers by faith"
    ],
    "The Buddha's skills (a causal sequence) [mn34:12.14]": [
      "Skilled in this world and the other world",
      "Skilled in Māra’s domain and its opposite",
      "Skilled in Death’s domain and its opposite"
    ]
  }
}