{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn35": {
    "The qualities of a mendicant whose mind is freed [mn35:30.7]": [
      "Truly seeing any kind of form with right understanding",
      "Being freed by not grasping",
      "Truly seeing any kind of feeling with right understanding",
      "Truly seeing any kind of perception with right understanding",
      "Truly seeing any kind of choices with right understanding",
      "Truly seeing any kind of consciousness with right understanding"
    ],
    "The qualities of a mendicant who is a perfected one (a repetitive sentence structure) [mn35:30.7]": [
      "Truly seeing any kind of form with right understanding",
      "Being freed by not grasping",
      "Truly seeing any kind of feeling with right understanding",
      "Truly seeing any kind of perception with right understanding",
      "Truly seeing any kind of choices with right understanding",
      "Truly seeing any kind of consciousness with right understanding",
      "Having defilements ended",
      "Having completed the spiritual journey",
      "Having done what had to be done",
      "Having laid down the burden",
      "Having achieved their own true goal",
      "Having utterly ended the fetters of rebirth",
      "Being rightly freed through enlightenment"
    ],
    "The qualities of a mendicant whose mind is freed like this (a repetitive sentence structure) [mn35:30.7]": [
      "Unsurpassable vision",
      "Unsurpassable practice",
      "Unsurpassable freedom"
    ],
    "The things that come from giving to a recipient of a religious donation (a repetitive sentence structure) [mn35:30.7]": [
      "Whatever comes from giving to a recipient of a religious donation such as yourself—who is not free of greed, hate, and delusion—will accrue to the donors.",
      "Whatever comes from giving to a recipient of a religious donation such as myself—who is free of greed, hate, and delusion—will accrue to you."
    ]
  }
}