{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn47": {
    "Things that a mendicant who is an inquirer should scrutinize in the Realized One [mn47:16.6]": [
      "Can anything corrupt be seen or heard in the Realized One or not?",
      "Can anything mixed be seen or heard in the Realized One or not?",
      "Can anything clean be seen or heard in the Realized One or not?",
      "Did the venerable attain this skillful state a long time ago, or just recently?",
      "Are certain dangers found in that venerable mendicant who has achieved fame and renown?",
      "Is this venerable securely stopped or insecurely stopped?"
    ],
    "The Realized One's answers to the questions asked by the mendicant [mn47:16.6]": [
      "Nothing corrupt can be seen or heard in the Realized One.",
      "Nothing mixed can be seen or heard in the Realized One.",
      "Clean things can be seen and heard in the Realized One. "
    ],
    "The process of a disciple approaching a teacher and gaining confidence in the teaching [mn47:16.6]": [
      "A disciple approaches a teacher who has such a doctrine in order to listen to the teaching.",
      "The teacher explains Dhamma with its higher and higher stages, with its better and better stages, with its dark and bright sides.",
      "When they directly know a certain principle of those teachings, in accordance with how they were taught, the mendicant comes to a conclusion about the teachings.",
      "They have confidence in the teacher: ‘The Blessed One is a fully awakened Buddha! The teaching is well explained! The Saṅgha is practicing well!’ "
    ],
    "The evidence for a mendicant's settled and grounded faith in the Realized One (a causal sequence) [mn47:16.6]": [
      "The mendicant approached the Buddha to listen to the teaching.",
      "The Buddha explained Dhamma with its higher and higher stages, with its better and better stages, with its dark and bright sides.",
      "When the mendicant directly knew a certain principle of those teachings, in accordance with how they were taught, they came to a conclusion about the teachings.",
      "They had confidence in the Teacher: “The Blessed One is a fully awakened Buddha! The teaching is well explained! The Saṅgha is practicing well!”"
    ]
  }
}