{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn48": {
    "The six warm-hearted qualities that make for fondness and respect, conducing to inclusion, harmony, and unity, without quarreling [mn48:15.4]": [
      "A mendicant consistently treats their spiritual companions with bodily kindness, both in public and in private.",
      "A mendicant consistently treats their spiritual companions with verbal kindness.",
      "A mendicant consistently treats their spiritual companions with mental kindness.",
      "A mendicant shares without reservation any material possessions they have gained by legitimate means, even the food placed in the alms-bowl, using them in common with their ethical spiritual companions.",
      "A mendicant lives according to the precepts shared with their spiritual companions, both in public and in private.",
      "A mendicant lives according to the view shared with their spiritual companions, both in public and in private."
    ],
    "The knowledge achieved by a noble disciple [mn48:15.4]": [
      "There is nothing that I’m overcome with internally and haven’t given up, because of which I might not accurately know and see.",
      "When I develop, cultivate, and make much of this view, I personally gain serenity and quenching.",
      "There are no ascetics or brahmins outside of the Buddhist community who have the same kind of view that I have.",
      "I have the same nature as a person accomplished in view.",
      "I have the same nature as a person accomplished in view.",
      "I have the same strength as a person accomplished in view.",
      "I have the same strength as a person accomplished in view."
    ],
    "The nature of a person accomplished in view [mn48:15.4]": [
      "Though they may fall into a kind of offense for which rehabilitation has been laid down, they quickly disclose, clarify, and reveal it to the Teacher or a sensible spiritual companion.",
      "Though they might manage a diverse spectrum of duties for their spiritual companions, they still feel a keen regard for the training in higher ethics, higher mind, and higher wisdom."
    ]
  }
}