{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn51": {
    "The things that mendicants avoid [mn51:28.4]": [
      "Injuring plants and seeds",
      "Eating at night and food at the wrong time",
      "Dancing, singing, music, and seeing shows",
      "Beautifying and adorning themselves with garlands, perfumes, and makeup",
      "High and luxurious beds",
      "Receiving gold and money, raw grains, raw meat, women and girls, male and female bondservants, goats and sheep, chickens and pigs, elephants, cows, horses, and mares, and fields and land",
      "Running errands and messages; buying and selling; falsifying weights, metals, or measures; bribery, fraud, cheating, and duplicity; mutilation, murder, abduction, banditry, plunder, and violence"
    ],
    "The things that mendicants are content with [mn51:28.4]": [
      "Robes to look after the body",
      "Almsfood to look after the belly"
    ],
    "The things that mendicants practice restraint with [mn51:28.4]": [
      "Sight",
      "Sound",
      "Smell",
      "Taste",
      "Touch",
      "Thought"
    ],
    "The things that mendicants act with situational awareness (a repetitive or similar sentence structure) [mn51:28.4]": [
      "Going out and coming back",
      "Looking ahead and aside",
      "Bending and extending the limbs",
      "Bearing the outer robe, bowl, and robes",
      "Eating, drinking, chewing, and tasting",
      "Urinating and defecating",
      "Walking, standing, sitting, sleeping, waking, speaking, and keeping silent"
    ],
    "The absorptions that mendicants enter and remain in [mn51:28.4]": [
      "First absorption",
      "Second absorption",
      "Third absorption",
      "Fourth absorption"
    ],
    "The things that mendicants extend their mind toward (a causal sequence) [mn51:28.4]": [
      "Recollection of past lives",
      "Knowledge of the death and rebirth of sentient beings",
      "Knowledge of the ending of defilements"
    ]
  }
}