{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn54": {
    "The eight things that lead to the cutting off of judgments in the noble one’s training [mn54:0.2]": [
      "Killing living creatures should be given up, relying on not killing living creatures.",
      "Stealing should be given up, relying on not stealing.",
      "Lying should be given up, relying on speaking the truth.",
      "Divisive speech should be given up, relying on speech that isn’t divisive.",
      "Greed and lust should be given up, relying on not being greedy and lustful.",
      "Blaming and insulting should be given up, relying on not blaming and not insulting.",
      "Anger and distress should be given up, relying on not being angry and distressed.",
      "Arrogance should be given up, relying on not being arrogant."
    ],
    "The reasons why each of the eight things should be given up [mn54:0.2]": [
      "Killing living creatures is a fetter and a hindrance, and may lead to rebirth in a bad place.",
      "Stealing is a fetter and a hindrance.",
      "Lying is a fetter and a hindrance.",
      "Divisive speech is a fetter and a hindrance.",
      "Greed and lust are fetters and hindrances.",
      "Blaming and insulting are fetters and hindrances.",
      "Anger and distress are fetters and hindrances.",
      "Arrogance is a fetter and a hindrance, and may lead to rebirth in a bad place."
    ],
    "The cutting off of judgments in each and every respect in the noble one’s training [mn54:0.2]": [
      "The eight things that lead to the cutting off of judgments in the noble one’s training.",
      "Detailed analysis of each of the eight things.",
      "The cutting off of judgments in each and every respect in the noble one’s training."
    ],
    "The similes used to illustrate the dangers of sensual pleasures [mn54:26.4]": [
      "The simile of a dog gnawing on a fleshless skeleton",
      "The simile of a vulture, crow, or hawk grabbing a lump of meat",
      "The simile of a person carrying a blazing grass torch",
      "The simile of a person being dragged towards a pit of glowing coals",
      "The simile of a person seeing delightful parks, woods, meadows, and lotus ponds in a dream",
      "The simile of a man borrowing goods and having them taken back"
    ],
    "The equanimity based on unity [mn54:26.4]": [
      "Having truly seen the dangers of sensual pleasures with right understanding, the noble disciple rejects equanimity based on diversity and develops only the equanimity based on unity, where all kinds of grasping to the world’s material delights cease without anything left over."
    ],
    "The recollection of past lives and clairvoyance (a repetitive or similar sentence structure) [mn54:26.4]": [
      "Relying on the supreme purity of mindfulness and equanimity, the noble disciple recollects their many kinds of past lives, with features and details.",
      "Relying on the supreme purity of mindfulness and equanimity, the noble disciple, with clairvoyance that is purified and superhuman, sees sentient beings passing away and being reborn—inferior and superior, beautiful and ugly, in a good place or a bad place. They understand how sentient beings are reborn according to their deeds."
    ],
    "The realization of the undefiled freedom of heart and freedom by wisdom (a repetitive or similar sentence structure) [mn54:26.4]": [
      "Relying on the supreme purity of mindfulness and equanimity, the noble disciple realizes the undefiled freedom of heart and freedom by wisdom in this very life. ",
      "They live having realized it with their own insight due to the ending of defilements."
    ],
    "The cutting off of judgments in the noble one’s training (a repetitive or similar sentence structure) [mn54:26.4]": [
      "That’s how there is the cutting off of judgments in each and every respect in the noble one’s training."
    ],
    "The change in the householder's perspective (a repetitive or similar sentence structure) [mn54:26.4]": [
      "The householder realizes that the wanderers following other paths are not actually thoroughbreds, and he will feed them and treat them accordingly.",
      "He understands that the mendicants actually are thoroughbreds, and he will feed them and treat them accordingly.",
      "The Buddha has inspired him to have love, confidence, and respect for ascetics!"
    ]
  }
}