{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn56": {
    "The Buddha's teachings to Upāli [mn56:0.2]": [
      "Giving",
      "Ethical conduct",
      "Heaven",
      "The drawbacks of sensual pleasures",
      "The benefit of renunciation",
      "The special teaching of the Buddhas: suffering, its origin, its cessation, and the path"
    ],
    "Whose disciple should we remember you as? [mn56:31.1]": [
      "The wise one, free of delusion, rid of barrenness, victor in battle",
      "He’s untroubled and so even-minded, with the virtue of an elder and the wisdom of a saint, immaculate in the midst of it all",
      "He has no indecision, he’s content, joyful, he has spat out the world’s bait; he has completed the ascetic’s task as a human, a man who bears his final body; he’s beyond compare, he’s stainless",
      "The chief bull, immeasurable, profound, sagacious; he is the builder of sanctuary, knowledgeable, firm in principle and restrained; he has got over clinging and is liberated",
      "He’s a giant, living remotely, he’s ended the fetters and is liberated; he’s skilled in dialogue and cleansed, with banner put down, desireless; he’s tamed, and doesn’t proliferate",
      "He is the seventh sage, free of deceit, with three knowledges, he has attained to holiness, he has bathed, he knows philology, he’s tranquil, he understands what is known; he crushes resistance, he is the lord",
      "The noble one, evolved, he has attained the goal and explains it; he is mindful, discerning, neither leaning forward nor pulling back, he’s unstirred, attained to mastery",
      "He has risen up, he practices absorption, not following inner thoughts, he is pure, independent, and fearless; secluded, he has reached the peak, crossed over, he helps others across",
      "He’s peaceful, his wisdom is vast, with great wisdom, he’s free of greed; he is the Realized One, the Holy One, unrivaled, unequaled, assured, and subtle",
      "He has cut off craving and is awakened, free of fuming, unsullied; a mighty spirit worthy of offerings, best of men, inestimable, grand, he has reached the peak of glory. "
    ]
  }
}