{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn6": {
    "Wishes of a mendicant [mn6:20.4]": [
      "May I be liked and approved by my spiritual companions, respected and admired.",
      "May I receive robes, almsfood, lodgings, and medicines and supplies for the sick.",
      "May the services of those whose robes, almsfood, lodgings, and medicines and supplies for the sick I enjoy be very fruitful and beneficial for them.",
      "When deceased family and relatives who have passed away recollect me with a confident mind, may this be very fruitful and beneficial for them.",
      "May I prevail over desire and discontent, and may desire and discontent not prevail over me. May I live having mastered desire and discontent whenever they arose.",
      "May I prevail over fear and dread, and may fear and dread not prevail over me. May I live having mastered fear and dread whenever they arose.",
      "May I get the four absorptions—blissful meditations in the present life that belong to the higher mind—when I want, without trouble or difficulty.",
      "May I have direct meditative experience of the peaceful liberations that are formless, transcending form.",
      "May I, with the ending of three fetters, become a stream-enterer, not liable to be reborn in the underworld, bound for awakening.",
      "May I, with the ending of three fetters, and the weakening of greed, hate, and delusion, become a once-returner, coming back to this world once only, then making an end of suffering.",
      "May I, with the ending of the five lower fetters, be reborn spontaneously and become extinguished there, not liable to return from that world.",
      "May I wield the many kinds of psychic power.",
      "With clairaudience that is purified and superhuman, may I hear both kinds of sounds, human and divine, whether near or far.",
      "May I understand the minds of other beings and individuals, having comprehended them with my mind.",
      "May I recollect many kinds of past lives.",
      "With clairvoyance that is purified and superhuman, may I see sentient beings passing away and being reborn."
    ],
    "Instructions to mendicants [mn6:20.4]": [
      "Live by the ethical precepts and the monastic code.",
      "Live restrained in the monastic code, conducting yourselves well and seeking alms in suitable places.",
      "Seeing danger in the slightest fault, keep the rules you’ve undertaken."
    ]
  }
}