{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn72": {
    "The ten convictions [mn72:22.2]": [
      "The cosmos is eternal.",
      "The cosmos is not eternal.",
      "The world is finite.",
      "The world is infinite.",
      "The soul and the body are the same thing.",
      "The soul and the body are different things.",
      "A Realized One exists after death.",
      "A Realized One doesn’t exist after death.",
      "A Realized One both exists and doesn’t exist after death.",
      "A Realized One neither exists nor doesn’t exist after death."
    ],
    "The principle of a Realized One [mn72:22.2]": [
      "Such is form, such is the origin of form, such is the ending of form.",
      "Such is feeling, such is the origin of feeling, such is the ending of feeling.",
      "Such is perception, such is the origin of perception, such is the ending of perception.",
      "Such are choices, such is the origin of choices, such is the ending of choices.",
      "Such is consciousness, such is the origin of consciousness, such is the ending of consciousness."
    ],
    "The description of a Realized One (a causal chain) [mn72:22.2]": [
      "Any form by which a Realized One might be described has been cut off at the root, made like a palm stump, obliterated, and unable to arise in the future.",
      "Any feeling by which a Realized One might be described has been cut off at the root, made like a palm stump, obliterated, and unable to arise in the future.",
      "Any perception by which a Realized One might be described has been cut off at the root, made like a palm stump, obliterated, and unable to arise in the future.",
      "Any choices by which a Realized One might be described has been cut off at the root, made like a palm stump, obliterated, and unable to arise in the future.",
      "Any consciousness by which a Realized One might be described has been cut off at the root, made like a palm stump, obliterated, and unable to arise in the future."
    ]
  }
}