{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn76": {
    "Four ways that negate the spiritual life [mn76:0.2]": [
      "The first way that negates the spiritual life",
      "The second way that negates the spiritual life",
      "The third way that negates the spiritual life",
      "The fourth way that negates the spiritual life"
    ],
    "Four kinds of unreliable spiritual life [mn76:0.2]": [
      "A certain teacher who claims to be all-knowing and all-seeing",
      "A certain teacher who claims to have supernormal powers",
      "A certain teacher who claims to be a Buddha",
      "A certain teacher who claims to be a fully awakened Buddha"
    ],
    "The four kinds of unreliable spiritual life [mn76:54.4]": [
      "The first kind of unreliable spiritual life",
      "The second kind of unreliable spiritual life",
      "The third kind of unreliable spiritual life",
      "The fourth kind of unreliable spiritual life"
    ],
    "The procedure of the skillful teaching [mn76:54.4]": [
      "A Realized One arises in the world, perfected, a fully awakened Buddha",
      "They give up the five hindrances",
      "They enter and remain in the first absorption",
      "They enter and remain in the second absorption",
      "They enter and remain in the third absorption",
      "They enter and remain in the fourth absorption",
      "They extend their mind toward recollection of past lives",
      "They extend their mind toward knowledge of the death and rebirth of sentient beings",
      "They extend their mind toward knowledge of the ending of defilements"
    ],
    "The five transgressions (a causal chain) [mn76:54.4]": [
      "Deliberately taking the life of a living creature",
      "Taking something with the intention to steal",
      "Having sex",
      "Telling a deliberate lie",
      "Storing up goods for their own enjoyment like they did as a lay person."
    ]
  }
}