{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn79": {
    "The finer things for the sake of which the mendicants lead the spiritual life under the Buddha [mn79:46.7]": [
      "A Realized One arises in the world, perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.",
      "They give up these five hindrances, corruptions of the heart that weaken wisdom.",
      "They enter and remain in the first absorption.",
      "They enter and remain in the second absorption.",
      "They enter and remain in the third absorption.",
      "They enter and remain in the fourth absorption.",
      "They extend their mind toward recollection of past lives.",
      "They extend their mind toward knowledge of the death and rebirth of sentient beings.",
      "They extend their mind toward knowledge of the ending of defilements."
    ],
    "The sequence of recollection of past lives [mn79:46.7]": [
      "One, two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand rebirths.",
      "Many eons of the world contracting.",
      "Many eons of the world expanding.",
      "Many eons of the world contracting and expanding.",
      "Recollection of past lives with features and details."
    ],
    "The sequence of knowledge of the death and rebirth of sentient beings (a causal sequence) [mn79:46.7]": [
      "With clairvoyance that is purified and superhuman, they see sentient beings passing away and being reborn.",
      "Inferior and superior, beautiful and ugly, in a good place or a bad place.",
      "They understand how sentient beings are reborn according to their deeds."
    ],
    "The sequence of knowledge of the ending of defilements (a causal sequence) [mn79:46.7]": [
      "They truly understand: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering’.",
      "They truly understand: ‘These are defilements’ … ‘This is the origin of defilements’ … ‘This is the cessation of defilements’ … ‘This is the practice that leads to the cessation of defilements’.",
      "Knowing and seeing like this, their mind is freed from the defilements of sensuality, desire to be reborn, and ignorance. When they’re freed, they know they’re freed.",
      "They understand: ‘Rebirth is ended, the spiritual journey has been completed, what had to be done has been done, there is no return to any state of existence.’"
    ]
  }
}