{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "mn85": {
    "The three examples that occurred to the Buddha [mn85:0.2]": [
      "The green, sappy log lying in water",
      "The green, sappy log lying on dry land far from water",
      "The dried up, withered log lying on dry land far from water"
    ],
    "The teachings and trainings the Buddha pursued before his awakening [mn85:0.2]": [
      "Approaching Āḷāra Kālāma and realizing the teaching of the dimension of nothingness",
      "Approaching Uddaka, son of Rāma, and realizing the teaching of the dimension of neither perception nor non-perception",
      "Arriving at Senanigama and discovering a delightful park, leading to the three examples that occurred to the Buddha."
    ],
    "The group of five mendicants' realization of the supreme end of the spiritual path [mn85:0.2]": [
      "The group of five mendicants were advised and instructed by the Buddha",
      "They soon realized the supreme end of the spiritual path in this very life",
      "They lived having achieved with their own insight the goal for which gentlemen rightly go forth from the lay life to homelessness"
    ],
    "The five factors that support meditation (a narrative) [mn85:0.2]": [
      "Faith in the Realized One's awakening",
      "Rarely ill or unwell",
      "Good digestion",
      "Honesty and integrity",
      "Energy and wisdom"
    ],
    "The five factors that support meditation [mn85:61.16]": [
      "A mendicant has ethical conduct",
      "They are virtuous",
      "They have learned much",
      "They are mindful",
      "They have good health and vitality"
    ],
    "Achieving distinction in meditation [mn85:61.16]": [
      "They could be instructed in the evening and achieve distinction in the morning",
      "They could be instructed in the morning and achieve distinction in the evening"
    ],
    "Prince Bodhi's refuge to the Buddha, the teaching, and the mendicant Saṅgha (a repetitive sentence structure) [mn85:61.16]": [
      "The prince or princess in my womb goes for refuge to the Buddha, the teaching, and the mendicant Saṅgha",
      "This Prince Bodhi goes for refuge to the Buddha, to the teaching, and to the mendicant Saṅgha",
      "Now for a third time I go for refuge to the Buddha, to the teaching, and to the mendicant Saṅgha"
    ]
  }
}