{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an1.98-139": {
    "Interior factors that are harmful or beneficial [an1.132-139:1.3]": [
      "Negligence",
      "Diligence",
      "Laziness",
      "Arousing energy",
      "Having many wishes",
      "Having few wishes",
      "Lack of contentment",
      "Contentment",
      "Improper attention",
      "Proper attention",
      "Lack of situational awareness",
      "Situational awareness",
      "Pursuing bad habits and not good habits",
      "Pursuing good habits and not bad habits"
    ],
    "Exterior factors that are harmful or beneficial [an1.132-139:1.3]": [
      "Bad friends",
      "Good friends"
    ],
    "Actions that lead to the decline and disappearance or continuation, persistence, and enduring of the true teaching [an1.132-139:1.3]": [
      "Negligence",
      "Diligence",
      "Laziness",
      "Arousing energy",
      "Having many wishes",
      "Having few wishes",
      "Lack of contentment",
      "Contentment",
      "Improper attention",
      "Proper attention",
      "Lack of situational awareness",
      "Situational awareness",
      "Bad friends",
      "Good friends",
      "Pursuing bad habits and not good habits",
      "Pursuing good habits and not bad habits"
    ],
    "Actions that make the true teaching disappear [an1.132-139:1.3]": [
      "Explaining what is not the teaching as the teaching",
      "Explaining what is the teaching as not the teaching",
      "Explaining what is not found in the monastic law as found in the monastic law",
      "Explaining what is found in the monastic law as not found in the monastic law",
      "Explaining what was not spoken and stated by the Realized One as spoken and stated by the Realized One",
      "Explaining what was spoken and stated by the Realized One as not spoken and stated by the Realized One",
      "Explaining what was not practiced by the Realized One as practiced by the Realized One",
      "Explaining what was practiced by the Realized One as not practiced by the Realized One",
      "Explaining what was not prescribed by the Realized One as prescribed by the Realized One",
      "Explaining what was prescribed by the Realized One as not prescribed by the Realized One"
    ]
  }
}