{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an1.616-627": {
    "The importance of mindfulness of the body in enjoying the deathless [an1.627:2.4]": [
      "Those who don’t enjoy mindfulness of the body don’t enjoy the deathless.",
      "Those who enjoy mindfulness of the body enjoy the deathless."
    ],
    "The relationship between mindfulness of the body and the deathless [an1.627:2.4]": [
      "Those who haven’t enjoyed mindfulness of the body haven’t enjoyed the deathless.",
      "Those who have enjoyed mindfulness of the body have enjoyed the deathless."
    ],
    "The consequences of losing or neglecting mindfulness of the body (a repetitive sentence structure) [an1.627:2.4]": [
      "Those who have lost mindfulness of the body have lost the deathless.",
      "Those who haven’t lost mindfulness of the body haven’t lost the deathless.",
      "Those who have neglected mindfulness of the body have neglected the deathless.",
      "Those who have not neglected mindfulness of the body have not neglected the deathless."
    ],
    "The importance of cultivating, developing, practicing, and having insight into mindfulness of the body in understanding and realizing the deathless (a repetitive sentence structure) [an1.627:2.4]": [
      "Those who haven’t cultivated mindfulness of the body haven’t cultivated the deathless.",
      "Those who have cultivated mindfulness of the body have cultivated the deathless.",
      "Those who haven’t developed mindfulness of the body haven’t developed the deathless.",
      "Those who have developed mindfulness of the body have developed the deathless.",
      "Those who haven’t practiced mindfulness of the body haven’t practiced the deathless.",
      "Those who have practiced mindfulness of the body have practiced the deathless.",
      "Those who haven’t had insight into mindfulness of the body haven’t had insight into the deathless.",
      "Those who have had insight into mindfulness of the body have had insight into the deathless.",
      "Those who haven’t completely understood mindfulness of the body haven’t completely understood the deathless.",
      "Those who have completely understood mindfulness of the body have completely understood the deathless.",
      "Those who haven’t realized mindfulness of the body haven’t realized the deathless.",
      "Those who have realized mindfulness of the body have realized the deathless."
    ]
  }
}