{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an1.41-50": {
    "The spike pointing the wrong way and the spike pointing the right way [an1.50:1.2]": [
      "A mendicant whose mind is pointing the wrong way cannot break ignorance, produce knowledge, and realize extinguishment.",
      "A mendicant whose mind is pointing the right way can break ignorance, produce knowledge, and realize extinguishment."
    ],
    "The mind of a person whose mind is corrupted and the mind of a person whose mind is pure (a causal chain) [an1.50:1.2]": [
      "Corruption of mind is the reason why some sentient beings, when their body breaks up, after death, are reborn in a place of loss, a bad place, the underworld, hell.",
      "Purity of mind is the reason why some sentient beings, when their body breaks up, after death, are reborn in a good place, a heavenly realm."
    ],
    "The lake that was cloudy, murky, and muddy and the lake that was transparent, clear, and unclouded (a causal chain) [an1.50:1.2]": [
      "A mendicant whose mind is clouded would not know what’s for their own good, the good of another, or the good of both; or that they would realize any superhuman distinction in knowledge and vision worthy of the noble ones: this is not possible.",
      "A mendicant whose mind is not clouded would know what’s for their own good, the good of another, or the good of both; or that they would realize any superhuman distinction in knowledge and vision worthy of the noble ones: this is possible."
    ],
    "The pliability and workability of the mind (a causal chain) [an1.50:1.2]": [
      "The boxwood is said to be the best kind of tree in terms of its pliability and workability.",
      "A mind that is developed and cultivated is pliable and workable."
    ],
    "The quickness of the mind to change (a comparison) [an1.50:1.2]": [
      "The mind is quick to change.",
      "It’s not easy to give a simile for how quickly the mind changes."
    ],
    "The radiant mind (a comparison) [an1.50:1.2]": [
      "This mind is radiant.",
      "But it’s corrupted by passing corruptions.",
      "And it is freed from passing corruptions."
    ]
  }
}