{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an10.219": {
    "The heart's release by love [an10.219:11.7]": [
      "They meditate spreading a heart full of love to one direction",
      "They meditate spreading a heart full of love to the second direction",
      "They meditate spreading a heart full of love to the third direction",
      "They meditate spreading a heart full of love to the fourth direction",
      "They spread a heart full of love to the whole world"
    ],
    "The heart's release by compassion [an10.219:11.7]": [
      "They meditate spreading a heart full of compassion to one direction",
      "They meditate spreading a heart full of compassion to the second direction",
      "They meditate spreading a heart full of compassion to the third direction",
      "They meditate spreading a heart full of compassion to the fourth direction",
      "They spread a heart full of compassion to the whole world"
    ],
    "The heart's release by rejoicing [an10.219:11.7]": [
      "They meditate spreading a heart full of rejoicing to one direction",
      "They meditate spreading a heart full of rejoicing to the second direction",
      "They meditate spreading a heart full of rejoicing to the third direction",
      "They meditate spreading a heart full of rejoicing to the fourth direction",
      "They spread a heart full of rejoicing to the whole world"
    ],
    "The heart's release by equanimity [an10.219:11.7]": [
      "They meditate spreading a heart full of equanimity to one direction",
      "They meditate spreading a heart full of equanimity to the second direction",
      "They meditate spreading a heart full of equanimity to the third direction",
      "They meditate spreading a heart full of equanimity to the fourth direction",
      "They spread a heart full of equanimity to the whole world"
    ]
  }
}