{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an10.177": {
    "The right and wrong conditions [an10.177:19.2]": [
      "Someone who kills living creatures, steals, and commits sexual misconduct",
      "They use speech that’s false, divisive, harsh, or nonsensical",
      "They’re covetous, malicious, with wrong view",
      "They're reborn in hell",
      "They survive feeding on the food of the hell beings",
      "The gift does not aid the one who lives there"
    ],
    "Different types of people and their rebirths (a causal chain) [an10.177:19.2]": [
      "Someone else who kills living creatures and has wrong view",
      "Someone else who doesn’t kill living creatures, steal, commit sexual misconduct, or use speech that’s false, divisive, harsh, or nonsensical",
      "Someone else who doesn’t kill living creatures and has right view",
      "They're reborn in the animal realm",
      "They're reborn in the human realm",
      "They're reborn in the company of the gods",
      "They're reborn in the ghost realm",
      "They survive feeding on the food of the beings in the animal realm, human realm, or ghost realm",
      "The gift does not aid the one who lives there"
    ],
    "Different types of gifts and their effects [an10.177:19.2]": [
      "Giving to ascetics or brahmins such things as food, drink, clothing, vehicles; garlands, perfumes, and makeup; and bed, house, and lighting",
      "They were reborn in the company of elephants",
      "They were reborn in the company of horses",
      "They were reborn in the company of cattle",
      "They were reborn in the company of dogs",
      "They were reborn in the human realm",
      "They were reborn in the company of the gods",
      "They get to have food and drink, garlands and various adornments, or the five kinds of human/heavenly sensual stimulation",
      "It’s never fruitless for the donor."
    ]
  }
}