{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an10.87": {
    "Qualities that don't conduce to fondness, respect, esteem, harmony, and unity [an10.87:26.4]": [
      "A mendicant raises disciplinary issues and doesn’t praise the settlement of disciplinary issues.",
      "A mendicant doesn’t want to train, and doesn’t praise taking up the training.",
      "A mendicant has bad desires, and doesn’t praise getting rid of desires.",
      "A mendicant is irritable, and doesn’t praise getting rid of anger.",
      "A mendicant denigrates others, and doesn’t praise getting rid of denigration.",
      "A mendicant is devious, and doesn’t praise getting rid of deviousness.",
      "A mendicant is deceitful, and doesn’t praise getting rid of deceitfulness.",
      "A mendicant doesn’t pay attention to the teachings, and doesn’t praise attending to the teachings.",
      "A mendicant is not in retreat, and doesn’t praise retreat.",
      "A mendicant is inhospitable to their spiritual companions, and doesn’t praise hospitality."
    ],
    "Qualities that conduce to fondness, respect, esteem, harmony, and unity [an10.87:26.4]": [
      "A mendicant doesn’t raise disciplinary issues and praises the settlement of disciplinary issues.",
      "A mendicant wants to train, and praises taking up the training.",
      "A mendicant has few desires, and praises getting rid of desires.",
      "A mendicant is not irritable, and praises getting rid of anger.",
      "A mendicant doesn’t denigrate others, and praises getting rid of denigration.",
      "A mendicant isn’t devious, and praises getting rid of deviousness.",
      "A mendicant isn’t deceitful, and praises getting rid of deceitfulness.",
      "A mendicant pays attention to the teachings, and praises attending to the teachings.",
      "A mendicant is in retreat, and praises retreat.",
      "A mendicant is hospitable to their spiritual companions, and praises hospitality."
    ]
  }
}