{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an10.89": {
    "None [an10.89:19.4]": [
      "Kokālika's accusation against Sāriputta and Moggallāna",
      "Buddha's response to Kokālika's accusation",
      "Kokālika's second accusation against Sāriputta and Moggallāna",
      "Buddha's response to Kokālika's second accusation",
      "Kokālika's third accusation against Sāriputta and Moggallāna",
      "Buddha's response to Kokālika's third accusation"
    ],
    "The stages of Kokālika's illness [an10.89:19.4]": [
      "Boils the size of mustard seeds",
      "Boils the size of mung beans",
      "Boils the size of chickpeas",
      "Boils the size of jujube seeds",
      "Boils the size of jujubes",
      "Boils the size of myrobalans",
      "Boils the size of unripe wood apples",
      "Boils the size of ripe wood apples",
      "Bursting of boils and oozing of pus and blood"
    ],
    "The hells and their lifespans (a causal sequence) [an10.89:19.4]": [
      "Abbuda hell (20 lifetimes)",
      "Nirabbuda hell (400 lifetimes)",
      "Ababa hell (8,000 lifetimes)",
      "Aṭaṭa hell (160,000 lifetimes)",
      "Ahaha hell (3,200,000 lifetimes)",
      "Yellow Lotus hell (64,000,000 lifetimes)",
      "Sweet-Smelling hell (1,280,000,000 lifetimes)",
      "Blue Water Lily hell (25,600,000,000 lifetimes)",
      "White Lotus hell (512,000,000,000 lifetimes)",
      "Pink Lotus hell (10,240,000,000,000 lifetimes)"
    ],
    "The verses spoken by Tudu and the Buddha (a causal chain) [an10.89:19.4]": [
      "\"A person is born with an axe in their mouth. A fool cuts themselves with it when they say bad words.\"",
      "\"When you praise someone worthy of criticism, or criticize someone worthy of praise, you choose bad luck with your own mouth: you’ll never find happiness that way.\"",
      "\"Bad luck at dice is a trivial thing, if all you lose is your money and all you own, even yourself. What’s really terrible luck is to hate the holy ones.\"",
      "\"For more than two quinquadecillion years, and another five quattuordecillion years, a slanderer of noble ones goes to hell, having aimed bad words and thoughts at them.\""
    ]
  }
}