{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an10.29": {
    "The foremost in Kāsi and Kosala [an10.29:21.5]": [
      "King Pasenadi of Kosala",
      "Decay and perish"
    ],
    "The galaxy and the Great Brahmā (a causal chain) [an10.29:21.5]": [
      "A galaxy with a thousand moons, suns, Sinerus king of mountains, Indias, Western Continents, Northern Continents, Eastern Continents, four thousand oceans, four thousand Great Kings, a thousand realms of the Gods of the Four Great Kings, a thousand realms of the Gods of the Thirty-Three, of the Gods of Yama, of the Joyful Gods, of the Gods who Love to Create, of the Gods who Control the Creations of Others, and a thousand Brahmā realms",
      "The Great Brahmā",
      "Decay and perish"
    ],
    "The gods of streaming radiance (a causal chain) [an10.29:21.5]": [
      "The realm of streaming radiance",
      "The gods of streaming radiance",
      "Decay and perish"
    ],
    "The ten universal dimensions of meditation (a causal chain) [an10.29:21.5]": [
      "Meditation on universal earth",
      "Meditation on universal water",
      "Meditation on universal fire",
      "Meditation on universal air",
      "Meditation on universal blue",
      "Meditation on universal yellow",
      "Meditation on universal red",
      "Meditation on universal white",
      "Meditation on universal space",
      "Meditation on universal consciousness"
    ],
    "The eight dimensions of mastery [an10.29:21.5]": [
      "Perceiving form internally and seeing visions externally, limited, both pretty and ugly",
      "Perceiving form internally and seeing visions externally, limitless, both pretty and ugly",
      "Not perceiving form internally and seeing visions externally, limited, both pretty and ugly",
      "Not perceiving form internally and seeing visions externally, limitless, both pretty and ugly",
      "Not perceiving form internally and seeing visions externally, blue, with blue color, blue hue, and blue tint",
      "Not perceiving form internally and seeing visions externally, yellow, with yellow color, yellow hue, and yellow tint",
      "Not perceiving form internally and seeing visions externally, red, with red color, red hue, and red tint",
      "Not perceiving form internally and seeing visions externally, white, with white color, white hue, and white tint"
    ],
    "The four ways of practice [an10.29:21.5]": [
      "Painful practice with slow insight",
      "Painful practice with swift insight",
      "Pleasant practice with slow insight",
      "Pleasant practice with swift insight"
    ],
    "The four perceptions [an10.29:21.5]": [
      "Perceiving the limited",
      "Perceiving the expansive",
      "Perceiving the limitless",
      "Perceiving the dimension of nothingness"
    ],
    "The best of the convictions of outsiders [an10.29:21.5]": [
      "‘I might not be, and it might not be mine. I will not be, and it will not be mine.’"
    ],
    "The advocates of ultimate purity of the spirit [an10.29:21.5]": [
      "Going totally beyond the dimension of nothingness, entering and remaining in the dimension of neither perception nor non-perception."
    ]
  }
}