{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an10.76": {
    "Three things that are required for the Realized One to arise in the world [an10.76:21.10]": [
      "Rebirth",
      "Old age",
      "Death"
    ],
    "Three things that need to be given up to give up rebirth, old age, and death [an10.76:21.10]": [
      "Greed",
      "Hate",
      "Delusion"
    ],
    "Three things that need to be given up to give up greed, hate, and delusion [an10.76:21.10]": [
      "Identity view",
      "Doubt",
      "Misapprehension of precepts and observances"
    ],
    "Three things that need to be given up to give up identity view, doubt, and misapprehension of precepts and observances [an10.76:21.10]": [
      "Improper attention",
      "Following a wrong path",
      "Mental sluggishness"
    ],
    "Three things that need to be given up to give up improper attention, following a wrong path, and mental sluggishness [an10.76:21.10]": [
      "Unmindfulness",
      "Lack of situational awareness",
      "Distracted mind"
    ],
    "Three things that need to be given up to give up unmindfulness, lack of situational awareness, and distracted mind [an10.76:21.10]": [
      "Not wanting to see the noble ones",
      "Not wanting to hear the teaching of the noble ones",
      "Fault-finding mind"
    ],
    "Three things that need to be given up to give up not wanting to see the noble ones, not wanting to hear the teaching of the noble ones, and a fault-finding mind [an10.76:21.10]": [
      "Restlessness",
      "Lack of restraint",
      "Unethical conduct"
    ],
    "Three things that need to be given up to give up restlessness, lack of restraint, and unethical conduct [an10.76:21.10]": [
      "Faithlessness",
      "Uncharitableness",
      "Laziness"
    ],
    "Three things that need to be given up to give up faithlessness, uncharitableness, and laziness [an10.76:21.10]": [
      "Disregard",
      "Being hard to admonish",
      "Having bad friends"
    ],
    "Three things that need to be given up to give up disregard, being hard to admonish, and having bad friends [an10.76:21.10]": [
      "Lack of conscience",
      "Imprudence",
      "Negligence"
    ]
  }
}