{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an10.75": {
    "Ten types of people found in the world [an10.75:27.3]": [
      "A certain person who is unethical and doesn't understand the freedom of heart and freedom by wisdom",
      "A certain person who is unethical but understands the freedom of heart and freedom by wisdom",
      "A certain person who is ethical and doesn't understand the freedom of heart and freedom by wisdom",
      "A certain person who is ethical and understands the freedom of heart and freedom by wisdom",
      "A certain person who is very lustful and doesn't understand the freedom of heart and freedom by wisdom",
      "A certain person who is very lustful but understands the freedom of heart and freedom by wisdom",
      "A certain person who is irritable and doesn't understand the freedom of heart and freedom by wisdom",
      "A certain person who is irritable but understands the freedom of heart and freedom by wisdom",
      "A certain person who is restless and doesn't understand the freedom of heart and freedom by wisdom",
      "A certain person who is restless but understands the freedom of heart and freedom by wisdom"
    ],
    "Comparison of judgmental people [an10.75:27.3]": [
      "Judgmental people compare them, saying: ‘This one has just the same qualities as the other, so why is one worse and one better?’ This will be for their lasting harm and suffering.",
      "In this case, the person who is unethical, but truly understands the freedom of heart … and has listened and learned and comprehended theoretically and found at least temporary freedom is better and finer than the other person.",
      "Judgmental people compare them … I, or someone like me, may pass judgment on people.",
      "In this case the person who is restless, but truly understands the freedom of heart … and has listened and learned and comprehended theoretically and found at least temporary freedom is better and finer than the other person. "
    ]
  }
}