{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an2.21-31": {
    "The two fools and the two who are astute [an2.31:1.13]": [
      "One who doesn’t recognize when they’ve made a mistake",
      "One who doesn’t properly accept the confession of someone who’s made a mistake",
      "One who recognizes when they’ve made a mistake",
      "One who properly accepts the confession of someone who’s made a mistake"
    ],
    "The two who misrepresent the Realized One and the two who don’t [an2.31:1.13]": [
      "One who is hateful and hides it, and one whose faith is mistaken",
      "One who explains what was not spoken by the Realized One as spoken by him, and one who explains what was spoken by the Realized One as not spoken by him",
      "One who explains what was not spoken by the Realized One as not spoken by him, and one who explains what was spoken by the Realized One as spoken by him",
      "One who explains a discourse in need of interpretation as a discourse in need of interpretation, and one who explains a discourse whose meaning is explicit as a discourse whose meaning is explicit"
    ],
    "The two destinies of hiding and not hiding misdeeds [an2.31:1.13]": [
      "Hell or the animal realm",
      "As a god or a human"
    ],
    "The two destinies of having wrong and right view [an2.31:1.13]": [
      "Hell or the animal realm",
      "As a god or a human"
    ],
    "The two places waiting to receive an unethical and ethical person [an2.31:1.13]": [
      "Hell and the animal realm",
      "The realms of gods and humans"
    ],
    "The two reasons to frequent remote lodgings in the wilderness and the forest [an2.31:1.13]": [
      "Seeing a happy life for oneself in the present",
      "Having compassion for future generations"
    ],
    "The two things that play a part in realization [an2.31:1.13]": [
      "Serenity",
      "Discernment"
    ],
    "The benefits of developing serenity and discernment [an2.31:1.13]": [
      "The mind is developed",
      "Greed is given up",
      "Wisdom is developed",
      "Ignorance is given up"
    ]
  }
}