{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an2.130-140": {
    "Aspirations of faithful followers [an2.140:1.4]": [
      "May I be like Sāriputta and Moggallāna (for faithful monks)",
      "May I be like the nuns Khemā and Uppalavaṇṇā (for faithful nuns)",
      "May I be like the householder Citta and Hatthaka of Aḷavī (for faithful laymen)",
      "May I be like the laywomen Khujjuttarā and Veḷukaṇṭakī, Nanda’s mother (for faithful laywomen)"
    ],
    "Qualities of foolish, incompetent bad persons and astute, competent good persons [an2.140:1.4]": [
      "Without examining or scrutinizing, they praise those deserving of criticism and they criticize those deserving of praise (for foolish, incompetent bad persons)",
      "After examining and scrutinizing, they criticize those deserving of criticism and they praise those deserving of praise (for astute, competent good persons)"
    ],
    "Qualities of foolish, incompetent bad persons and astute, competent good persons (a causal chain) [an2.140:1.4]": [
      "Without examining or scrutinizing, they arouse faith in things that are dubious, and they don’t arouse faith in things that are inspiring (for foolish, incompetent bad persons)",
      "After examining and scrutinizing, they don’t arouse faith in things that are dubious, and they do arouse faith in things that are inspiring (for astute, competent good persons)"
    ],
    "Actions toward mother and father (a causal chain) [an2.140:1.4]": [
      "Acts wrongly toward mother and father (for foolish, incompetent bad persons)",
      "Acts rightly toward mother and father (for astute, competent good persons)"
    ],
    "Actions toward the Realized One and a disciple of the Realized One (a causal chain) [an2.140:1.4]": [
      "Acts wrongly toward the Realized One and a disciple of the Realized One (for foolish, incompetent bad persons)",
      "Acts rightly toward the Realized One and a disciple of the Realized One (for astute, competent good persons)"
    ],
    "Two things (a causal chain) [an2.140:1.4]": [
      "Cleaning your own mind"
    ],
    "Two things, What two? Cleaning your own mind, and not grasping at anything in the world) [an2.140:1.4]": [
      "Not grasping at anything in the world (for List 6 Name: Two things, What two? Cleaning your own mind, and not grasping at anything in the world)"
    ],
    "Two things [an2.140:1.4]": [
      "Anger",
      "Dispelling anger"
    ],
    "Two things, What two? Anger and hostility) [an2.140:1.4]": [
      "Hostility (for List 7 Name: Two things, What two? Anger and hostility)"
    ],
    "Two things, What two? Dispelling anger and dispelling hostility) [an2.140:1.4]": [
      "Dispelling hostility (for List 8 Name: Two things, What two? Dispelling anger and dispelling hostility)"
    ]
  }
}