{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an2.32-41": {
    "The level of the bad person and the level of the good person [an2.32:0.3]": [
      "The bad person is ungrateful and thankless, for the wicked only know how to be ungrateful and thankless.",
      "The good person is grateful and thankful, for the virtuous only know how to be grateful and thankful."
    ],
    "Actions that would not be enough to repay one's mother and father [an2.33:1.0]": [
      "Carrying your mother around on one shoulder and your father on the other for a hundred years, and anointing, massaging, bathing, and rubbing them, even if they were to defecate and urinate right there.",
      "Establishing your mother and father as supreme monarchs of this great earth, abounding in the seven treasures."
    ],
    "Actions that would be enough to repay one's mother and father [an2.33:1.0]": [
      "Encouraging unfaithful parents in faith",
      "Settling unethical parents in ethical conduct",
      "Grounding stingy parents in generosity",
      "Guiding ignorant parents in wisdom."
    ],
    "Types of conduct that the Buddha teaches inaction and action [an2.34:1.0]": [
      "Inaction regarding bad bodily conduct",
      "Inaction regarding bad verbal conduct",
      "Inaction regarding bad mental conduct",
      "Inaction regarding the many kinds of unskillful things",
      "Action regarding good bodily conduct",
      "Action regarding good verbal conduct",
      "Action regarding good mental conduct",
      "Action regarding the many kinds of skillful things"
    ],
    "The brahmin's statement [an2.34:1.0]": [
      "The brahmin asks the Buddha what he teaches",
      "The Buddha responds that he teaches action and inaction",
      "The brahmin asks how the Buddha teaches action and inaction",
      "The Buddha explains how he teaches action and inaction",
      "The brahmin praises the Buddha and becomes his lay follower."
    ],
    "Kinds of people in the world who are worthy of a religious donation [an2.35:1.0]": [
      "The trainee",
      "The master"
    ],
    "Attributes of the trainee and the master [an2.35:1.0]": [
      "They are worthy of offerings dedicated to the gods",
      "They are upright in body",
      "They are upright in speech",
      "They are upright in mind"
    ],
    "The field for sponsors of sacrifice [an2.35:1.0]": [
      "The trainee and the master are worthy of offerings dedicated to the gods",
      "They are upright in body, speech, and mind",
      "This is the field for sponsors of sacrifice",
      "What's given here is very fruitful."
    ],
    "The person fettered internally and externally [an2.36:1.0]": [
      "A mendicant who is ethical, restrained in the monastic code, conducting themselves well and seeking alms in suitable places",
      "Seeing danger in the slightest fault, they keep the rules they’ve undertaken",
      "When their body breaks up, after death, they’re reborn in one of the orders of gods",
      "When they pass away from there, they’re a returner, who comes back to this state of existence (person fettered internally)",
      "They enter and remain in a certain peaceful state of freed mind",
      "When their body breaks up, after death, they’re reborn in one of the orders of gods",
      "When they pass away from there, they’re a non-returner, not coming back to this state of existence (person fettered externally)"
    ],
    "The practice of a mendicant (a causal sequence) [an2.36:1.0]": [
      "They keep the rules they’ve undertaken",
      "They practice for disillusionment, dispassion, and cessation regarding sensual pleasures",
      "They practice for disillusionment, dispassion, and cessation regarding future lives",
      "They practice for the ending of craving",
      "They practice for the ending of greed",
      "When their body breaks up, after death, they are reborn in one of the orders of gods",
      "When they pass away from there, they are non-returners, not coming back to this state of existence (person fettered externally)"
    ],
    "Reasons for fights among different groups [an2.37:1.0]": [
      "Aristocrats fight with aristocrats because of their insistence on sensual desire, their shackles, avarice, and attachment.",
      "Brahmins fight with brahmins because of their insistence on sensual desire, their shackles, avarice, and attachment.",
      "Householders fight with householders because of their insistence on sensual desire, their shackles, avarice, and attachment.",
      "Ascetics fight with ascetics because of their insistence on views, their shackles, avarice, and attachment."
    ],
    "The Blessed One who has gone beyond the insistence on sensual desire and the insistence on views [an2.37:1.0]": [
      "The Blessed One who is staying in the city of Sāvatthī",
      "The perfected one",
      "The fully awakened Buddha"
    ],
    "Homage to the Blessed One [an2.37:1.0]": [
      "Homage to that Blessed One, the perfected one, the fully awakened Buddha!",
      "Homage to that Blessed One, the perfected one, the fully awakened Buddha!",
      "Homage to that Blessed One, the perfected one, the fully awakened Buddha!"
    ],
    "The consequences of strong bandits and weak kings [an2.39:1.0]": [
      "The king is not at ease when going out or coming back or when touring the provinces",
      "The brahmins and householders are not at ease when going out or coming back, or when inspecting their business activities",
      "The good-hearted mendicants continually adhere to silence in the midst of the Saṅgha, or they stay in the borderlands",
      "This is for the hurt and unhappiness of the people, for the harm, hurt, and suffering of many people, of gods and humans"
    ],
    "The consequences of strong kings and weak bandits (a causal chain) [an2.39:1.0]": [
      "The king is at ease when going out or coming back or when inspecting the provinces",
      "The brahmins and householders are at ease when going out or coming back, or when inspecting their business activities",
      "The bad mendicants continually adhere to silence in the midst of the Saṅgha, or they leave for some place or other",
      "This is for the welfare and happiness of the people, for the benefit, welfare, and happiness of gods and humans."
    ],
    "The consequences of memorizing the discourses incorrectly [an2.41:2.2]": [
      "Memorizing the discourses incorrectly",
      "Taking only a semblance of the phrasing",
      "Shutting out the meaning and the teaching",
      "Acting for the hurt and unhappiness of the people",
      "Making much bad karma",
      "Making the true teaching disappear"
    ],
    "The consequences of memorizing the discourses well (a causal chain) [an2.41:2.2]": [
      "Memorizing the discourses well",
      "Not taking only a semblance of the phrasing",
      "Reinforcing the meaning and the teaching",
      "Acting for the welfare and happiness of the people",
      "Making much merit",
      "Making the true teaching continue."
    ]
  }
}