{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an2.11-20": {
    "The two powers [an2.11:0.3]": [
      "The power of reflection",
      "The power of development"
    ],
    "The power of reflection [an2.11:0.3]": [
      "Reflecting that bad conduct of body, speech, or mind has a bad, painful result in both this life and the next",
      "Giving up bad conduct by way of body, speech, and mind",
      "Developing good conduct by way of body, speech, and mind",
      "Keeping oneself pure"
    ],
    "The power of development (a causal sequence) [an2.11:0.3]": [
      "Relying on the power of a trainee",
      "Giving up greed, hate, and delusion",
      "Not doing anything unskillful or practicing anything bad"
    ],
    "The two powers [an2.12:1.0]": [
      "The power of reflection",
      "The power of development"
    ],
    "The power of reflection [an2.12:1.0]": [
      "Reflecting that bad conduct of body, speech, or mind has a bad, painful result in both this life and the next",
      "Giving up bad conduct by way of body, speech, and mind",
      "Developing good conduct by way of body, speech, and mind",
      "Keeping oneself pure"
    ],
    "The power of development (a causal sequence) [an2.12:1.0]": [
      "Developing the awakening factors of mindfulness, investigation of principles, energy, rapture, tranquility, immersion, and equanimity",
      "Relying on seclusion, fading away, and cessation",
      "Ripening as letting go"
    ],
    "The two powers [an2.13:1.0]": [
      "The power of reflection",
      "The power of development"
    ],
    "The power of reflection [an2.13:1.0]": [
      "Reflecting that bad conduct of body, speech, or mind has a bad, painful result in both this life and the next",
      "Giving up bad conduct by way of body, speech, and mind",
      "Developing good conduct by way of body, speech, and mind",
      "Keeping oneself pure"
    ],
    "The power of development (a causal sequence) [an2.13:1.0]": [
      "Entering and remaining in the first absorption, which has the rapture and bliss born of seclusion, while placing the mind and keeping it connected",
      "Stilling the placing of the mind and keeping it connected, and entering and remaining in the second absorption, which has the rapture and bliss born of immersion, with internal clarity and confidence, and unified mind, without placing the mind and keeping it connected",
      "With the fading away of rapture, entering and remaining in the third absorption, where they meditate with equanimity, mindful and aware, personally experiencing the bliss of which the noble ones declare, ‘Equanimous and mindful, one meditates in bliss.’",
      "Giving up pleasure and pain, and ending former happiness and sadness, entering and remaining in the fourth absorption, without pleasure or pain, with pure equanimity and mindfulness."
    ],
    "The two ways of teaching the Dhamma [an2.14:1.0]": [
      "In brief",
      "In detail"
    ],
    "How to carefully check oneself in a disciplinary issue [an2.15:1.0]": [
      "An offending mendicant reflects on their unskillful offense",
      "They acknowledge that the accusing mendicant saw them commit the offense",
      "They acknowledge that the mistake is theirs alone"
    ],
    "How to carefully check oneself in a disciplinary issue (a causal chain) [an2.15:1.0]": [
      "An accusing mendicant reflects on the unskillful offense committed by the offending mendicant",
      "They acknowledge that they saw the offense being committed",
      "They acknowledge that the mistake is theirs alone"
    ],
    "The consequences of not carefully checking oneself in a disciplinary issue (a causal chain) [an2.15:1.0]": [
      "Neither the offending mendicant nor the accusing mendicant carefully checks themselves",
      "The issue leads to lasting acrimony and enmity",
      "The mendicants won’t live comfortably"
    ],
    "The consequences of carefully checking oneself in a disciplinary issue (a causal chain) [an2.15:1.0]": [
      "Both the offending mendicant and the accusing mendicant carefully check themselves",
      "The issue won’t lead to lasting acrimony and enmity",
      "The mendicants will live comfortably."
    ],
    "The cause of rebirth in a place of loss, a bad place, the underworld, hell [an2.16:1.0]": [
      "Unprincipled and immoral conduct",
      "Rebirth in a place of loss, a bad place, the underworld, hell"
    ],
    "The cause of rebirth in a good place, a heavenly realm (a causal chain) [an2.16:1.0]": [
      "Principled and moral conduct",
      "Rebirth in a good place, a heavenly realm"
    ],
    "The brahmin's response to the Buddha's teaching (a causal chain) [an2.16:1.0]": [
      "Excellent, Master Gotama! Excellent!",
      "As if he was righting the overturned, or revealing the hidden, or pointing out the path to the lost, or lighting a lamp in the dark so people with good eyes can see what’s there, Master Gotama has made the teaching clear in many ways.",
      "I go for refuge to Master Gotama, to the teaching, and to the mendicant Saṅgha.",
      "From this day forth, may Master Gotama remember me as a lay follower who has gone for refuge for life."
    ],
    "The cause of rebirth in a place of loss, a bad place, the underworld, hell [an2.17:1.0]": [
      "Someone has done bad things and not done good things by way of body, speech, and mind",
      "Rebirth in a place of loss, a bad place, the underworld, hell"
    ],
    "The cause of rebirth in a good place, a heavenly realm (a causal chain) [an2.17:1.0]": [
      "Someone has done good things and not done bad things by way of body, speech, and mind",
      "Rebirth in a good place, a heavenly realm"
    ],
    "The brahmin's response to the Buddha's teaching (a causal chain) [an2.17:1.0]": [
      "Excellent, Master Gotama! …",
      "From this day forth, may Master Gotama remember me as a lay follower who has gone for refuge for life."
    ],
    "The drawbacks of doing bad things by way of body, speech, and mind [an2.18:1.0]": [
      "They blame themselves",
      "Sensible people criticize them after examination",
      "They get a bad reputation",
      "They feel lost when they die",
      "Rebirth in a place of loss, a bad place, the underworld, hell"
    ],
    "The benefits of doing good things by way of body, speech, and mind [an2.18:1.0]": [
      "They don’t blame themselves",
      "Sensible people praise them after examination",
      "They get a good reputation",
      "They don’t feel lost when they die",
      "Rebirth in a good place, a heavenly realm"
    ],
    "Giving up the unskillful [an2.19:1.0]": [
      "Give up the unskillful",
      "It is possible to give up the unskillful",
      "Giving up the unskillful leads to welfare and happiness"
    ],
    "Developing the skillful (a causal sequence) [an2.19:1.0]": [
      "Develop the skillful",
      "It is possible to develop the skillful",
      "Developing the skillful leads to welfare and happiness"
    ],
    "Things that lead to the decline and disappearance of the true teaching [an2.20:2.5]": [
      "The words and phrases are misplaced",
      "The meaning is misinterpreted"
    ],
    "Things that lead to the continuation, persistence, and enduring of the true teaching [an2.20:2.5]": [
      "The words and phrases are well organized",
      "The meaning is correctly interpreted"
    ]
  }
}