{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an2.1-10": {
    "The two faults [an2.10:1.4]": [
      "The fault apparent in the present life",
      "The fault to do with lives to come"
    ],
    "The two endeavors that are challenging in the world [an2.10:1.4]": [
      "The endeavor of laypeople staying in a home to provide robes, almsfood, lodgings, and medicines and supplies for the sick",
      "The endeavor of those gone forth from the lay life to homelessness to let go of all attachments"
    ],
    "The two things that are mortifying [an2.10:1.4]": [
      "Someone has done bad things and not done good things, by way of body, speech, and mind",
      "Thinking, ‘I’ve done bad things by way of body, speech, and mind’, they’re mortified. Thinking, ‘I haven’t done good things by way of body, speech, and mind’, they’re mortified."
    ],
    "The two things that are not mortifying [an2.10:1.4]": [
      "Someone has done good things and not done bad things, by way of body, speech, and mind",
      "Thinking, ‘I’ve done good things by way of body, speech, and mind’, they’re not mortified. Thinking, ‘I haven’t done bad things by way of body, speech, and mind’, they’re not mortified."
    ],
    "The two things learned for myself [an2.10:1.4]": [
      "To never be content with skillful qualities",
      "To never stop trying"
    ],
    "The two things [an2.10:1.4]": [
      "Seeing things that are prone to being fettered as gratifying",
      "Seeing things that are prone to being fettered as boring"
    ],
    "The two things that are dark [an2.10:1.4]": [
      "Lack of conscience",
      "Lack of prudence"
    ],
    "The two things that are bright [an2.10:1.4]": [
      "Conscience",
      "Prudence"
    ],
    "The two bright things that protect the world [an2.10:1.4]": [
      "Conscience",
      "Prudence"
    ],
    "The two entries to the rainy season [an2.10:1.4]": [
      "Earlier",
      "Later"
    ]
  }
}