{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an3.123": {
    "The case of a mendicant living supported by a town or village [an3.123:5.9]": [
      "A householder or their child approaches and invites them for the next day’s meal",
      "The mendicant accepts if they want",
      "When the night has passed, they robe up in the morning, take their bowl and robe, and approach that householder’s home, where they sit on the seat spread out",
      "The householder or their child serves and satisfies them with their own hands with a variety of delicious foods"
    ],
    "The thoughts of the mendicant while eating the food (a causal sequence) [an3.123:5.9]": [
      "It’s so good that this householder serves me with a variety of delicious foods",
      "I really hope this householder serves me with a variety of delicious foods in the future, too",
      "They eat that food tied, infatuated, attached, blind to the drawbacks, and not understanding the escape",
      "They think about it with sensual, malicious, or cruel thoughts"
    ],
    "The case of a diligent mendicant living supported by a town or village [an3.123:5.9]": [
      "A householder or their child approaches and invites them for the next day’s meal",
      "The mendicant accepts if they want",
      "When the night has passed, they robe up in the morning, take their bowl and robe, and approach that householder’s home, where they sit on the seat spread out",
      "The householder or their child serves and satisfies them with their own hands with a variety of delicious foods"
    ],
    "The thoughts of the diligent mendicant while eating the food (a causal sequence) [an3.123:5.9]": [
      "It never occurs to them: ‘It’s so good that the householder or their child serves and satisfies me with their own hands with a variety of delicious foods.’",
      "They don’t think: ‘I really hope this householder serves me with a variety of delicious foods in the future, too.’",
      "They eat that almsfood untied, uninfatuated, unattached, seeing the drawback, and understanding the escape",
      "They think about it with thoughts of renunciation, good will, or harmlessness."
    ]
  }
}