{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an3.70": {
    "The three sabbaths [an3.70:0.3]": [
      "The sabbath of the cowherds",
      "The sabbath of the Jains",
      "The sabbath of the noble ones"
    ],
    "How a corrupt mind is cleaned by applying effort [an3.70:0.3]": [
      "Recollecting the Realized One",
      "Recollecting the teaching",
      "Recollecting the Saṅgha",
      "Recollecting one's own ethical conduct",
      "Recollecting the deities"
    ],
    "The noble disciple's observance of the sabbath (a causal chain) [an3.70:0.3]": [
      "Giving up killing living creatures",
      "Giving up stealing",
      "Giving up unchastity"
    ],
    "The eight-factored sabbath [an3.70:40.4]": [
      "Give up lying",
      "Give up alcoholic drinks that cause negligence",
      "Eat in one part of the day, abstaining from eating at night and food at the wrong time",
      "Avoid dancing, singing, music, and seeing shows; and beautifying and adorning themselves with garlands, fragrance, and makeup",
      "Give up high and luxurious beds",
      "Be celibate, refraining from sex",
      "Don’t kill living creatures, steal, or drink alcohol",
      "Don’t eat at night, the wrong time, and sleep on a low bed or a mat on the ground"
    ],
    "The different realms and their time scales [an3.70:40.4]": [
      "The gods of the Four Great Kings",
      "The Gods of the Thirty-Three",
      "The Gods of Yama",
      "The Joyful Gods",
      "The Gods Who Love to Create",
      "The Gods Who Control the Creations of Others"
    ],
    "The different time scales for each realm [an3.70:40.4]": [
      "Fifty years in the human realm is one day and night for the gods of the Four Great Kings",
      "A hundred years in the human realm is one day and night for the Gods of the Thirty-Three",
      "Two hundred years in the human realm is one day and night for the Gods of Yama",
      "Four hundred years in the human realm is one day and night for the Joyful Gods",
      "Eight hundred years in the human realm is one day and night for the Gods Who Love to Create",
      "Sixteen hundred years in the human realm is one day and night for the Gods Who Control the Creations of Others"
    ]
  }
}