{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an4.87": {
    "The four people found in the world [an4.87:7.2]": [
      "The confirmed ascetic",
      "The white lotus ascetic",
      "The pink lotus ascetic",
      "The exquisite ascetic of ascetics"
    ],
    "How a person is a confirmed ascetic [an4.87:7.2]": [
      "A mendicant is a practicing trainee",
      "Lives aspiring to the supreme sanctuary",
      "Has not yet been anointed, but is eligible",
      "Has been confirmed in the succession"
    ],
    "How a person is a white lotus ascetic (a causal chain) [an4.87:7.2]": [
      "A mendicant realizes the undefiled freedom of heart and freedom by wisdom in this very life",
      "Lives having realized it with their own insight due to the ending of defilements",
      "Does not have direct meditative experience of the eight liberations"
    ],
    "How a person is a pink lotus ascetic (a causal chain) [an4.87:7.2]": [
      "A mendicant realizes the undefiled freedom of heart and freedom by wisdom in this very life",
      "Has direct meditative experience of the eight liberations"
    ],
    "How a person is an exquisite ascetic of ascetics (a causal chain) [an4.87:7.2]": [
      "Usually uses only what they’ve been invited to accept",
      "Rarely uses them without invitation",
      "Usually treats other spiritual practitioners agreeably by way of body, speech, and mind, and rarely disagreeably",
      "Usually presents them with agreeable things, rarely with disagreeable ones",
      "Healthy, so the various unpleasant feelings usually don’t come up",
      "Gets the four absorptions when they want, without trouble or difficulty",
      "Realizes the undefiled freedom of heart and freedom by wisdom in this very life"
    ],
    "The qualities of the speaker that make him an exquisite ascetic of ascetics (a causal chain) [an4.87:7.2]": [
      "Usually uses only what he’s been invited to accept",
      "Treats other spiritual practitioners agreeably by way of body, speech, and mind, and rarely disagreeably",
      "Healthy, so the various unpleasant feelings usually don’t come up",
      "Gets the four absorptions when he wants, without trouble or difficulty",
      "Has realized the undefiled freedom of heart and freedom by wisdom in this very life."
    ]
  }
}