{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an4.184": {
    "Those frightened of death [an4.184:11.1]": [
      "Someone who isn’t free of greed, desire, fondness, thirst, passion, and craving for sensual pleasures",
      "When they fall seriously ill, they think: ‘The sensual pleasures that I love so much will leave me, and I’ll leave them.’",
      "They sorrow and wail and lament, beating their breast and falling into confusion."
    ],
    "Those not frightened of death (a causal chain) [an4.184:11.1]": [
      "Someone who is rid of greed, desire, fondness, thirst, passion, and craving for sensual pleasures",
      "When they fall seriously ill, they don’t think: ‘The sensual pleasures that I love so much will leave me, and I’ll leave them.’",
      "They don’t sorrow and wail and lament, beating their breast and falling into confusion."
    ],
    "Those not frightened of death (continued) (a causal chain) [an4.184:11.1]": [
      "Someone who is rid of greed, desire, fondness, thirst, passion, and craving for the body",
      "When they fall seriously ill, they don’t think: ‘This body that I love so much will leave me, and I’ll leave it.’",
      "They don’t sorrow and wail and lament, beating their breast and falling into confusion.",
      "Someone who hasn’t done bad, violent, and corrupt deeds, but has done good and skillful deeds that keep them safe",
      "When they fall seriously ill, they think: ‘Well, I haven’t done bad, violent, and depraved things. And I have done good and skillful deeds that keep me safe. When I depart, I’ll go to the place where people who’ve done such things go.’",
      "They don’t sorrow and wail and lament, beating their breast and falling into confusion.",
      "Someone who’s not doubtful, uncertain, or undecided about the true teaching",
      "When they fall seriously ill, they think: ‘I’m not doubtful, uncertain, or undecided about the true teaching.’",
      "They don’t sorrow and wail and lament, beating their breast and falling into confusion."
    ]
  }
}