{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an4.194": {
    "The four factors of trying to be pure [an4.194:7.1]": [
      "The factor of trying to be pure in ethics",
      "The factor of trying to be pure in mind",
      "The factor of trying to be pure in view",
      "The factor of trying to be pure in freedom"
    ],
    "The factor of trying to be pure in ethics [an4.194:7.1]": [
      "A mendicant is ethical",
      "Restrained in the code of conduct",
      "With good behavior and supporters",
      "Seeing danger in the slightest fault",
      "Keeping the rules they’ve undertaken",
      "Fulfilling purity of ethics or supporting it in every situation by wisdom",
      "Enthusiasm for that—their effort, zeal, vigor, perseverance, mindfulness, and situational awareness"
    ],
    "The factor of trying to be pure in mind (a causal chain) [an4.194:7.1]": [
      "A mendicant, quite secluded from sensual pleasures",
      "Secluded from unskillful qualities",
      "Enters and remains in the first absorption",
      "Enters and remains in the second absorption",
      "Enters and remains in the third absorption",
      "Enters and remains in the fourth absorption",
      "Fulfilling purity of mind or supporting it in every situation by wisdom",
      "Enthusiasm for that—their effort, zeal, vigor, perseverance, mindfulness, and situational awareness"
    ],
    "The factor of trying to be pure in view (a causal chain) [an4.194:7.1]": [
      "A mendicant who truly understands",
      "This is suffering",
      "This is the origin of suffering",
      "This is the cessation of suffering",
      "This is the practice that leads to the cessation of suffering",
      "Fulfilling purity of view or supporting it in every situation by wisdom",
      "Enthusiasm for that—their effort, zeal, vigor, perseverance, mindfulness, and situational awareness"
    ],
    "The factor of trying to be pure in freedom (a causal chain) [an4.194:7.1]": [
      "A noble disciple who has these factors of trying to be pure in ethics, mind, and view",
      "Detaches their mind from things that arouse greed",
      "Frees their mind from things that it should be freed from",
      "Experiences perfect freedom",
      "Fulfilling purity of freedom or supporting it in every situation by wisdom",
      "Enthusiasm for that—their effort, zeal, vigor, perseverance, mindfulness, and situational awareness"
    ]
  }
}