{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an4.171": {
    "The three types of intention that cause pleasure and pain to arise in oneself [an4.171:10.2]": [
      "The intention that gives rise to bodily action",
      "The intention that gives rise to verbal action",
      "The intention that gives rise to mental action"
    ],
    "The four kinds of reincarnation (a causal chain) [an4.171:10.2]": [
      "Reincarnation where one’s own intention is effective, not that of others",
      "Reincarnation where the intention of others is effective, not one’s own",
      "Reincarnation where both one’s own and others’ intentions are effective",
      "Reincarnation where neither one’s own nor others’ intentions are effective"
    ],
    "The cause and reason for some sentient beings to be returners and others to be non-returners [an4.171:10.2]": [
      "A person who hasn’t given up the lower fetters enters and abides in the dimension of neither perception nor non-perception",
      "They enjoy it and like it and find it satisfying",
      "If they abide in that, are committed to it, and meditate on it often without losing it, when they die they’re reborn in the company of the gods of the dimension of neither perception nor non-perception",
      "When they pass away from there, they’re a returner, who comes back to this state of existence",
      "A person who has given up the lower fetters enters and abides in the dimension of neither perception nor non-perception",
      "They enjoy it and like it and find it satisfying",
      "If they abide in that, are committed to it, and meditate on it often without losing it, when they die they’re reborn in the company of the gods of the dimension of neither perception nor non-perception",
      "When they pass away from there, they’re a non-returner, not coming back to this state of existence."
    ]
  }
}