{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an4.37": {
    "Four qualities of a mendicant who can't decline and has drawn near to extinguishment [an4.37:8.4]": [
      "Accomplished in ethics",
      "Guards the sense doors",
      "Eats in moderation",
      "Dedicated to wakefulness"
    ],
    "How a mendicant is accomplished in ethics [an4.37:8.4]": [
      "Ethical",
      "Restrained in the monastic code",
      "Conducting themselves well",
      "Seeking alms in suitable places",
      "Seeing danger in the slightest fault",
      "Keeping the rules they’ve undertaken"
    ],
    "How a mendicant guards the sense doors (a causal sequence) [an4.37:8.4]": [
      "Seeing a sight with their eyes",
      "Hearing a sound with their ears",
      "Smelling an odor with their nose",
      "Tasting a flavor with their tongue",
      "Feeling a touch with their body",
      "Knowing a thought with their mind"
    ],
    "How a mendicant eats in moderation (a causal sequence) [an4.37:8.4]": [
      "Reflecting properly on the food they eat",
      "Not eating for fun, indulgence, adornment, or decoration",
      "Eating only to sustain the body, avoid harm, and support spiritual practice",
      "Putting an end to old discomfort and not giving rise to new discomfort",
      "Living blamelessly and at ease"
    ],
    "How a mendicant is dedicated to wakefulness (a causal sequence) [an4.37:8.4]": [
      "Practicing walking and sitting meditation by day",
      "Purifying their mind from obstacles",
      "Practicing walking and sitting meditation in the evening",
      "Lying down in the lion’s posture in the middle of the night",
      "Getting up in the last part of the night and continuing to practice walking and sitting meditation",
      "Purifying their mind from obstacles"
    ],
    "Qualities of a mendicant who lives with keen energy, tireless all night and day, developing skillful qualities, for the sake of finding sanctuary (a causal sequence) [an4.37:8.4]": [
      "Established in ethics",
      "Restrained in the sense faculties",
      "Eating in moderation",
      "Dedicated to wakefulness"
    ],
    "Qualities of a mendicant who loves to be diligent, seeing fear in negligence [an4.37:8.4]": [
      "Can't decline",
      "Has drawn near to extinguishment"
    ]
  }
}