{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an4.190": {
    "The qualities of the Saṅgha of monks [an4.190:7.3]": [
      "It has no nonsense",
      "It consists purely of the essential core",
      "It is rarely seen in the world",
      "It is worthy of offerings dedicated to the gods",
      "It is worthy of hospitality",
      "It is worthy of a religious donation",
      "It is worthy of greeting with joined palms",
      "It is the supreme field of merit for the world"
    ],
    "The attainments of the monks staying in the Saṅgha [an4.190:7.3]": [
      "Attainment to the gods",
      "Attainment to Brahmā",
      "Attainment to the imperturbable",
      "Attainment to nobility"
    ],
    "The ways a monk attains to the gods [an4.190:7.3]": [
      "Secluded from sensual pleasures",
      "Secluded from unskillful qualities",
      "Enters and remains in the first absorption",
      "Enters and remains in the second absorption",
      "Enters and remains in the third absorption",
      "Enters and remains in the fourth absorption"
    ],
    "The ways a monk attains to Brahmā (a causal chain) [an4.190:7.3]": [
      "Meditates spreading a heart full of love",
      "Meditates spreading a heart full of compassion",
      "Meditates spreading a heart full of rejoicing",
      "Meditates spreading a heart full of equanimity"
    ],
    "The ways a monk attains to the imperturbable (a causal chain) [an4.190:7.3]": [
      "Going totally beyond perceptions of form",
      "With the ending of perceptions of impingement",
      "Not focusing on perceptions of diversity",
      "Aware that ‘space is infinite’, enters and remains in the dimension of infinite space",
      "Aware that ‘consciousness is infinite’, enters and remains in the dimension of infinite consciousness",
      "Aware that ‘there is nothing at all’, enters and remains in the dimension of nothingness",
      "Enters and remains in the dimension of neither perception nor non-perception"
    ],
    "The ways a monk attains to nobility (a causal chain) [an4.190:7.3]": [
      "Truly understands ‘This is suffering’",
      "Truly understands ‘This is the origin of suffering’",
      "Truly understands ‘This is the cessation of suffering’",
      "Truly understands ‘This is the practice that leads to the cessation of suffering’"
    ]
  }
}