{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an4.53": {
    "The four ways of living together [an4.53:12.4]": [
      "A male zombie living with a female zombie",
      "A male zombie living with a goddess",
      "A god living with a female zombie",
      "A god living with a goddess"
    ],
    "How a male zombie lives with a female zombie [an4.53:12.4]": [
      "The husband kills living creatures, steals, commits sexual misconduct, lies, and uses alcoholic drinks that cause negligence",
      "He’s unethical, of bad character, living at home with his heart full of the stain of stinginess, abusing and insulting ascetics and brahmins",
      "The wife is also unethical, of bad character"
    ],
    "How a male zombie lives with a goddess (a causal chain) [an4.53:12.4]": [
      "The husband is unethical, of bad character",
      "The wife doesn’t kill living creatures, steal, commit sexual misconduct, lie, or use alcoholic drinks that cause negligence",
      "She’s ethical, of good character, living at home with her heart rid of the stain of stinginess, not abusing and insulting ascetics and brahmins"
    ],
    "How a god lives with a female zombie (a causal chain) [an4.53:12.4]": [
      "The husband is ethical, of good character",
      "The wife is unethical, of bad character"
    ],
    "How a god lives with a goddess (a causal chain) [an4.53:12.4]": [
      "The husband is ethical, of good character",
      "The wife is also ethical, of good character"
    ],
    "The outcomes of different ways of living together (a causal chain) [an4.53:12.4]": [
      "When both are unethical, miserly and abusive, then wife and husband live together as zombies.",
      "When the husband is unethical, miserly and abusive, but the wife is ethical, bountiful, rid of stinginess, she’s a goddess living with a zombie for a husband.",
      "When the husband is ethical, bountiful, rid of stinginess, but the wife is unethical, miserly and abusive, she’s a zombie living with a god for a husband.",
      "When both are faithful and bountiful, disciplined, living righteously, then wife and husband say nice things to each other. They get all the things they need, so they live at ease. Their enemies are downhearted, when both are equal in ethics. Having practiced the teaching here, both equal in precepts and observances, they delight in the heavenly realm, enjoying all the pleasures they desire."
    ]
  }
}