{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an4.195": {
    "Distressing and feverish defilements that arise because of instigating bodily activity [an4.195:13.7]": [
      "They don’t occur in someone who avoids such bodily activity.",
      "They don’t perform any new deeds.",
      "Old deeds are eliminated by experiencing their results little by little."
    ],
    "Distressing and feverish defilements that arise because of instigating verbal activity [an4.195:13.7]": [
      "They don’t occur in someone who avoids such verbal activity.",
      "They don’t perform any new deeds.",
      "Old deeds are eliminated by experiencing their results little by little."
    ],
    "Distressing and feverish defilements that arise because of instigating mental activity [an4.195:13.7]": [
      "They don’t occur in someone who avoids such mental activity.",
      "They don’t perform any new deeds.",
      "Old deeds are eliminated by experiencing their results little by little."
    ],
    "Distressing and feverish defilements that arise because of ignorance [an4.195:13.7]": [
      "They don’t occur when ignorance fades away and knowledge arises.",
      "They don’t perform any new deeds.",
      "Old deeds are eliminated by experiencing their results little by little."
    ],
    "Six consistent responses [an4.195:13.7]": [
      "Seeing a sight with the eye, they’re neither happy nor sad, but remain equanimous, mindful and aware.",
      "Hearing a sound with the ears, they’re neither happy nor sad, but remain equanimous, mindful and aware.",
      "Smelling an odor with the nose, they’re neither happy nor sad, but remain equanimous, mindful and aware.",
      "Tasting a flavor with the tongue, they’re neither happy nor sad, but remain equanimous, mindful and aware.",
      "Feeling a touch with the body, they’re neither happy nor sad, but remain equanimous, mindful and aware.",
      "Knowing a thought with the mind, they’re neither happy nor sad, but remain equanimous, mindful and aware."
    ]
  }
}