{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an4.122": {
    "The four dangers that anyone who enters the water should anticipate [an4.122:5.12]": [
      "The dangers of waves",
      "The dangers of crocodiles",
      "The dangers of whirlpools",
      "The dangers of sharks"
    ],
    "The four dangers that a gentleman who goes forth from the lay life to homelessness in this teaching and training should anticipate [an4.122:5.12]": [
      "The dangers of waves",
      "The dangers of crocodiles",
      "The dangers of whirlpools",
      "The dangers of sharks"
    ],
    "The danger of waves [an4.122:5.12]": [
      "A gentleman has gone forth from the lay life to homelessness",
      "Their spiritual companions advise and instruct them",
      "They think angrily and upset",
      "They resign the training and return to a lesser life"
    ],
    "The danger of crocodiles (a causal chain) [an4.122:5.12]": [
      "A gentleman has gone forth from the lay life to homelessness",
      "Their spiritual companions advise and instruct them",
      "They think angrily and upset",
      "They resign the training and return to a lesser life"
    ],
    "The danger of whirlpools (a causal chain) [an4.122:5.12]": [
      "A gentleman has gone forth from the lay life to homelessness",
      "They robe up in the morning and, taking their bowl and robe, enter a village or town for alms without guarding body, speech, and mind, without establishing mindfulness, and without restraining the sense faculties",
      "They see a householder or their child amusing themselves, supplied and provided with the five kinds of sensual stimulation",
      "They think and resign the training and return to a lesser life"
    ],
    "The danger of sharks (a causal chain) [an4.122:5.12]": [
      "A gentleman has gone forth from the lay life to homelessness",
      "They robe up in the morning and, taking their bowl and robe, enter a village or town for alms without guarding body, speech, and mind, without establishing mindfulness, and without restraining the sense faculties",
      "They see a female scantily clad, with revealing clothes",
      "Lust infects their mind and they resign the training and return to a lesser life."
    ]
  }
}