{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an4.169": {
    "The four people found in the world [an4.169:5.8]": [
      "One person becomes fully extinguished in the present life by making extra effort.",
      "One person becomes fully extinguished when the body breaks up by making extra effort.",
      "One person becomes fully extinguished in the present life without making extra effort.",
      "One person becomes fully extinguished when the body breaks up without making extra effort."
    ],
    "How a person becomes fully extinguished in the present life by making extra effort [an4.169:5.8]": [
      "Meditates observing the ugliness of the body",
      "Perceives the repulsiveness of food",
      "Perceives dissatisfaction with the whole world",
      "Observes the impermanence of all conditions",
      "Has well established the perception of their own death",
      "Relies on the five powers of a trainee: faith, conscience, prudence, energy, and wisdom",
      "These five faculties manifest in them strongly: faith, energy, mindfulness, immersion, and wisdom"
    ],
    "How a person becomes fully extinguished when the body breaks up by making extra effort (a causal sequence) [an4.169:5.8]": [
      "Meditates observing the ugliness of the body",
      "Perceives the repulsiveness of food",
      "Perceives dissatisfaction with the whole world",
      "Observes the impermanence of all conditions",
      "Has well established the perception of their own death",
      "Relies on the five powers of a trainee: faith, conscience, prudence, energy, and wisdom",
      "These five faculties manifest in them weakly: faith, energy, mindfulness, immersion, and wisdom"
    ],
    "How a person becomes fully extinguished in the present life without making extra effort (a causal sequence) [an4.169:5.8]": [
      "Enters and remains in the first absorption",
      "Enters and remains in the second absorption",
      "Enters and remains in the third absorption",
      "Enters and remains in the fourth absorption",
      "Relies on the five powers of a trainee: faith, conscience, prudence, energy, and wisdom",
      "These five faculties manifest in them strongly: faith, energy, mindfulness, immersion, and wisdom"
    ],
    "How a person becomes fully extinguished when the body breaks up without making extra effort (a causal sequence) [an4.169:5.8]": [
      "Enters and remains in the first absorption",
      "Enters and remains in the second absorption",
      "Enters and remains in the third absorption",
      "Enters and remains in the fourth absorption",
      "Relies on the five powers of a trainee: faith, conscience, prudence, energy, and wisdom",
      "These five faculties manifest in them weakly: faith, energy, mindfulness, immersion, and wisdom"
    ]
  }
}