{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an5.90": {
    "The five things that lead to the decline of a mendicant trainee [an5.90:10.5]": [
      "A mendicant trainee has many duties and responsibilities, and is competent in many tasks. They neglect retreat, and are not committed to internal serenity of heart.",
      "A mendicant trainee spends their day doing trivial work. They neglect retreat, and are not committed to internal serenity of heart.",
      "A mendicant trainee mixes closely with laypeople and renunciates, socializing inappropriately like a layperson. They neglect retreat, and are not committed to internal serenity of heart.",
      "A mendicant trainee enters the town at the wrong time, and returns too late in the day. They neglect retreat, and are not committed to internal serenity of heart.",
      "A mendicant trainee doesn’t get to take part in talk about self-effacement that helps open the heart, when they want, without trouble or difficulty. They neglect retreat, and are not committed to internal serenity of heart."
    ],
    "The five things that don’t lead to the decline of a mendicant trainee [an5.90:10.5]": [
      "A mendicant trainee doesn’t have many duties and responsibilities, even though they are competent in many tasks. They don’t neglect retreat, and are committed to internal serenity of heart.",
      "A mendicant trainee doesn’t spend their day doing trivial work. They don’t neglect retreat, and are committed to internal serenity of heart.",
      "A mendicant trainee doesn’t mix closely with laypeople and renunciates, socializing inappropriately like a layperson. They don’t neglect retreat, and are committed to internal serenity of heart.",
      "A mendicant trainee doesn’t enter the village too early or return too late in the day. They don’t neglect retreat, and are committed to internal serenity of heart.",
      "A mendicant trainee gets to take part in talk about self-effacement that helps open the heart, when they want, without trouble or difficulty. They don’t neglect retreat, and are committed to internal serenity of heart."
    ]
  }
}