{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an5.191": {
    "The five traditions of the brahmins seen these days among dogs, but not among brahmins [an5.191:5.5]": [
      "In the past brahmins had sex only with brahmin women, not with others. These days brahmins have sex with both brahmin women and others. But these days dogs have sex only with female dogs, not with other species. This is the first tradition of the brahmins seen these days among dogs, but not among brahmins.",
      "In the past brahmins had sex only with brahmin women in the fertile half of the month that starts with menstruation, not at other times. These days brahmins have sex with brahmin women both in the fertile half of the month and at other times. But these days dogs have sex only with female dogs when they are in heat, not at other times. This is the second tradition of the brahmins seen these days among dogs, but not among brahmins.",
      "In the past brahmins neither bought nor sold brahmin women. They lived together because they loved each other and wanted their family line to continue. These days brahmins both buy and sell brahmin women. They live together whether they love each other or not and they want their family line to continue. But these days dogs neither buy nor sell female dogs. They live together because they’re attracted to each other and want their family line to continue. This is the third tradition of the brahmins seen these days among dogs, but not among brahmins.",
      "In the past brahmins did not store up money, grain, silver, or gold. These days brahmins do store up money, grain, silver, and gold. But these days dogs don’t store up money, grain, silver, or gold. This is the fourth tradition of the brahmins seen these days among dogs, but not among brahmins.",
      "In the past brahmins went looking for almsfood for dinner in the evening, and for breakfast in the morning. These days brahmins eat as much as they like until their bellies are full, then take away the leftovers. But these days dogs go looking for dinner in the evening, and for breakfast in the morning. This is the fifth tradition of the brahmins seen these days among dogs, but not among brahmins."
    ]
  }
}