{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an5.41": {
    "The five reasons to get rich [an5.41:9.4]": [
      "Making oneself happy and pleased, keeping oneself properly happy, making one's mother and father happy, making one's children, partners, bondservants, workers, and staff happy",
      "Making friends and colleagues happy",
      "Protecting oneself against losses from such things as fire, water, kings, bandits, or unloved heirs",
      "Making five spirit-offerings: to relatives, guests, ancestors, king, and deities",
      "Establishing an uplifting religious donation for ascetics and brahmins"
    ],
    "The actions taken with legitimate wealth [an5.41:9.4]": [
      "Making oneself happy and pleased, keeping oneself properly happy, making one's mother and father happy, making one's children, partners, bondservants, workers, and staff happy",
      "Making friends and colleagues happy",
      "Protecting oneself against losses from such things as fire, water, kings, bandits, or unloved heirs",
      "Making five spirit-offerings: to relatives, guests, ancestors, king, and deities",
      "Establishing an uplifting religious donation for ascetics and brahmins"
    ],
    "The thoughts of a noble disciple when their riches run out or increase [an5.41:9.4]": [
      "If the riches a noble disciple gets for the five reasons run out, they have no regrets",
      "If the riches a noble disciple gets for the five reasons increase, they have no regrets in both cases"
    ],
    "The achievements of an astute lay person who gains wealth for the five reasons [an5.41:9.4]": [
      "Enjoying wealth and supporting those who depend on them",
      "Overcoming losses",
      "Giving uplifting religious donations",
      "Making the five spirit-offerings",
      "Looking after the ethical and disciplined spiritual practitioners"
    ]
  }
}