{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an5.57": {
    "The five subjects for regular reviewing [an5.57:16.4]": [
      "I am liable to grow old, I am not exempt from old age",
      "I am liable to get sick, I am not exempt from sickness",
      "I am liable to die, I am not exempt from death",
      "I must be parted and separated from all I hold dear and beloved",
      "I am the owner of my deeds and heir to my deeds. Deeds are my womb, my relative, and my refuge. I shall be the heir of whatever deeds I do, whether good or bad."
    ],
    "The advantage of often reviewing each subject [an5.57:16.4]": [
      "Reviewing the subject of growing old helps to give up the vanity of youth or at least reduce it",
      "Reviewing the subject of getting sick helps to give up the vanity of health or at least reduce it",
      "Reviewing the subject of death helps to give up the vanity of life or at least reduce it",
      "Reviewing the subject of being parted from all that is dear and beloved helps to give up desire and lust for them or at least reduce it",
      "Reviewing the subject of being the owner of one's deeds and heir to them helps to give up bad conduct or at least reduce it"
    ],
    "The realization that all sentient beings are subject to the same conditions [an5.57:16.4]": [
      "It's not just me who is liable to grow old, not being exempt from old age. For all sentient beings grow old according to their nature, as long as they come and go, pass away and are reborn.",
      "It's not just me who is liable to get sick, not being exempt from sickness. For all sentient beings get sick according to their nature, as long as they come and go, pass away and are reborn.",
      "It's not just me who is liable to die, not being exempt from death. For all sentient beings die according to their nature, as long as they come and go, pass away and are reborn.",
      "It's not just me who must be parted and separated from all I hold dear and beloved. For all sentient beings must be parted and separated from all they hold dear and beloved, as long as they come and go, pass away and are reborn.",
      "It's not just me who shall be the owner of my deeds and heir to my deeds. For all sentient beings shall be the owners of their deeds and heirs to their deeds, as long as they come and go, pass away and are reborn."
    ]
  }
}