{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an5.79": {
    "The five future perils [an5.79:7.3]": [
      "Mendicants who have not developed their physical endurance, ethics, mind, and wisdom, and are unable to guide others in higher ethics, mind, and wisdom",
      "Mendicants who have not developed their physical endurance, ethics, mind, and wisdom, and give dependence to others but are unable to guide them in higher ethics, mind, and wisdom",
      "Mendicants who have not developed their physical endurance, ethics, mind, and wisdom, and fall into dark ideas without realizing it during discussions about teachings and classifications",
      "Mendicants who have not developed their physical endurance, ethics, mind, and wisdom, and do not want to listen to discourses spoken by the Realized One but are interested in listening to discourses composed by poets",
      "Mendicants who have not developed their physical endurance, ethics, mind, and wisdom, and become indulgent and slack, neglecting seclusion, and not rousing energy for attaining the unattained, achieving the unachieved, and realizing the unrealized."
    ],
    "The consequences of the five future perils [an5.79:7.3]": [
      "Corrupt training comes from corrupt teachings, and corrupt teachings come from corrupt training. This is the first future peril.",
      "Corrupt training comes from corrupt teachings, and corrupt teachings come from corrupt training. This is the second future peril.",
      "Corrupt training comes from corrupt teachings, and corrupt teachings come from corrupt training. This is the third future peril.",
      "Corrupt training comes from corrupt teachings, and corrupt teachings come from corrupt training. This is the fourth future peril.",
      "Corrupt training comes from corrupt teachings, and corrupt teachings come from corrupt training. This is the fifth future peril."
    ]
  }
}