{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an5.167": {
    "Five things a mendicant who wants to accuse another should establish in themselves [an5.167:14.5]": [
      "Speak at the right time, not at the wrong time",
      "Speak truthfully, not falsely",
      "Speak gently, not harshly",
      "Speak beneficially, not harmfully",
      "Speak lovingly, not from secret hate"
    ],
    "Ways to reassure a mendicant who is accused improperly [an5.167:14.5]": [
      "Accused at the wrong time, not at the right time",
      "Accused falsely, not truthfully",
      "Accused harshly, not gently",
      "Accused harmfully, not beneficially",
      "Accused with secret hate, not lovingly"
    ],
    "Ways to chasten a mendicant who makes improper accusations [an5.167:14.5]": [
      "Made an accusation at the wrong time, not at the right time",
      "Made an accusation falsely, not truthfully",
      "Made an accusation harshly, not gently",
      "Made an accusation harmfully, not beneficially",
      "Made an accusation with secret hate, not lovingly"
    ],
    "Ways to chasten a mendicant who is accused properly [an5.167:14.5]": [
      "Accused at the right time, not at the wrong time",
      "Accused truthfully, not falsely",
      "Accused gently, not harshly",
      "Accused beneficially, not harmfully",
      "Accused lovingly, not with secret hate"
    ],
    "Ways to reassure a mendicant who makes proper accusations [an5.167:14.5]": [
      "Made an accusation at the right time, not at the wrong time",
      "Made an accusation truthfully, not falsely",
      "Made an accusation gently, not harshly",
      "Made an accusation beneficially, not harmfully",
      "Made an accusation lovingly, not with secret hate"
    ],
    "Qualities of gentlemen who went forth from the lay life to homelessness out of faith [an5.167:14.5]": [
      "Not devious, deceitful, and sneaky",
      "Not restless, insolent, fickle, scurrilous, and loose-tongued",
      "Guard their sense doors and eat in moderation",
      "Dedicated to wakefulness",
      "Care about the ascetic life and keenly respect the training",
      "Not indulgent or slack, nor are they leaders in backsliding, neglecting seclusion",
      "Energetic and determined",
      "Mindful, with situational awareness, immersion, and unified minds; wise, not stupid."
    ]
  }
}