{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an5.103": {
    "The five factors of a master thief [an5.103:14.1]": [
      "Relying on rough ground",
      "Relying on thick cover",
      "Relying on powerful individuals",
      "Paying bribes",
      "Acting alone"
    ],
    "How a master thief relies on rough ground [an5.103:14.1]": [
      "A master thief relies on inaccessible riverlands or rugged mountains"
    ],
    "How a master thief relies on thick cover (a causal sequence) [an5.103:14.1]": [
      "A master thief relies on thick grass, thick trees, a blind spot, or a large dense wood"
    ],
    "How a master thief relies on powerful individuals (a causal sequence) [an5.103:14.1]": [
      "A master thief relies on rulers or their ministers"
    ],
    "How a master thief pays bribes (a causal sequence) [an5.103:14.1]": [
      "A master thief is rich, affluent, and wealthy"
    ],
    "How a master thief acts alone (a causal sequence) [an5.103:14.1]": [
      "A master thief carries out robbery all alone"
    ],
    "The five qualities of a bad mendicant (a causal sequence) [an5.103:14.1]": [
      "Relying on rough ground",
      "Relying on thick cover",
      "Relying on powerful individuals",
      "Paying bribes",
      "Acting alone"
    ],
    "How a bad mendicant relies on rough ground [an5.103:14.1]": [
      "A bad mendicant has unethical conduct by way of body, speech, and mind"
    ],
    "How a bad mendicant relies on thick cover (a causal sequence) [an5.103:14.1]": [
      "A bad mendicant has wrong view, he’s attached to an extremist view"
    ],
    "How a bad mendicant relies on powerful individuals (a causal sequence) [an5.103:14.1]": [
      "A bad mendicant relies on rulers or their ministers"
    ],
    "How a bad mendicant pays bribes (a causal sequence) [an5.103:14.1]": [
      "A bad mendicant receives robes, almsfood, lodgings, and medicines and supplies for the sick"
    ],
    "How a bad mendicant acts alone (a causal sequence) [an5.103:14.1]": [
      "A bad mendicant dwells alone in the borderlands and visits families there to get material possessions."
    ]
  }
}