{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an6.58": {
    "The six qualities of a mendicant worthy of offerings dedicated to the gods, hospitality, religious donation, veneration with joined palms, and is the supreme field of merit for the world [an6.58:9.1]": [
      "By restraint, has given up the defilements that should be given up by restraint",
      "By using, they’ve given up the defilements that should be given up by using",
      "By enduring, they’ve given up the defilements that should be given up by enduring",
      "By avoiding, they’ve given up the defilements that should be given up by avoiding",
      "By getting rid, they’ve given up the defilements that should be given up by getting rid",
      "By developing, they’ve given up the defilements that should be given up by developing"
    ],
    "The defilements that should be given up by restraint [an6.58:9.1]": [
      "Eye faculty",
      "Ear faculty",
      "Nose faculty",
      "Tongue faculty",
      "Body faculty",
      "Mind faculty"
    ],
    "The defilements that should be given up by using [an6.58:9.1]": [
      "Robes",
      "Almsfood",
      "Lodgings",
      "Medicines and supplies for the sick"
    ],
    "The defilements that should be given up by enduring [an6.58:9.1]": [
      "Cold",
      "Heat",
      "Hunger",
      "Thirst",
      "Touch of flies, mosquitoes, wind, sun, and reptiles",
      "Rude and unwelcome criticism",
      "Physical pain"
    ],
    "The defilements that should be given up by avoiding [an6.58:9.1]": [
      "Wild elephant",
      "Wild horse",
      "Wild ox",
      "Wild dog",
      "Snake",
      "Stump",
      "Thorny ground",
      "Pit",
      "Cliff",
      "Swamp",
      "Sewer",
      "Inappropriate seats",
      "Inappropriate neighborhoods",
      "Bad friends"
    ],
    "The defilements that should be given up by getting rid [an6.58:9.1]": [
      "Sensual, malicious, or cruel thought",
      "Bad, unskillful qualities"
    ],
    "The defilements that should be given up by developing [an6.58:9.1]": [
      "Awakening factors of mindfulness",
      "Investigation of principles",
      "Energy",
      "Rapture",
      "Tranquility",
      "Immersion",
      "Equanimity"
    ]
  }
}