{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an6.56": {
    "The six benefits to hearing the teaching at the right time and examining the meaning at the right time [an6.56:15.1]": [
      "The first benefit - A mendicant whose mind is not freed from the five lower fetters gets to see the Realized One at the time of death. The Realized One teaches them Dhamma that’s good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. And he reveals a spiritual practice that’s entirely full and pure. When they hear that teaching their mind is freed from the five lower fetters.",
      "The second benefit - A mendicant whose mind is not freed from the five lower fetters doesn't get to see the Realized One at the time of death, but they get to see a Realized One’s disciple. The Realized One’s disciple teaches them Dhamma. When they hear that teaching their mind is freed from the five lower fetters.",
      "The third benefit - A mendicant whose mind is not freed from the five lower fetters doesn't get to see the Realized One or a Realized One’s disciple at the time of death. But they think about and consider the teaching in their heart, examining it with the mind as they learned and memorized it. As they do so their mind is freed from the five lower fetters.",
      "The fourth benefit - A mendicant whose mind is freed from the five lower fetters, but not with the supreme ending of attachments, gets to see the Realized One at the time of death. The Realized One teaches them Dhamma. When they hear that teaching their mind is freed with the supreme ending of attachments.",
      "The fifth benefit - A mendicant whose mind is freed from the five lower fetters, but not with the supreme ending of attachments, doesn't get to see the Realized One at the time of death, but they get to see a Realized One’s disciple. The Realized One’s disciple teaches them Dhamma. When they hear that teaching their mind is freed with the supreme ending of attachments.",
      "The sixth benefit - A mendicant whose mind is freed from the five lower fetters, but not with the supreme ending of attachments, doesn't get to see the Realized One or a Realized One’s disciple at the time of death. But they think about and consider the teaching in their heart, examining it with the mind as they learned and memorized it. As they do so their mind is freed with the supreme ending of attachments."
    ]
  }
}