{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an7.15": {
    "The seven people found in the world [an7.15:9.1]": [
      "One person sinks under once and stays under.",
      "One person rises up then sinks under.",
      "One person rises up then stays put.",
      "One person rises up then sees and discerns.",
      "One person rises up then crosses over.",
      "One person rises up then finds a footing.",
      "One person has risen up, crossed over, and gone beyond, and that brahmin stands on the shore."
    ],
    "The kinds of people and their characteristics [an7.15:9.1]": [
      "The kind of person who sinks under once and stays under - has exclusively dark, unskillful qualities.",
      "The kind of person who rises up then sinks under - has faith, conscience, prudence, energy, and wisdom regarding skillful qualities, but they don't last or grow.",
      "The kind of person who rises up then stays put - has faith, conscience, prudence, energy, and wisdom regarding skillful qualities, and they last, neither dwindling nor growing.",
      "The kind of person who rises up then sees and discerns - has faith, conscience, prudence, energy, and wisdom regarding skillful qualities, and with the ending of three fetters, they're a stream-enterer.",
      "The kind of person who rises up then crosses over - has faith, conscience, prudence, energy, and wisdom regarding skillful qualities, and with the ending of three fetters and the weakening of greed, hate, and delusion, they're a once-returner.",
      "The kind of person who rises up then finds a footing - has faith, conscience, prudence, energy, and wisdom regarding skillful qualities, and with the ending of the five lower fetters, they're reborn spontaneously.",
      "The kind of person who has risen up, crossed over, and gone beyond, a brahmin who stands on the shore - has faith, conscience, prudence, energy, and wisdom regarding skillful qualities, and they realize the undefiled freedom of heart and freedom by wisdom in this very life."
    ]
  }
}