{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an7.61": {
    "Ways to give up drowsiness [an7.61:13.10]": [
      "Don’t focus on or cultivate the perception that you were meditating on when you fell drowsy.",
      "Think about and consider the teaching as you’ve learned and memorized it, examining it with your mind.",
      "Recite in detail the teaching as you’ve learned and memorized it.",
      "Pinch your ears and rub your limbs.",
      "Get up from your seat, flush your eyes with water, look around in every direction, and look up at the stars and constellations.",
      "Focus on the perception of light, concentrating on the perception of day, regardless of whether it’s night or day.",
      "Walk mindfully, concentrating on the perception of continuity, your faculties directed inwards and your mind not scattered outside.",
      "Lie down in the lion’s posture—on the right side, placing one foot on top of the other—mindful and aware, and focused on the time of getting up."
    ],
    "Training for a mendicant [an7.61:13.10]": [
      "I will not approach families with my head swollen with vanity.",
      "I won’t get into arguments.",
      "I won’t live indulging in the pleasures of sleeping, lying down, and drowsing.",
      "I will train to stay away from families and human settlements and stay in lodgings that are quiet and still, far from the madding crowd, and fit for retreat."
    ],
    "Brief definition of a mendicant who is freed through the ending of craving [an7.61:13.10]": [
      "When a mendicant has heard: ‘Nothing is worth insisting on.’",
      "They directly know all things.",
      "Directly knowing all things, they completely understand all things.",
      "Having completely understood all things, when they experience any kind of feeling—pleasant, unpleasant, or neutral— they meditate observing impermanence, dispassion, cessation, and letting go in those feelings.",
      "Meditating in this way, they don’t grasp at anything in the world.",
      "Not grasping, they’re not anxious.",
      "Not being anxious, they personally become extinguished."
    ]
  }
}