{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an7.29": {
    "Seven things that lead to the decline of a lay follower [an7.29:10.4]": [
      "Missing out on seeing the mendicants",
      "Neglecting to listen to the true teaching",
      "Not training in higher ethical conduct",
      "Being suspicious about mendicants, whether senior, junior, or middle",
      "Listening to the teaching with a hostile, fault-finding mind",
      "Seeking outside of the Buddhist community for those worthy of religious donations and serving them first",
      "These seven things lead to the decline of a lay follower"
    ],
    "Seven things that don’t lead to the decline of a lay follower [an7.29:10.4]": [
      "Not missing out on seeing the mendicants",
      "Not neglecting to listen to the true teaching",
      "Training in higher ethical conduct",
      "Being confident about mendicants, whether senior, junior, or middle",
      "Not listening to the teaching with a hostile, fault-finding mind",
      "Not seeking outside of the Buddhist community for those worthy of religious donations and serving them first",
      "These seven things don’t lead to the decline of a lay follower"
    ],
    "Seven principles leading to decline [an7.29:10.4]": [
      "Missing out on seeing those who are evolved and listening to the teachings of the Noble One",
      "Not training in higher ethical conduct",
      "Growing suspicion about mendicants",
      "Wanting to listen to the true teaching with a fault-finding mind",
      "Seeking outside the Buddhist community for someone else worthy of religious donations and serving them first",
      "A lay follower who practices them falls away from the true teaching",
      "These seven principles leading to decline have been well taught"
    ],
    "Seven principles that prevent decline [an7.29:10.4]": [
      "Not missing out on seeing those who are evolved and listening to the teachings of the Noble One",
      "Training in higher ethical conduct",
      "Growing confidence in mendicants",
      "Wanting to listen to the true teaching without a fault-finding mind",
      "Not seeking outside the Buddhist community for someone else worthy of religious donations and serving the Buddhist community first",
      "A lay follower who practices them doesn’t fall away from the true teaching",
      "These seven principles that prevent decline have been well taught."
    ]
  }
}