{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an7.49": {
    "The seven perceptions [an7.49:17.1]": [
      "The perception of ugliness",
      "The perception of death",
      "The perception of the repulsiveness of food",
      "The perception of dissatisfaction with the whole world",
      "The perception of impermanence",
      "The perception of suffering in impermanence",
      "The perception of not-self in suffering"
    ],
    "The benefits of developing and cultivating the seven perceptions [an7.49:17.1]": [
      "They culminate in the deathless and end with the deathless"
    ],
    "The benefits of developing and cultivating the perception of ugliness [an7.49:17.1]": [
      "The mind draws back from sexual intercourse",
      "Equanimity or revulsion become stabilized"
    ],
    "The benefits of developing and cultivating the perception of death (a causal chain) [an7.49:17.1]": [
      "The mind draws back from desire to be reborn"
    ],
    "The benefits of developing and cultivating the perception of the repulsiveness of food (a causal chain) [an7.49:17.1]": [
      "The mind draws back from craving for tastes"
    ],
    "The benefits of developing and cultivating the perception of dissatisfaction with the whole world (a causal chain) [an7.49:17.1]": [
      "The mind draws back from the world’s shiny things"
    ],
    "The benefits of developing and cultivating the perception of impermanence (a causal chain) [an7.49:17.1]": [
      "The mind draws back from material possessions, honors, and fame"
    ],
    "The benefits of developing and cultivating the perception of suffering in impermanence (a causal chain) [an7.49:17.1]": [
      "Establish a keen perception of the danger of sloth, laziness, slackness, negligence, lack of commitment, and failure to review"
    ],
    "The benefits of developing and cultivating the perception of not-self in suffering (a causal chain) [an7.49:17.1]": [
      "The mind is rid of I-making, mine-making, and conceit for this conscious body and all external stimuli",
      "It has gone beyond discrimination, and is peaceful and well freed."
    ]
  }
}