{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an7.54": {
    "Misconceptions about the existence of a Realized One after death [an7.54:5.7]": [
      "‘A Realized One exists after death’: this is a misconception.",
      "‘A Realized One doesn’t exist after death’: this is a misconception.",
      "‘A Realized One both exists and doesn’t exist after death’: this is a misconception.",
      "‘A Realized One neither exists nor doesn’t exist after death’: this is a misconception."
    ],
    "Understanding of views, their origin, their cessation, and the practice that leads to their cessation [an7.54:5.7]": [
      "An uneducated ordinary person doesn’t understand views, their origin, their cessation, or the practice that leads to their cessation.",
      "And so their views grow.",
      "They’re not freed from rebirth, old age, and death, from sorrow, lamentation, pain, sadness, and distress.",
      "They’re not freed from suffering, I say."
    ],
    "Understanding of regrets, their origin, their cessation, and the practice that leads to their cessation (a causal sequence) [an7.54:5.7]": [
      "An uneducated ordinary person doesn’t understand regrets, their origin, their cessation, or the practice that leads to their cessation.",
      "And so their regrets grow.",
      "They’re not freed from rebirth, old age, and death, from sorrow, lamentation, pain, sadness, and distress.",
      "They’re not freed from suffering, I say."
    ],
    "The cause and reason why an educated noble disciple has no doubts regarding the undeclared points (a causal sequence) [an7.54:5.7]": [
      "It’s due to the cessation of views that an educated noble disciple has no doubts regarding the undeclared points.",
      "An educated noble disciple does understand views, their origin, their cessation, and the practice that leads to their cessation.",
      "And so their views cease.",
      "They’re freed from rebirth, old age, and death, from sorrow, lamentation, pain, sadness, and distress.",
      "They’re freed from suffering, I say."
    ]
  }
}