{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an7.64": {
    "The seven things that please and assist an enemy which happen to an irritable woman or man [an7.64:25.4]": [
      "An enemy wishes for an enemy to become ugly",
      "An enemy wishes for an enemy to sleep badly",
      "An enemy wishes for an enemy to not get all they need",
      "An enemy wishes for an enemy to not be wealthy",
      "An enemy wishes for an enemy to not be famous",
      "An enemy wishes for an enemy to have no friends",
      "An enemy wishes for an enemy to be reborn in a place of loss, a bad place, the underworld, hell"
    ],
    "The consequences of anger [an7.64:25.4]": [
      "An irritable person is ugly and sleeps badly",
      "An angry person kills with body or speech and loses their wealth",
      "Mad with anger, they fall into disgrace and their family, friends, and loved ones avoid them",
      "Anger creates harm and upsets the mind",
      "An angry person doesn’t know the good or see the truth",
      "An angry person destroys with ease what was hard to build and is tormented afterwards",
      "An angry person’s look betrays their sulkiness and they make others angry",
      "An angry person has no conscience or prudence, nor any respectful speech",
      "The deeds that torment a man are far from those that are good",
      "An angry person slays their father, mother, saint, and normal person",
      "An angry person kills themselves all kinds of ways, distraught for many reasons",
      "When they commit deeds of destroying life and killing themselves, they don’t realize what they do, for anger leads to their downfall"
    ],
    "The way to cut out anger [an7.64:25.4]": [
      "The snare of death in the form of anger lies hidden in the heart",
      "An astute person should cut out this unskillful thing",
      "They’d train in the teaching in just the same way, not yielding to sulkiness",
      "Free of anger, free of despair, free of greed, with no more longing, tamed, having given up anger, they become extinguished without defilements."
    ]
  }
}