{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an7.55": {
    "The seven places people are reborn [an7.55:9.8]": [
      "A mendicant who practices like this: ‘It might not be, and it might not be mine. It will not be, and it will not be mine. I am giving up what exists, what has come to be.’ With the ending of the five lower fetters they’re extinguished between one life and the next.",
      "A mendicant who practices like this: ‘It might not be, and it might not be mine. It will not be, and it will not be mine. I am giving up what exists, what has come to be.’ With the ending of the five lower fetters they’re extinguished upon landing.",
      "A mendicant who practices like this: ‘It might not be, and it might not be mine. It will not be, and it will not be mine. I am giving up what exists, what has come to be.’ With the ending of the five lower fetters they’re extinguished without extra effort.",
      "A mendicant who practices like this: ‘It might not be, and it might not be mine. It will not be, and it will not be mine. I am giving up what exists, what has come to be.’ With the ending of the five lower fetters they’re extinguished with extra effort.",
      "A mendicant who practices like this: ‘It might not be, and it might not be mine. It will not be, and it will not be mine. I am giving up what exists, what has come to be.’ With the ending of the five lower fetters they head upstream, going to the Akaniṭṭha realm.",
      "A mendicant who practices like this: ‘It might not be, and it might not be mine. It will not be, and it will not be mine. I am giving up what exists, what has come to be.’ With the ending of the five lower fetters they head upstream, going to the Brahmā realm.",
      "A mendicant who practices like this: ‘It might not be, and it might not be mine. It will not be, and it will not be mine. I am giving up what exists, what has come to be.’ With the ending of the five lower fetters they head upstream, going to the Pure Abodes."
    ],
    "The practice of a mendicant who gains equanimity [an7.55:9.8]": [
      "They gain equanimity. They’re not attached to life, or to creating a new life. And they see with right wisdom that there is a peaceful state beyond. But they haven’t completely realized that state. They haven’t totally given up the underlying tendencies of conceit, desire to be reborn, and ignorance. With the ending of the five lower fetters they’re extinguished between one life and the next.",
      "They gain equanimity. They’re not attached to life, or to creating a new life. And they see with right wisdom that there is a peaceful state beyond. But they haven’t totally realized that state. They haven’t completely given up the underlying tendencies of conceit, desire to be reborn, and ignorance. With the ending of the five lower fetters they’re extinguished upon landing.",
      "They gain equanimity. They’re not attached to life, or to creating a new life. And they see with right wisdom that there is a peaceful state beyond. But they haven’t totally realized that state. They haven’t completely given up the underlying tendencies of conceit, desire to be reborn, and ignorance. With the ending of the five lower fetters they’re extinguished without extra effort.",
      "They gain equanimity. They’re not attached to life, or to creating a new life. And they see with right wisdom that there is a peaceful state beyond. But they haven’t totally realized that state. They haven’t completely given up the underlying tendencies of conceit, desire to be reborn, and ignorance. With the ending of the five lower fetters they’re extinguished with extra effort.",
      "They gain equanimity. They’re not attached to life, or to creating a new life. And they see with right wisdom that there is a peaceful state beyond. But they haven’t totally realized that state. They haven’t completely given up the underlying tendencies of conceit, desire to be reborn, and ignorance. With the ending of the five lower fetters they head upstream, going to the Akaniṭṭha realm.",
      "They gain equanimity. They’re not attached to life, or to creating a new life. And they see with right wisdom that there is a peaceful state beyond. But they haven’t totally realized that state. They haven’t completely given up the underlying tendencies of conceit, desire to be reborn, and ignorance. With the ending of the five lower fetters they head upstream, going to the Brahmā realm.",
      "They gain equanimity. They’re not attached to life, or to creating a new life. And they see with right wisdom that there is a peaceful state beyond. But they haven’t totally realized that state. They haven’t completely given up the underlying tendencies of conceit, desire to be reborn, and ignorance. With the ending of the five lower fetters they head upstream, going to the Pure Abodes."
    ]
  }
}