{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an8.29": {
    "The eight lost opportunities for spiritual practice [an8.29:20.4]": [
      "A person has been reborn in hell",
      "A person has been reborn in the animal realm",
      "A person has been reborn in the ghost realm",
      "A person has been reborn in one of the long-lived orders of gods",
      "A person has been reborn in the borderlands, among strange barbarian tribes, where monks, nuns, laymen, and laywomen do not go",
      "A person is reborn in a central country but has wrong view and distorted perspective",
      "A person is reborn in a central country but is witless, dull, stupid, and unable to distinguish what is well said from what is poorly said",
      "A Realized One has not arisen in the world"
    ],
    "The one opportunity for spiritual practice [an8.29:20.4]": [
      "A Realized One has arisen in the world, perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed",
      "A person is reborn in a central country and is wise, bright, clever, and able to distinguish what is well said from what is poorly said"
    ],
    "The qualities of the Realized One [an8.29:20.4]": [
      "Perfected",
      "Fully awakened",
      "Accomplished in knowledge and conduct",
      "Holy",
      "Knower of the world",
      "Supreme guide for those who wish to train",
      "Teacher of gods and humans",
      "Awakened",
      "Blessed"
    ],
    "The qualities of a person who has realized the right time for the supreme spiritual life [an8.29:20.4]": [
      "Live guarded",
      "Ever mindful",
      "Not soaked with defilements",
      "Among those restrained ones who have practiced the path proclaimed by the Realized One, the one with vision, and taught by the Kinsman of the Sun",
      "Having cut off all underlying tendencies that follow those drifting in Māra’s dominion",
      "The ones in this world who’ve truly crossed over, having reached the ending of defilements"
    ]
  }
}