{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an8.46": {
    "The three things that the deities called 'Loveable' wield authority and control over [an8.46:22.4]": [
      "They can turn any color they want on the spot.",
      "They can get any voice that they want on the spot.",
      "They can get any pleasure that they want on the spot."
    ],
    "The eight qualities that females have to be reborn in company with the Gods of the Lovable Host [an8.46:22.4]": [
      "Her parents give her to a husband wanting what’s best for her, out of kindness and compassion.",
      "She gets up before her husband and goes to bed after him, and is obliging, behaving nicely and speaking politely.",
      "She honors, respects, esteems, and venerates those her husband respects, such as mother and father, and ascetics and brahmins. And when they arrive she serves them with a seat and water.",
      "She’s skilled and tireless in her husband’s household duties, such as knitting and sewing. She understands how to go about things in order to complete and organize the work.",
      "She knows what work her husband’s domestic bondservants, employees, and workers have completed, and what they’ve left incomplete. She knows who is sick, and who is fit or unwell. She distributes to each a fair portion of various foods.",
      "She ensures that any income her husband earns is guarded and protected, whether money, grain, silver, or gold. She doesn’t overspend, steal, waste, or lose it.",
      "She’s a lay follower who has gone for refuge to the Buddha, his teaching, and the Saṅgha. She’s ethical. She doesn’t kill living creatures, steal, commit sexual misconduct, lie, or use alcoholic drinks that cause negligence.",
      "She’s generous. She lives at home rid of the stain of stinginess, freely generous, open-handed, loving to let go, committed to charity, loving to give and to share."
    ]
  }
}