{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an8.10": {
    "Characteristics of a corrupt ascetic [an8.10:11.6]": [
      "Dodges the issue",
      "Distracts the discussion with irrelevant points",
      "Displays annoyance, hate, and bitterness"
    ],
    "Examples of how corrupt ascetics are identified and dealt with [an8.10:11.6]": [
      "Take a case where a certain person looks just the same as other good-natured mendicants when going out and coming back, when looking ahead and aside, when bending and extending the limbs, and when bearing the outer robe, bowl and robes. That is, so long as the mendicants don’t notice his offense. But when the mendicants notice the offense, they know that he’s a corrupt ascetic, just useless trash. When they realize this they send him away.",
      "Suppose in a growing field of barley some bad barley appeared, just useless trash. Its roots, stem, and leaves would look just the same as the healthy barley. That is, so long as the head doesn’t appear. But when the head appears, they know that it’s bad barley, just useless trash. When they realize this they pull it up by the roots and throw it outside the field.",
      "Suppose that a large heap of grain is being winnowed. The grains that are firm and substantial form a heap on one side. And the grains that are flimsy and insubstantial are blown over to the other side. Then the owners take a broom and sweep them even further away.",
      "Suppose a man needs an irrigation gutter for a well. He’d take a sharp axe and enter the wood, where he’d knock various trees with the axe. The trees that were firm and substantial made a cracking sound. But the trees that were rotten inside, decomposing and decayed, made a thud. He’d cut down such a tree at the root, lop off the crown, and thoroughly clear out the insides. Then he’d use it as an irrigation gutter for the well."
    ],
    "Characteristics of a good mendicant (a multiple items expanded upon using repetitive or similar sentence structures) [an8.10:11.6]": [
      "Lives in harmony",
      "Ever mindful",
      "Pure with the pure",
      "Alert",
      "Makes an end of suffering."
    ]
  }
}