{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an8.19": {
    "Eight incredible and amazing things the demons love about the ocean [an8.19:19.1]": [
      "The ocean gradually slants, slopes, and inclines, with no abrupt precipice.",
      "The ocean is consistent and doesn’t overflow its boundaries.",
      "The ocean doesn’t accommodate a corpse, but quickly carries it to the shore and strands it on the beach.",
      "All the great rivers lose their names and clans and are simply considered ‘the ocean’.",
      "The ocean never empties or fills up.",
      "The ocean has just one taste, the taste of salt.",
      "The ocean is full of many kinds of treasures.",
      "Many great beings live in the ocean."
    ],
    "Eight incredible and amazing things the mendicants love about this teaching and training [an8.19:19.1]": [
      "The penetration to enlightenment comes from gradual training, progress, and practice, not abruptly.",
      "When a training rule is laid down for my disciples they wouldn’t break it even for the sake of their own life.",
      "The Saṅgha doesn’t accommodate a person who is unethical, of bad qualities, filthy, with suspicious behavior, underhand, no true ascetic or spiritual practitioner—though claiming to be one—rotten inside, corrupt, and depraved. But they quickly gather and expel them.",
      "All four castes—aristocrats, brahmins, merchants, and workers—lose their former names and clans and are simply considered ‘Sakyan ascetics’.",
      "Though several mendicants become fully extinguished through the natural principle of extinguishment, without anything left over, the natural principle of extinguishment never empties or fills up.",
      "This teaching and training has one taste, the taste of freedom.",
      "This teaching and training is full of many kinds of treasures.",
      "Great beings live in this teaching and training, and these are those beings."
    ]
  }
}