{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an8.30": {
    "The eight thoughts of a great man [an8.30:25.4]": [
      "This teaching is for those of few wishes, not those of many wishes.",
      "It’s for the contented, not those who lack contentment.",
      "It’s for the secluded, not those who enjoy company.",
      "It’s for the energetic, not the lazy.",
      "It’s for the mindful, not the unmindful.",
      "It’s for those with immersion, not those without immersion.",
      "It’s for the wise, not the witless.",
      "It’s for those who don’t enjoy proliferating and don’t like to proliferate, not for those who enjoy proliferating and like to proliferate."
    ],
    "The four absorptions [an8.30:25.4]": [
      "The first absorption, which has the rapture and bliss born of seclusion, while placing the mind and keeping it connected.",
      "The second absorption, which has the rapture and bliss born of immersion, with internal clarity and confidence, and unified mind, without placing the mind and keeping it connected.",
      "The third absorption, where one meditates with equanimity, mindful and aware, personally experiencing the bliss of which the noble ones declare, ‘Equanimous and mindful, one meditates in bliss.’",
      "The fourth absorption, without pleasure or pain, with pure equanimity and mindfulness."
    ],
    "The items that will seem different to Anuruddha as he lives contented [an8.30:25.4]": [
      "His rag robe will seem like a chest full of garments of different colors.",
      "His scraps of almsfood will seem like boiled fine rice with the dark grains picked out, served with many soups and sauces.",
      "His lodging at the root of a tree will seem like a bungalow, plastered inside and out, draft-free, with latches fastened and windows shuttered.",
      "His lodging at the root of a tree will seem like a couch spread with woolen covers—shag-piled, pure white, or embroidered with flowers—and spread with a fine deer hide, with a canopy above and red pillows at both ends.",
      "His fermented urine as medicine will seem like various medicines—ghee, butter, oil, honey, and molasses."
    ]
  }
}