{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an8.50": {
    "Four qualities of a female practicing to win in this life [an8.50:14.4]": [
      "Well-organized at work",
      "Manages the domestic help",
      "Acts lovingly toward her husband",
      "Preserves his earnings"
    ],
    "How a female is well-organized at work [an8.50:14.4]": [
      "Skilled and tireless in doing domestic duties for her husband"
    ],
    "How a female manages the domestic help (a causal chain) [an8.50:14.4]": [
      "Knows what work her husband’s domestic bondservants, employees, and workers have completed, and what they’ve left incomplete",
      "Knows who is sick, and who is fit or unwell",
      "Distributes to each a fair portion of various foods"
    ],
    "How a female acts lovingly toward her husband (a causal chain) [an8.50:14.4]": [
      "Would not transgress in any way that her husband would not consider loveable, even for the sake of her own life"
    ],
    "How a female preserves his earnings (a causal chain) [an8.50:14.4]": [
      "Tries to guard and protect any income her husband earns"
    ],
    "Four qualities of a female practicing to win in the next life (a causal chain) [an8.50:14.4]": [
      "Accomplished in faith",
      "Accomplished in ethics",
      "Accomplished in generosity",
      "Accomplished in wisdom"
    ],
    "How a female is accomplished in faith [an8.50:14.4]": [
      "Has faith in the Realized One’s awakening"
    ],
    "How a female is accomplished in ethics (a causal chain) [an8.50:14.4]": [
      "Doesn’t kill living creatures, steal, commit sexual misconduct, lie, or consume alcoholic drinks that cause negligence"
    ],
    "How a female is accomplished in generosity (a causal chain) [an8.50:14.4]": [
      "Lives at home rid of the stain of stinginess",
      "Freely generous, open-handed, loving to let go, committed to charity, loving to give and to share"
    ],
    "How a female is accomplished in wisdom (a causal chain) [an8.50:14.4]": [
      "Has the wisdom of arising and passing away which is noble, penetrative, and leads to the complete ending of suffering"
    ],
    "Eight qualities of a virtuous laywoman (a causal chain) [an8.50:14.4]": [
      "Organized at work",
      "Manages the domestic help",
      "Acts lovingly toward her husband",
      "Preserves his wealth",
      "Faithful",
      "Accomplished in ethics",
      "Bountiful and rid of stinginess",
      "Accomplished in wisdom"
    ],
    "Sixteen respects in which a virtuous laywoman is accomplished [an8.50:14.4]": [
      "Faith",
      "Morality",
      "Learning",
      "Generosity",
      "Wisdom",
      "Energy",
      "Patience",
      "Truthfulness",
      "Determination",
      "Goodwill",
      "Equanimity",
      "Being accomplished in faith",
      "Being accomplished in ethics",
      "Being accomplished in generosity",
      "Being accomplished in wisdom",
      "Being accomplished in meditation"
    ]
  }
}