{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an8.48": {
    "The eight qualities of females who are reborn in company with the Gods of the Lovable Host [an8.48:14.4]": [
      "Given by parents to a husband wanting what’s best for her, out of kindness and compassion",
      "Gets up before husband and goes to bed after him, and is obliging, behaving nicely and speaking politely",
      "Honors, respects, esteems, and venerates those her husband respects, such as mother and father, and ascetics and brahmins",
      "Serves them with a seat and water when they arrive",
      "Skilled and tireless in her husband’s household duties, such as knitting and sewing",
      "Understands how to go about things in order to complete and organize the work",
      "Knows what work her husband’s domestic bondservants, employees, and workers have completed, and what they’ve left incomplete. She knows who is sick, and who is fit or unwell. She distributes to each a fair portion of various foods",
      "Ensures that any income her husband earns is guarded and protected, whether money, grain, silver, or gold. She doesn’t overspend, steal, waste, or lose it. She’s a lay follower who has gone for refuge to the Buddha, his teaching, and the Saṅgha. She’s ethical. She doesn’t kill living creatures, steal, commit sexual misconduct, lie, or use alcoholic drinks that cause negligence. She’s generous. She lives at home rid of the stain of stinginess, freely generous, open-handed, loving to let go, committed to charity, loving to give and to share."
    ],
    "Duties of a good woman towards her husband [an8.48:14.4]": [
      "She’d never look down on her husband, who’s always eager to work hard, always looking after her, and bringing whatever she wants.",
      "A good woman never scolds her husband with jealous words. Being astute, she reveres those respected by her husband.",
      "She gets up early, works tirelessly, and manages the domestic help.",
      "She’s loveable to her husband, and preserves his wealth."
    ]
  }
}