{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an8.51": {
    "The eight principles of respect [an8.51:30.2]": [
      "A nun, even if she has been ordained for a hundred years, should bow down to a monk who was ordained that very day.",
      "She should rise up for him, greet him with joined palms, and observe proper etiquette toward him.",
      "A nun should not commence the rainy season residence in a monastery without monks.",
      "Each fortnight the nuns should expect two things from the community of monks: the date of the sabbath, and visiting for advice.",
      "After completing the rainy season residence the nuns should invite admonition from the communities of both monks and nuns in regard to anything that was seen, heard, or suspected.",
      "A nun who has committed a grave offense should undergo penance in the communities of both monks and nuns for a fortnight.",
      "A trainee nun who has trained in the six rules for two years should seek ordination from the communities of both monks and nuns.",
      "A nun should not abuse or insult a monk in any way."
    ],
    "The causal sequence of events leading to Mahāpajāpatī Gotamī's ordination [an8.51:30.2]": [
      "Mahāpajāpatī Gotamī asked the Buddha to let females gain the going forth from the lay life to homelessness in the teaching and training proclaimed by the Realized One.",
      "The Buddha refused three times.",
      "Venerable Ānanda asked the Buddha if a female is able to realize the fruits of stream-entry, once-return, non-return, and perfection once she has gone forth.",
      "The Buddha confirmed that a female is able to realize the fruits of stream-entry, once-return, non-return, and perfection once she has gone forth.",
      "Venerable Ānanda asked the Buddha to grant the going forth for females.",
      "The Buddha agreed to grant the going forth for females if Mahāpajāpatī Gotamī accepts the eight principles of respect.",
      "Mahāpajāpatī Gotamī accepted the eight principles of respect.",
      "The Buddha granted the going forth for females."
    ]
  }
}