{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an9.4": {
    "The spiritual practice that’s entirely full and pure [an9.4:13.5]": [
      "A mendicant is faithful but not ethical",
      "A mendicant is faithful and ethical, but does not get internal serenity of heart",
      "A mendicant is faithful, ethical, and gets internal serenity of heart, but they don’t get the higher wisdom of discernment of principles",
      "When a mendicant is faithful and ethical and gets internal serenity of heart and gets the higher wisdom of discernment of principles, they’re complete in that respect"
    ],
    "The five benefits of listening to the teachings at the right time and discussing the teachings at the right time (a causal chain) [an9.4:13.5]": [
      "A mendicant teaches the mendicants the Dhamma that’s good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. And they reveal a spiritual practice that’s entirely full and pure.",
      "Whenever they do this, they feel inspired by the meaning and the teaching in that Dhamma.",
      "Whenever they do this, they see the meaning of a deep saying in that Dhamma with penetrating wisdom.",
      "Whenever they do this, their spiritual companions esteem them more highly, thinking, ‘For sure this venerable has attained or will attain.’",
      "Whenever they do this, trainee mendicants present, who haven’t achieved their heart’s desire, but live aspiring to the supreme sanctuary, hearing that teaching, they rouse energy for attaining the unattained, achieving the unachieved, and realizing the unrealized. There may be perfected mendicants present, who have ended the defilements, completed the spiritual journey, done what had to be done, laid down the burden, achieved their own goal, utterly ended the fetters of rebirth, and are rightly freed through enlightenment. Hearing that teaching, they simply wish to live happily in the present life."
    ]
  }
}