{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an9.26": {
    "Devadatta's teaching [an9.26:7.6]": [
      "When a mendicant’s mind is solidified by heart",
      "It’s appropriate for them to say: “I understand: ‘Rebirth is ended, the spiritual journey has been completed, what had to be done has been done, there is no return to any state of existence.’”"
    ],
    "Sāriputta's correction (a causal chain) [an9.26:7.6]": [
      "When a mendicant’s mind is well consolidated by heart",
      "It’s appropriate for them to say: “I understand: ‘Rebirth is ended, the spiritual journey has been completed, what had to be done has been done, there is no return to any state of existence.’”"
    ],
    "How a mendicant’s mind is well consolidated by heart (a causal chain) [an9.26:7.6]": [
      "My mind is without greed",
      "My mind is without hate",
      "My mind is without delusion",
      "My mind is not liable to become greedy",
      "My mind is not liable to become hateful",
      "My mind is not liable to become deluded",
      "My mind is not liable to return to rebirth in the sensual realm",
      "My mind is not liable to return to rebirth in the realm of luminous form",
      "My mind is not liable to return to rebirth in the formless realm"
    ],
    "The mind remains unaffected [an9.26:7.6]": [
      "Even if compelling sights come into the range of vision they don’t occupy their mind",
      "If even compelling sounds come into the range of the mind they don’t occupy the mind",
      "If even compelling smells come into the range of the mind they don’t occupy the mind",
      "If even compelling tastes come into the range of the mind they don’t occupy the mind",
      "If even compelling touches come into the range of the mind they don’t occupy the mind",
      "If even compelling thoughts come into the range of the mind they don’t occupy the mind"
    ],
    "The simile of the stone pillar (a repetitive or similar sentence structure) [an9.26:7.6]": [
      "Suppose there was a stone pillar, sixteen feet long",
      "Eight feet were buried underground, and eight above ground",
      "Violent storms were to blow up out of the east, the west, the north, and the south",
      "They couldn’t make it tremor and tremble and quake",
      "It’s because that stone pillar is firmly embedded, with deep foundations",
      "In the same way, when a mendicant’s mind is rightly freed like this, even if compelling sights come into the range of vision they don’t occupy their mind. The mind remains unaffected. It is steady, imperturbable, observing disappearance."
    ]
  }
}