{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an9.20": {
    "The result of deeds done carelessly [an9.20:9.1]": [
      "Giving a gift carelessly",
      "Resulting in the mind not inclining toward enjoyment of nice things",
      "Resulting in children, wives, bondservants, employees, and workers not wanting to listen or pay attention"
    ],
    "The result of deeds done carefully (a causal chain) [an9.20:9.1]": [
      "Giving a gift carefully",
      "Resulting in the mind inclining toward enjoyment of nice things",
      "Resulting in children, wives, bondservants, employees, and workers wanting to listen and pay attention"
    ],
    "The great offering of Velāma compared to feeding accomplished individuals (a causal chain) [an9.20:9.1]": [
      "It would be more fruitful to feed one person accomplished in view than that great offering of Velāma.",
      "It would be more fruitful to feed one once-returner than a hundred persons accomplished in view.",
      "It would be more fruitful to feed one non-returner than a hundred once-returners.",
      "It would be more fruitful to feed one perfected one than a hundred non-returners.",
      "It would be more fruitful to feed one Buddha awakened for themselves than a hundred perfected ones.",
      "It would be more fruitful to feed one Realized One, a perfected one, a fully awakened Buddha than a hundred Buddhas awakened for themselves.",
      "It would be more fruitful to feed the mendicant Saṅgha headed by the Buddha than to feed one Realized One, a perfected one, a fully awakened Buddha.",
      "It would be more fruitful to build a dwelling especially for the Saṅgha of the four quarters than to feed the mendicant Saṅgha headed by the Buddha.",
      "It would be more fruitful to go for refuge to the Buddha, the teaching, and the Saṅgha with a confident heart than to build a dwelling for the Saṅgha of the four quarters.",
      "It would be more fruitful to undertake the training rules than to go for refuge to the Buddha, the teaching, and the Saṅgha with a confident heart.",
      "It would be more fruitful to develop a heart of love than to undertake the training rules.",
      "It would be more fruitful develop the perception of impermanence than to do all of these things."
    ]
  }
}