{
  "_comment": "This data is an early work-in-progress and contains errors. Produced by @michaelh at Discuss and Discover SuttaCentral forum - please get in touch! Finished code forthcoming.",
  "an9.42": {
    "The five kinds of sensual stimulation that are called ‘confinement’ by the Buddha [an9.42:12.2]": [
      "Sights known by the eye that are likable, desirable, agreeable, pleasant, sensual, and arousing",
      "Sounds known by the ear that are likable, desirable, agreeable, pleasant, sensual, and arousing",
      "Smells known by the nose that are likable, desirable, agreeable, pleasant, sensual, and arousing",
      "Tastes known by the tongue that are likable, desirable, agreeable, pleasant, sensual, and arousing",
      "Touches known by the body that are likable, desirable, agreeable, pleasant, sensual, and arousing"
    ],
    "The stages of creating an opening amid confinement in a qualified sense [an9.42:12.2]": [
      "Entering and remaining in the first absorption",
      "Entering and remaining in the second absorption",
      "Entering and remaining in the third absorption",
      "Entering and remaining in the fourth absorption",
      "Entering and remaining in the dimension of infinite space",
      "Entering and remaining in the dimension of infinite consciousness",
      "Entering and remaining in the dimension of nothingness",
      "Entering and remaining in the dimension of neither perception nor non-perception"
    ],
    "The confinement in each stage of creating an opening amid confinement in a qualified sense (a causal sequence) [an9.42:12.2]": [
      "Whatever placing of the mind and keeping it connected has not ceased",
      "Whatever rapture has not ceased",
      "Whatever equanimous bliss has not ceased",
      "Whatever perception of form has not ceased",
      "Whatever perception of the dimension of infinite space has not ceased",
      "Whatever perception of the dimension of infinite consciousness has not ceased",
      "Whatever perception of the dimension of nothingness has not ceased",
      "Whatever perception of neither perception nor non-perception has not ceased"
    ]
  }
}